[
    {
        "NUMBER": 1,
        "TITLE": "Baked sausage breakfast hash",
        "LINK": "https://www.recipetineats.com/baked-sausage-breakfast-hash/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "ERROR",
        "INGREDIENTS": [
            "800g / 1.6lb potatoes, 1 1/2 olive oil, 1/2 smoked paprika, 1/2 dried thyme, 1/4 onion powder, 1/4 garlic powder, 1/2 cooking salt / table salt",
            "1 red capsicum / bell pepper, 1 red onion, Pinch of salt and pepper, 1 olive oil, 100g / 4 oz streaky bacon, 500g/ 1 lb good pork sausages, Eggs – as many as you want!",
            "1 parsley, Hot buttered toast"
        ],
        "INSTRUCTIONS": [
            "Bake seasoned potatoes15 minutes at 200°C/400°C (180°C fan). Toss capsicum and onion with oil, salt & pepper, add to tray, toss. Dot with sausage meat (squeeze out), sprinkle with bacon, bake 35 minutes, tossing at the 20 minute mark. Reduce oven to 180°C/350°F (160°C fan). Make wells, crack in eggs, bake 7 minutes or until set to your taste.",
            "Preheat the oven to 200°C / 400°C (180°C fan-forced)., Toss the potatoes with the oil and seasoning in a bowl. Spread on a lined tray, just big enough to hold everything in snugly rather than spread in a single layer (Note 3). Bake for 15 minutes., Capsicum and onion – Meanwhile, in the still-dirty potato bowl, toss the capsicum and onion with the oil, salt and pepper. Add to tray, then toss with the potatoes., Sausage & bacon – Squeeze dollops of the sausage meat out of the casings and dot them randomly on top (you could cut the sausages using a knife, but that just isn't as fun). Scatter with bacon., Bake 35 minutes – Bake 20 minutes. Toss, then bake for a further 35 minutes, or until potatoes are soft., Lower oven to 180°C/350°F (160°C fan)., Eggs – Push the potato aside to make holes for the eggs. Crack eggs in. Return to oven for 7 minutes or until eggs are done to your liking (I like runny yolks which means just-set whites!)., Serve – Scatter with parsley, then serve!"
        ]
    },
    {
        "NUMBER": 2,
        "TITLE": "Biscoff stuffed cookies",
        "LINK": "https://www.recipetineats.com/biscoff-stuffed-cookies/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "280g / 9.5 oz biscoff spread, 225g / 2 US sticks unsalted butter",
            "2 1/4 plain flour / all-purpose flour, 3 cornflour/cornstarch, 1/4 baking powder, 1/2 baking soda / bi-carb, 1/2 cooking salt / kosher salt",
            "1 cinnamon powder, 1/2 all spice powder, 1/4 ginger powder",
            "3/4 brown sugar, 1/3 caster sugar / superfine super, 1 large egg, 1 yolk from a large egg, 1 vanilla extract",
            "1 1/4 white chocolate chips"
        ],
        "INSTRUCTIONS": [
            "Freeze 8 x 1.25cm/1/2\" blobs Biscoff until firm (~1 hr). Brown butter, cool, hand mix in sugar, then egg + vanilla. Mix in whisked Dry & spices, adding choc towards end. Portion into 8, stuff with frozen Biscoff. Fridge 12 -24 hrs (bare min 2 hrs). Bake from fridge cold 4 on each lined tray, 180°C/350°F (170°C fan) 19 min, top with more choc while hot if desired. Cool 20 min on tray, attack!",
            "Frozen Biscoff stuffing – Dollop Biscoff on paper lined plate or small tray, and spread into 1.25cm/1/2\" thick discs (just roughly is fine). Freeze 1 hour or until firm enough to pick up.",
            "Simmer to brown – Put the butter in a silver saucepan or small pan over medium high heat. Once melted, let it simmer (as in, bubbling) for 4 to 5 minutes, stirring every now and then, until it gets real foamy, you see little golden specks (wade through foam to see), it smells nutty & extra buttery., Cool – Immediately pour into a heatproof bowl, including all those golden specks, scraping out every bit of butter. Cool to room temperature (~45 minutes), cool enough so it won't melt the choc chips (Note 6)",
            "Whisk Dry ingredients and Spices in a separate bowl., Mix Wet – To the browned butter, add both sugars and mix with a wooden spoon. Add the egg, yolk and vanilla. Mix until smooth – it will look like caramel., Finish dough – Add the Dry ingredients and mix until the flour is mostly incorporated. Add the choc chips and stir until the flour is fully incorporated., Stuff – Measure out 8 x 125g portions of dough (4.4 oz/ heaped 1/3 cup), press dough together into a rough ball. Flatten, top with frozen Biscoff, enclose and shape into a ball with a flat base (ie tall dome), sealing cracks to avoid Biscoff leakage. Alternative: Break each into 2 balls, flatten both, sandwich Biscoff in between then fold up sides to enclose. You'll figure out the best method!",
            "Fridge 12 hours (min 2 hrs) – Place in an airtight container and refrigerate for 12 hours, up to 48 hours. BARE MINIMUM is 2 hours or until dough is firm! (Note 8)",
            "Preheat oven to 180°C/350°F oven (170°C fan-forced). (Note 9), Place fridge-cold cookies 7.5 cm/3\" apart on a tray lined with baking paper/parchment paper. (I do 4 cookies on each tray), Bake for 18 – 19 minutes or until the edges are golden and the surface is cooked (ie not melty raw dough) but still pale., Decorate and cool – Working quickly, press extra choc chips on the surface (Note 10), then cool on the tray for 20 minutes – finishes baking, edges crisp more and they get more golden all over.Tip: While hot, you can also reshape with a rubber spatula or similar into a tidy round shape., Grab now – peak eating moment! Or, transfer to a rack to cool fully before storing in an airtight container."
        ]
    },
    {
        "NUMBER": 3,
        "TITLE": "Maple sweet potato salad – with whipped tahini and crispy chickpeas",
        "LINK": "https://www.recipetineats.com/maple-sweet-potato-salad-with-whipped-tahini/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "1.5kg / 3 lb sweet potatoes, 1 maple syrup, 1 1/2 olive oil, 1/2 cooking salt / kosher salt, 1/4 black pepper",
            "400g/ 14 oz can chickpeas, 1 olive oil, 1/2 smoked paprika, 1/4 garlic powder, 1/4 onion powder, 1/4 cooking salt / kosher salt, 1/4 black pepper",
            "3 maple syrup, 1 sriracha, 1 extra virgin olive oil, 1/4 cooking salt / kosher salt, Pinch Black pepper",
            "1 1/4 plain yogurt, 3 tahini, 2 lemon juice, 1 garlic clove, 1 extra virgin olive oil, 1/2 cooking salt / kosher salt",
            "2 finely chopped coriander/cilantro leaves, 4 toasted pistachios"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 220°C/450°F (200°C fan). Arrange the oven racks so they are 20 cm/8\" apart (for air circulation)., Spicy maple sauce – Mix until combined. Set aside., Sweet potato – Cut each sweet potato lengthways into 6 wedges (or 8, if they are thicker potatoes). Put on a paper lined tray, then toss with the maple syrup, olive oil, salt and pepper. Lay sweet potato wedges on their side., Chickpeas – Drain the chickpeas then spread on a tray (still wet)., Baking – Put both trays in the oven (sweet potato on the top shelf). Roast the potatoes for 30 minutes, turning them at the halfway mark. Take the chickpeas out after 10 minutes to flavour them., Crispy seasoned chickpeas – Remove the oven dried chickpeas from the oven after 10 minutes (Note 4). Push them to one side of the tray, drizzle/sprinkle and toss with the oil, spices, salt and pepper. Toss well using a rubber spatula, then return to the oven for a further 15 – 20 minutes until they're crispy (they will clatter! Note 4)., Sweet potato charring (optional) – After 30 minutes (or when the potatoes are soft), switch the oven grill/broiler to high. Tuck in or fold down excess paper around the tray edges (so it doesn't touch heat element and catch fire). Stand the wedges sharp edge facing up, then pop it under the broiler for 3 to 5 minutes until a bit charred on the edges. ⚠️ SAFETY NOTE: Do not walk away, make sure the paper does not catch fire., Whipped tahini yogurt sauce – While the potatoes are roasting whisk ingredients in a heat-proof bowl just to combine. When ready to use, microwave for just 30 seconds on high, then whisk again for 10 seconds – it will resemble softly whipped cream. (Note 5), Optional tahini drizzle – Remove 1/4 cup of the tahini sauce and loosen with a little water to a drizzle-able consistency., Assemble – Spread the whipped tahini on a large plate. Pile the sweet potato on, mostly in a single layer. Drizzle with the tahini drizzle (if using), the spicy maple sauce, sprinkle with most of the pistachio and coriander. Sprinkle over chickpeas, then sprinkle with the remaining coriander and pistachios. EAT! (PS Great served warm or at room temperature)"
        ]
    },
    {
        "NUMBER": 4,
        "TITLE": "Cheese, Garlic and Herb Quick Bread (no yeast)",
        "LINK": "https://www.recipetineats.com/cheese-herb-garlic-quick-bread/",
        "AUTHOR": "Nagi | RecipeTin Eats",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "7 oz / 200g block of cheese",
            "2 fresh rosemary, 2 fresh parsley leaves, 1 dried oregano, 1/2 dried thyme, 2 garlic cloves, 3 extra virgin olive oil, 1/2 cooking salt / kosher salt",
            "2 1/4 plain flour, 1 baking soda, 3/4 cooking salt / kosher salt",
            "1/2 plain yogurt, 3/4 milk, 2 large eggs, 3 1/2 tbsp (50g) unsalted butter, 2 olive oil, 2 small garlic cloves"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 180°C/350°F (both fan and standard ovens)., Loaf tin – Grease a 21 x 11 x 7 cm loaf pan (8.3 x 4.5 x 2.75\") lightly with butter or oil spray then line with baking paper (parchment paper). (Note 3), Herb and garlic swirl – Mix the ingredients in a small bowl, it should be a thick dollop-able mixture., Dry ingredients – Whisk the Dry Ingredients in a bowl., Wet ingredients – Whisk the wet ingredients in a separate bowl., Combine – Make a well in the centre of the Dry Ingredients. Pour the Wet Ingredients in and mix until just combined., Swirls and cheese Layer 1 – Pour 1/3 of the batter into the bread tin. Dollop 1/3 of the herbs across the top then use a knife to \"swirl\" it into the batter up and down, and also turning the batter over (refer photo below). Use 1/3 of the cheese slices and push them randomly into the batter. Push some all the way in and leave some poking out of the batter., Layers 2 and 3 – Repeat twice more. Don't worry about herb mixture exposed and cheese slices sticking out the surface, looks amazing when baked!, Bake for 30 minutes, or until the top is golden. Remove from oven and cover with foil, then bake for a further 20 minutes (total baking time 50 minutes). Check to make sure the centre is cooked by inserting a skewer – it should come out clean., Cool in the loaf tin for 5 minutes then turn the bread out onto a cooling rack. Allow to cool for at least another 10 minutes before cutting thick slices. Butter is  optional but always welcome!"
        ]
    },
    {
        "NUMBER": 5,
        "TITLE": "Ginger chicken and rice (one pot recipe!)",
        "LINK": "https://www.recipetineats.com/ginger-chicken-and-rice/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "4 oil, 500g/ 1 lb chicken thighs, 1 1/2 long grain rice, 2 chicken stock, 4 green onion stems, 1 1/2 ginger, 2 large garlic cloves, 4 – 5 ginger",
            "150g / 5oz shiitake mushrooms, 150g / 5 oz oyster mushrooms, 200g / 7 oz king mushrooms, 2 salt and white pepper",
            "3 kecap manis, 2 fish sauce, 1/8 white pepper"
        ],
        "INSTRUCTIONS": [
            "ABBREVIATED – Toss chicken with 1 1/2 tbsp sauce. Sear mushrooms in 2 batches, remove. SeaL chicken, add garlic, ginger and white part green onions towards end. Stir in rice, add stock and ginger slices, cover with mushrooms, steam 20 min. Rest 10 min, toss with sauce and green onion.",
            "Sauce – Mix sauce ingredients in a small bowl. Toss chicken with 1 1/2 tbsp of the sauce, set the rest aside for drizzling., Lightly sear mushrooms – Heat 1 1/2 tbsp oil in a large heavy based pot on high heat. Cook half the mushrooms with a pinch of salt and pepper until some of the mushrooms have a light tinge of golden on the surface, but don't try to cook them all the way through (we want to do that in the rice). Remove into bowl. Repeat with remaining mushrooms., Seal chicken – Heat the remaining 1 tablespoon of oil until hot. Add the chicken and stir for 1 minute, just until the surface is sealed but inside still raw. Add white part of green onion, garlic and ginger, stir 30 seconds. Add rice, stir briefly just to coat in oil., Simmer liquid – Add stock and ginger slices. Bring to a rapid simmer. Scatter mushrooms across surface (add any pooled liquid too), then let it come to a rapid simmer again., Steam 20 minutes – Put the lid on, reduce stove to low (or medium low, for weak burners). Cook for 20 minutes (do not stir) until the liquid is fully absorbed., Rest 10 minutes – Remove pot from the stove with the lid still on and rest for 10 minutes., Drizzle and toss – Drizzle remaining sauce all over, add green part of green onions. Gently toss until the green onion is mostly wilted. Serve!"
        ]
    },
    {
        "NUMBER": 6,
        "TITLE": "Easy French Apple Tart – Tarte Fine aux Pommes",
        "LINK": "https://www.recipetineats.com/easy-french-apple-tart/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "12 minutes",
        "INGREDIENTS": [
            "1 butter puff pastry, 5 caster sugar, 2 gala apples, 1 unsalted butter",
            "Icing sugar / powdered sugar, Vanilla ice cream"
        ],
        "INSTRUCTIONS": [
            "ABBREVIATED: Sprinkle paper with 3t sugar, put puff on, fold in 1cm / 0.4\" edge. Top with apple, brush butter, sprinkle 2t sugar. Bake on preheated tray at 210°C/375°F (190°C fan) for 30 minutes.",
            "Hot tray – Put a baking tray in the oven then turn it on and pre-heat to 210°C/375°F (190°C fan-forced)., Sugar underside of puff – Place a sheet of baking paper (parchment paper) on the counter. Sprinkle with 3 teaspoons of sugar, roughly in the shape of the puff pastry sheet., Fold edge – Place puff pastry on top of the sugar. Fold the edges inwards to create a 1cm / 0.4\" edge., Apples – Arrange the apples slices in 3 rows, overlapping them slightly., Butter and sugar – Brush the apple slices and edges with melted butter, then sprinkle with the sugar (apple and edge)., Bake – Transfer the tart on the paper to the hot baking tray (keep it on the paper). Bake for 30 minutes, or until the edges are golden., Serve – Cut into 6, dust with icing sugar and serve warm with vanilla ice cream."
        ]
    },
    {
        "NUMBER": 7,
        "TITLE": "Chinese eggplant and minced pork – Sichuan Fish Fragrant Eggplant",
        "LINK": "https://www.recipetineats.com/chinese-eggplant-and-minced-pork/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 vegetable oil, 1 large eggplant or 2 medium/small, 100g / 3.5 oz pork mince / ground pork, 1 ginger, 1 1/2 garlic, 1 green onion, 1 pickled red chilli, 1 broad bean sauce",
            "1 1/2 cornflour / cornstarch, 1 light soy sauce, 1/2 dark soy sauce, 1 1/2 sugar, 1 honey, 3 1/2 black vinegar, 1/2 water",
            "Steamed white rice"
        ],
        "INSTRUCTIONS": [
            "ABBREVIATED – Mix sauce. Fry eggplant until soft. Keep 2T oil. Cook pork 2 min, then garlic, ginger and white part green onion for 30 sec. Cook chilli + broad bean sauce 1 min. Add eggplant and sauce in 2 batches, once thickened, serve!",
            "Sauce – Mix the cornflour and light soy in a jug until lump free. Add the remaining Sauce ingredients and mix to combine. Set aside., Fry eggplant – Heat oil in a wok on high heat until hot – 180°C/350°F. Add half of the eggplant and fry for around 4 minutes, stirring and turning gently a few times, until soft all the way through and a bit browned on the surface. Remove with a slotted spoon onto a paper towel lined tray. Repeat with remaining eggplant., Remove oil – Carefully remove the leftover oil from the wok except 2 tablespoons, for cooking., Stir fry – Cool the wok slightly then return to high heat. Add the pork and cook for 1 – 2 minutes, breaking it up as you go, until you no longer see pink. Add garlic, ginger, white part of the green onion. Stir fry for 30 seconds. Add pickled red chilli and broad bean sauce. Cook for 1 minute., Add sauce – Give the Sauce a quick mix (to dissolve settled cornflour). Add eggplant, then add half the Sauce into the wok, toss gently until the sauce starts thickening – about 30 to 45 seconds. Add remaining Sauce, toss gently for 45 seconds until it thickens (goal: between maple syrup and honey)., Serve – Turn off heat. Pour into a serving bowl, sprinkle with green onion. Serve with rice.",
            "Brown eggplant – Heat 2 tbsp oil in a large non-stick pan (with lid) over medium high heat. Pan fry eggplant for 1 1/2 minutes on each side until lightly browned., Steam – Carefully add 1/3 cup water around the eggplant (it will steam, so be careful). Immediately cover with a lid to trap the steam. Steam for 2 minutes or until the water has evaporated and the eggplant is soft all the way through (if needed, add more water and keep steaming)., Proceed – Transfer eggplant to a plate. Proceed with recipe using the large non stick pan rather than wok."
        ]
    },
    {
        "NUMBER": 8,
        "TITLE": "Tomahawk Steak",
        "LINK": "https://www.recipetineats.com/tomahawk-steak/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "1 tomahawk steak, 2 cooking salt/kosher salt, 3/4 black pepper, 1 olive oil",
            "Cowboy butter, Bearnaise sauce, Cafe de Paris, Creamy mushroom sauce, Chimichurri sauce, Blue cheese sauce, Red wine sauce, Dijon or seeded mustard"
        ],
        "INSTRUCTIONS": [
            "Season, slow-roast on rack at 140°C/285°F (120°C fan) for 40-45 minutes to 50°C/122°F. Rest 10 minutes. Preheat BBQ until screaming hot, drizzle steak with oil, lower BBQ to low/med low and sear on hot BBQ 3 – 4 minutes on each side (temp 55°C (128°F)). Rest 3 minutes (temp rises to 57°C/135°F = perfect medium rare 🙌🏻). Slice, serve with Cowboy Butter!",
            "De-chill – Take the steak out of the fridge 1 hour prior to cooking. Remove from packaging and pat the surface dry. (Do not salt)., Preheat the oven to 140°C/285°F (120°C fan-forced)., Season – Sprinkle the steak meat with salt and pepper, then use your hands to rub it in., Slow(ish) roast – Put the steak on a rack and set it on a baking tray. (Note 2) Bake for 40 to 45 minutes, or until the internal temperature is 50°C/122°F (for medium rare, see Note 3 for other doneness)., Rest – Take the tray out of the oven and leave the steak on the counter for 10 minutes. (Internal temperature should rise by 3 degrees).",
            "Preheat the BBQ on high until it's screaming hot. Use the flat plate side if you're not a confident BBQ'er, or the grill side if you're a BBQ master. (Note 4), Oil – Drizzle the oil on the steak and lightly pat to spread (don't rub off the salt), using most of the surface area of the meaty part., Turn BBQ DOWN – If using the grill side, reduce to low (if yours is strong, mine is) or medium low (for weaker ones). If using the flat plate side, lower to medium. Do this just before putting the tomahawk on., Edges first – Using tongs, hold the steak upright and sear the edges and bone first (only if you've got meat on it), rotating and moving every minute or so to achieve this all the way around. ⚠️Flare-ups – If searing on the grill side, don’t walk away – flare-ups are inevitable. See Note 4 for managing., Steak crust – Then place the steak down on the grill and cook for 3 to 4 minutes on each side, or until the internal temperature is 55°C / 131°F. For classic X grill lines, rotate once 45° partway through., Rest the steak on a rack for 3 minutes – the internal temperature will rise to 57°C/135°F which is perfect medium rare., Serve – Cut into 1 cm / 0.4\" thick slices. Serve with steak sauce of choice! (Pictured: Cowboy Butter, highly recommend!)."
        ]
    },
    {
        "NUMBER": 9,
        "TITLE": "Cowboy Butter – for steak, and so much more!",
        "LINK": "https://www.recipetineats.com/cowboy-butter/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "100g / 7 tbsp unsalted butter, 1 large garlic clove, 1 Dijon mustard, 1 smoked paprika, 1 chilli flakes / red pepper flakes, 1/4 cooking salt / kosher salt"
        ],
        "INSTRUCTIONS": [
            "Sauté garlic – In a small frying pan, melt 1 tbsp (15g) of butter over medium heat until it starts foaming then add the garlic and cook for 30 seconds while stirring until it becomes very, very light golden. Remove from the stove and let it cool for 3 minutes (the garlic will go more golden)., Mix – Put the rest of the butter and remaining ingredients in a small mixing bowl. Pour the garlic butter over. Mix until combined., Serve with steak! It's also excellent with other cooked meats, seafood and even vegetables.",
            "I like to use it softened as it melts thicker over hot steak. You can also melt gently then dip bites of steak in, or roll it into a log using cling wrap, refrigerate then cut slices off on an as-need basis (you can place the coins on the steak to let it melt)."
        ]
    },
    {
        "NUMBER": 10,
        "TITLE": "Country harvest root vegetable soup",
        "LINK": "https://www.recipetineats.com/country-harvest-root-vegetable-soup/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "2 extra virgin olive oil, 1 tbsp (15g) unsalted butter, 1 onion, 3 garlic cloves, 1 curry powder, 1 dried thyme leaves, 1 1/2 litre (6 cups) water, 2 cooking salt/kosher salt, 1/2 black pepper, 1/2 thickened cream",
            "1 potato, 1 sweet potato, 2 carrots, 1 parsnip, 1 celeriac",
            "Warm crusty bread, Parsley, extra curry powder, black pepper"
        ],
        "INSTRUCTIONS": [
            "Sauté – Put the olive oil and butter in a large heavy-based pot over medium-high heat. Once the butter is melted, cook the onion and garlic for 2 minutes until the onion is softened., Add root vegetables, thyme and curry powder. Cook for three minutes stirring regularly, until the outside of the vegetables starts to soften., Simmer 15 minutes – Turn stove up to high. Add water, salt and pepper. Stir, then once it comes to a simmer, lower heat to medium high and simmer rapidly for 15 minutes (no lid) until all the vegetables are soft (check with knife)., Stir in cream, simmer for 1 minute., Blitz – Remove from heat and use a stick blender to blitz until smooth. (Note 5 for blender) Adjust to taste – water to thin, salt and pepper if needed, extra cream for more indulgent., Serve in bowls. Drizzle with cream, pinch of curry powder, parsley and pepper. Serve with warm crusty bread!"
        ]
    },
    {
        "NUMBER": 11,
        "TITLE": "",
        "LINK": "https://www.recipetineats.com/dozer-turns-13/",
        "AUTHOR": "",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": 12,
        "TITLE": "Puttanesca Fish Tray Bake",
        "LINK": "https://www.recipetineats.com/puttanesca-fish-tray-bake/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "600g/1.2 lb baby potatoes, 1 1/2 extra virgin olive oil, 1/2 cooking salt / kosher salt, 1/4 black pepper",
            "1 medium fennel, 1 1/2 cups (200g) cherry or grape tomatoes, 1/2 pitted kalamata olives, 3 garlic cloves, 3 baby capers, 3 anchovy fillets, 400g/ 14oz canned tomato, 1/2 chilli flakes, 1 dried organo, 1/4 cooking salt / kosher salt, 1/4 black pepper",
            "4 x 160 – 180g / 6oz barramundi fillets, 1/2 cooking salt / kosher salt, 1/4 black pepper, 1 1/2 extra virgin olive oil",
            "1 basil leaves, Warm crusty bread"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 220°C/390°F (200°C fan-forced)., Roast potatoes: In a large mixing bowl, toss the potatoes with the oil, salt and pepper. Spread on a baking tray with a rim at least 2cm/0.8\" high (or 23x33cm / 9×13\" pan). Roast for 20 minutes., Puttanesca sauce: Meanwhile, mix all the sauce ingredients together (use the potato bowl, no need to clean). Add to the tray, toss with the potatoes, return to the oven for 10 minutes., Season fish: Pat the fish dry with paper towels. Sprinkle each side with the salt and pepper., Bake fish: Place fish on top of puttanesca sauce. Drizzle all over with the 1 1/2 tablespoons of oil. Bake 15 minutes or until fish is just cooked through (it should flake easily)., Serve: Remove from the oven. Drizzle with a bit more olive oil, scatter with basil and reserved fennel fronds. Serve with warm, crusty bread!"
        ]
    },
    {
        "NUMBER": 13,
        "TITLE": "B85 Beef Sausage Rolls – with jalapeño and cheese",
        "LINK": "https://www.recipetineats.com/b85-beef-sausage-rolls/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 small onion, 1/2 panko breadcrumbs, 500g/1 lb beef mince, 1 egg, 2 garlic cloves, 1 beef stock cube, 1/2 cooking salt / kosher salt, 1/4 black pepper, 1/3 pickled jalapeno, 1 1/2 cheddar, 1/2 parmesan, 2 frozen puff pastry, 1 egg",
            "1 white sesame seeds, 1/2 black sesame seeds",
            "Aussie tomato sauce or ketchup"
        ],
        "INSTRUCTIONS": [
            "Toss grated onion and panko, then mix everything else except cheeses. Then mix in cheese. Divide in 2, wrap in pastry, seal with egg white. 3 slits, brush with yolk, sprinkle with sesame. 35 minutes at 200°C/425°F (180C fan) then 15 minutes on a rack.",
            "Preheat oven 200°C/425°F (180C fan-forced)., Onion soak – Grate the onion in a bowl using a box grater, reserving all the onion juices. Add panko breadcrumbs and toss to wet., Everything else but cheese – Then add beef, egg, garlic, stock cube, salt, pepper and jalapeño. Mix well with hands to combine., \"Crumble\" in cheese – Add cheeses, then use fingers to firstly “crumble” the cheese through the beef before mixing well with hands (this method prevents cheese from clumping together)., Roll – Barely thaw puff pastry (stiffer = easier to handle). Divide meat into 2 equal logs. Roll up in the puff pastry, then overlap the base with double layer, sealing with egg white. Finish with the seam side down and trim off surplus puff pastry (about 2 cm/0.8\")., Finish sausage rolls – Cut each log in half. Cut 3 diagonal slashes on the top of each sausage roll. Brush with egg yolk, sprinkle with sesame seeds., Bake – Place the sausage rolls on a paper lined tray. Bake for 35 minutes, then transfer onto rack (to elevate out of fat, Note 5). Bake a further 15 minutes until pastry is deep golden and underside is crispy., Cool on rack 5 minutes before attacking! Serve with Aussie tomato sauce or ketchup."
        ]
    },
    {
        "NUMBER": 14,
        "TITLE": "Melting Afghan chickpea curry",
        "LINK": "https://www.recipetineats.com/melting-afghani-chickpea-curry/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3 ghee, 2 cinnamon sticks, 1 onion, 1 1/2 grated ginger, 1 1/2 grated garlic, 2 bay leaves, 1/2 dried red split lentils, 1 water, 1 litre vegetable stock, 1/2 cooking / kosher salt, 3 x 400g/14oz cans chickpeas, 1/4 baking soda / bi-carbonate soda",
            "1 coriander powder, 1 cumin powder, 1 1/2 turmeric powder, 3/4 cardamom powder, 1/4 ground cloves",
            "Basmati rice, Yogurt, Fresh coriander / cilantro leaves"
        ],
        "INSTRUCTIONS": [
            "Sauté – Melt the ghee in a large pot over medium high heat. Add the cinnamon and toast for 30 seconds. Add the onion, ginger, garlic and bay leaves. Cook for 3 minutes until the onion is translucent (stir regularly so the garlic & ginger don't catch)., Spices and lentils – Add the Spices and stir for 30 seconds. Add the lentils and stir to coat in the spices., Simmer lentils – Add the stock and salt. Stir, bring to a simmer. Lower the head to medium, put the lid on and simmer for 15 minutes., Simmer chickpeas – Add the chickpeas, water and baking soda. Increase the heat to make it simmer again. Then lower the stove slightly and leave to simmer gently for 30 minutes without a lid or until the lentils mostly broken down to make a thin gravy (you can cook an extra 10 minutes to thicken more if you want)., Serve with rice on the side and Afghan or other flatbreads for dunking, drizzled with yogurt and sprinkled with fresh coriander if you want (I do)."
        ]
    },
    {
        "NUMBER": 15,
        "TITLE": "",
        "LINK": "https://www.recipetineats.com/bake-with-brooki-penguin-plagiarism-allegations-statement/",
        "AUTHOR": "",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": 16,
        "TITLE": "Whipped ricotta one pot chicken pasta",
        "LINK": "https://www.recipetineats.com/whipped-ricotta-one-pot-chicken-pasta/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "500g/1 lb chicken thigh fillets, 1/2 cooking salt/kosher salt, 1/4 black pepper",
            "220g/ 7 oz sun-dried tomato stripes in oil, 3 oil, 1 small onion, 2 garlic cloves, 1 tomato paste, 1/4 dry white wine, 400g/14 oz canned crushed tomato, 350g / 12oz fusilli pasta (spirals), 1 litre / 4 cups chicken stock/broth, 1/4 cooking salt/kosher salt, 1/4 black pepper, 1 basil leaves",
            "1/2 ricotta, 4 milk, 1/4 finely grated parmesan"
        ],
        "INSTRUCTIONS": [
            "Whipped ricotta – Put the ingredients in a bowl. Whisk vigorously for 10 to 15 seconds until it becomes the texture of softly whipped cream. Add milk to loosen, if needed., Seal chicken – Heat sun dried tomato oil in a large heavy based pot over high heat. Add the chicken. sprinkle with salt and pepper. Cook for 3 minutes until the outside is sealed but the inside is still raw. Remove with slotted spoon into a bowl., Sauté – In the same pot, add the onion and garlic. Cook for 3 minutes until the onion is translucent. Add the tomato paste and oil drained sun dried tomatoes (reserve any remaining oil for another use). Cook for 1 minute., Deglaze – Add white wine and let it simmer rapidly for 1 – 2 minutes, stirring regularly, until mostly evaporated., Cooking liquid – Add pasta and cooked chicken along with any juices accumulated in the bowl. Stir to coat in all the tasty flavours. Add the stock, canned tomato, salt and pepper., Cook 15 minutes – Give it a good stir, let it come to a boil then lower the heat to medium high so it's simmering rapidly but not boiling like crazy. Cook for 15 minutes (no lid), stirring every 2 minutes or so at first then more regularly towards the end, so the base doesn't catch. Lower the heat a touch towards the end, if needed., How to tell it's done – Most of the liquid should be absorbed and the pasta should be just cooked (al dente), though still a little soupy (that's good, it gets absorbed quickly while serving). Stir in the basil., Serve – Transfer into a serving bowl or divide between bowls. Dollop the whipped ricotta on top then randomly smear (or let everyone do that themselves), it will get all melty. Dig in!"
        ]
    },
    {
        "NUMBER": 17,
        "TITLE": "Slow-roast Easter stuffed lamb",
        "LINK": "https://www.recipetineats.com/slow-roast-easter-stuffed-lamb/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1.35 – 1.5 kg/ 2.7 – 3 lb deboned lamb shoulder, 1 1/2 cooking salt / kosher salt, 1 black pepper, 2 extra virgin olive oil",
            "1 tbsp / 20g unsalted butter, 2 eschalots, 3 garlic cloves, 300g/ 10 oz mushrooms, 2 baby spinach, 3 skinless hazelnuts, 3 pistachios, 1 1/2 parsley, 1 1/2 rosemary, 1 lemon zest, 1/2 cooking salt / kosher salt, 1/4 black pepper",
            "1 kg/ 2 lb baby potatoes, 1/2 cooking salt / kosher salt, 1/4 black pepper, 1 extra virgin olive oil",
            "2 flour, 1 1/4 beef stock/broth, 1/4 dark soy sauce, Salt and pepper",
            "1 pistachios, Rosemary sprigs, Sautéed green beans"
        ],
        "INSTRUCTIONS": [
            "Roast hazelnuts – Preheat oven to 180°C/350°F (160°C fan-forced). Roast the hazelnuts for 8 minutes. Cool, then roughly chop., Blitz the mushrooms in a food processor, scraping down the sides as needed, until the mushrooms are chopped into little 3mm/0.1\" pieces., Duxelle – Melt the butter in a non-stick pan over high heat. Add eschalots, garlic and mushrooms. Cook, stirring regularly, for 5 minutes or until the liquid that comes out of the mushrooms mostly evaporates. Add spinach and cook until wilted., Cool – Transfer the filling into a bowl. Cool for 20 minutes then stir in remaining ingredients., Stuffing log – Pile the stuffing on a piece of cling wrap. Use your hands to roughly shape it into a 35cm / 13.5\" long log. Tightly roll up with cling wrap. Place in the freezer for 3 hours (up to 3 days) until it is firm. (Note 7)",
            "Pound – Place the lamb shoulder fat-side down. Cover with plastic wrap (I use go between) or baking paper. Then use a rolling pin or meat mallet to pound the meat (hard!) into a 40 x 22cm rectangle (15.5 x 8.5\"). Aim for even thickness ~1.75cm (2/3\"). Trim and patch as needed to make your rectangle – see video, I cut & rearrange 2 large flappy bits that stick out., Roll – Sprinkle the surface of the lamb with half the salt and pepper. Unwrap the frozen stuffing log then roll it up tightly, finishing with the seam side down., Tie – Secure with kitchen twine tied every 2cm / 0.8\". (See video for tips)",
            "Preheat oven to 220°C/425°F (200°C fan-forced)., Season – Rub the lamb roll all over with the olive oil, then sprinkle with the remaining salt and pepper., Potatoes – Toss the potatoes with the salt, pepper and olive oil in a large roasting pan (not a baking tray). Put the lamb on top of the potato, on the diagonal if needed to fit., Short high temp roast – Roast for 30 minutes (renders some fat and gives the colour a head start)., Slow roast – Turn the oven down to 160°C/320°F (140°C fan). Cook for 2 1/2 hours, or until the internal temperature is 98°C/208°F or the meat can be fairly easily teased apart using two fork (check in a discreet spot)., Rest – Remove lamb and potato to a tray and loosely cover with foil while you make the gravy.",
            "Drippings – The roasting pan will have meat juices and fat. Tilt the pan so you can scoop off and discard all but 3 tablespoons of fat (the clear liquid that rises to the surface). Make sure you keep the dark brown juices in the pan. If you're short of fat, add butter., Heat fat – Put the pan directly on the stove over medium heat. Once the fat is hot, sprinkle the flour over and stir for 1 minute., Thicken – While stirring, slowly pour in the stock. Add soy sauce, then keep stirring as it bubbles gently until it thickens into a maple syrup consistency., Taste and add more salt and pepper if desired (I don't need more). Pour into a jug (strain, if needed).",
            "Cut the string off the lamb then slice into 2cm / 0.8\" thick slices., Plate on a platter, surround with the potatoes. Serve with gravy, sprinkled with extra chopped pistachios if desired! (Shown in the video with sautéed green beans)."
        ]
    },
    {
        "NUMBER": 18,
        "TITLE": "Pikelets",
        "LINK": "https://www.recipetineats.com/pikelets/",
        "AUTHOR": "Nagi | RecipeTin Eats",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "1 1/4 plain flour, 2 1/2 baking powder, 2 white sugar, Pinch of salt, 1 large egg, 3/4 milk, 1/2 vanilla extract, 2 butter",
            "Strawberry jam, Whipped cream"
        ],
        "INSTRUCTIONS": [
            "Whisk dry – Whisk the flour, baking powder, salt and sugar in a bowl., Add wet – Make a well in the centre. Add the egg, milk and vanilla, then whisk until it's almost lump free. The batter should be the consistency like thick honey – looser than tomato sauce, thicker than maple syrup. (Note 2), Melt 1 tsp butter in a non-stick pan over medium high heat (or medium, for strong stoves). Then most of the butter off with a paper towel so there are no visible drops of bubbles of butter (Note 3)., Drop ~2 tbsp batter into the pan and coax into 7.5cm/3\" rounds. An ice cream scoop with lever will be your friend here. I cook 4 at a time., Cook until bubbles appear on the surface and once 4 or more of these bubbles pop (1 1/2 minutes), this means they are ready to flip. Flip with confidence! Then cook the other side for 1 minute or until golden., Keep cooking – Remove onto a plate. Cook the next batch (no need to add extra butter until 3rd batch)., Serve warm with jam and cream, or butter!"
        ]
    },
    {
        "NUMBER": 19,
        "TITLE": "Beef in black bean sauce",
        "LINK": "https://www.recipetineats.com/beef-in-black-bean-sauce/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1/2 cup (75g) preserved black beans, 400g/14 oz beef rump steak (US: top sirloin), 1 brown onion, 1 green capsicum, 1 garlic, 1/2 peanut oil, 1 Chinese cooking wine",
            "1 light soy sauce, 1 dark soy sauce, 1 oyster sauce, 2 cornflour / cornstarch, 1/4 baking soda, 1 sesame oil",
            "1 light soy sauce, 2 white sugar, 2 cornflour/cornstarch, 1 water",
            "White rice"
        ],
        "INSTRUCTIONS": [
            "Marinade beef 1 hour, soak beans, mix sauce. Shallow fry beef 30 seconds, remove. Discard all but 3 tbsp oil. Add and cook in this order: black beans 20 seconds, garlic 10 seconds, onion + capsicum 1 minute, beef 1 minute, cooking wine 30 seconds, sauce 1 minute or until thickened. Serve!",
            "Mix the marinade ingredients EXCEPT sesame oil in a bowl. Add beef, mix to coat. Add sesame oil, mix again., Marinade – Refrigerate to marinade for 1 hour.",
            "Soak beans – Put the salted black beans in a medium bowl and cover with water. Set aside for 30 minutes to 1 hour to soak, then drain., Mix sauce – Put the cornflour, soy sauce and sugar in a jug or small bowl. Mix until lump free then mix in the water. Set aside.",
            "Cook beef – Heat the oil in a wok (or non stick pan) over high heat. Add the beef and cook, tossing, for 30 seconds until it changes from red to brown. Remove with a slotted spoon onto a plate., Discard most of the oil in the wok, keep just 3 tablespoons., Aromatics – Return the wok to high heat. Add the black beans and stir for 20 seconds, then add the garlic and stir for 10 seconds. Add the capsicum and onion, cook for 1 minute., Beef – Add beef and any juices pooled on the plate, toss for 1 minute. Pour the Chinese cooking wine around the sides of the wok so it runs down into the beef then toss for 30 seconds (Note 8), Sauce – Pour the sauce in, then stir and let it bubble for 1 minute or until the sauce thickens, is shiny and coats the beef beautifully., Serve – Pour into a serving bowl and serve with rice!"
        ]
    },
    {
        "NUMBER": 20,
        "TITLE": "Lebanese Lemon Garlic Chicken – Al Aseel copycat",
        "LINK": "https://www.recipetineats.com/lebanese-lemon-garlic-chicken-al-aseel-copycat/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "500g/ 1lb chicken tenderloin",
            "4 Greek or plain yogurt, 3 lemon juice, 1 garlic, 1 olive oil, 1 cooking salt / kosher salt",
            "1 Greek or plain yogurt, 3/4 garlic, 2 extra virgin olive oil, 1 lemon juice, 1 tahini, 1 water, 1 cooking salt / kosher salt",
            "2 olive oil, 1 parsley, Lemon wedges and extra virgin olive oil, Lebanese bread"
        ],
        "INSTRUCTIONS": [
            "Marinade chicken 12 – 24 hrs. Cook in 2 batches. Whisk sauce, rest 1 hr, warm just before serving. Smother chicken, serve!",
            "Marinade – Mix the marinade ingredients in a bowl. Add the chicken, toss to coat then refrigerate to marinate for 12 – 24 hours (Note 2)., Sauce – Put the sauce ingredients in a microwaveable bowl and whisk to combine. Set aside for 1 hour + to let the garlic flavour meld. (Note 4), Cook chicken – Drain off excess marinade from the chicken. Heat 1 tbsp oil in a large non stick pan over high heat. Place half the chicken in and cook for 1 1/2 – 2 minutes on each side until golden. Remove onto a plate., Repeat – Scrape out / roughly wipe loose black bits out of the pan. Reheat remaining oil and cook remaining chicken. Rest for 2 minutes., Warm sauce – While the chicken is resting, microwave for 40 seconds to warm (but not hot) then give it a good whisk. Taste and add more lemon for tangier, or more water to loosen (some yogurts are thicker than others)., Serving – Spread half the sauce in a shallow bowl. Use a spatula to transfer the chicken onto the yogurt. Spoon over remaining sauce, finish with a swish of olive oil and sprinkle of parsley. Serve!"
        ]
    },
    {
        "NUMBER": 21,
        "TITLE": "Lebanese Fattoush",
        "LINK": "https://www.recipetineats.com/lebanese-fattoush-salad/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "ERROR",
        "INGREDIENTS": [
            "2 pita bread or 1 lebanese bread, 2 olive oil, 1/4 cooking salt / kosher salt",
            "5 cos/romaine lettuce, 2 Lebanese cucumbers, 1 cherry tomatoes, 1/2 small red onion, 5 red radish, 1/2 mint leaves, 1 roughly chopped parsley",
            "1/4 extra virgin olive oil, 2 lemon juice, 2 pomegranate molasses, 1 medium garlic clove, 1 sumac, 1/2 cooking salt / kosher salt"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 220°C/425°F (200°C fan-forced)., Separate the pita bread into 2 thin sheets. Cut into 3cm / 1.2\" squares., Pile on a tray, drizzle with olive oil, toss, then sprinkle with the salt and toss again., Spread on the tray. Bake for 5 minutes or until crispy, then cool on the tray before use.",
            "Dressing – Shake the dressing ingredients in a jar until well combined., Salad – Place the Salad ingredients in a large bowl. Drizzle over half the dressing, toss. Add most of the crispy pita chips, drizzle with remaining dressing and toss again., Serve – Transfer into a serving bowl, top with remaining crispy pita and serve immediately."
        ]
    },
    {
        "NUMBER": 22,
        "TITLE": "",
        "LINK": "https://www.recipetineats.com/comeback-post/",
        "AUTHOR": "",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": 23,
        "TITLE": "The Chocolate Chip Cookies of my dreams!",
        "LINK": "https://www.recipetineats.com/the-chocolate-chip-cookies-of-my-dreams/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "225g / 2 US sticks unsalted butter",
            "2 cups plain flour / all-purpose flour, 3 cornflour/cornstarch, 1/4 baking powder, 1/2 baking soda / bi-carb, 1/2 cooking salt / kosher salt",
            "1 brown sugar, 1/2 cup (100g) caster sugar / superfine super, 1 large egg, 1 yolk from a large egg, 1 vanilla extract",
            "1 1/2 dark chocolate chips, 3/4 milk chocolate chips"
        ],
        "INSTRUCTIONS": [
            "Brown butter, cool, hand mix in sugar, then egg + vanilla. Mix in whisked Dry, adding choc towards end. Form 8 x 155g (1/2 cup) discs 3.75cm/1.5\" thick. Fridge 12 -24 hrs. Bake from fridge cold 4 at a time, 180°C/350°F (170°C fan) 17 min, top with more choc while hot if desired. Cool 20 min on tray, attack!",
            "Simmer to brown – Put the butter in a silver saucepan or small pan over medium high heat. Once melted, let it simmer (as in, bubbling) for 4 to 5 minutes, stirring every now and then, until it gets real foamy, you see little golden specks (wade through foam to see) and it smells nutty & extra buttery., Cool – Immediately pour into a heatproof bowl, including all those golden specks. Cool to room temperature (~45 minutes), cool enough so it won't melt the choc chips (Note 4)",
            "Whisk Dry ingredients in a separate bowl., Mix Wet – To the browned butter, add both sugars and mix with a wooden spoon. Add the egg, yolk and vanilla. Mix until smooth – it will look caramel., Finish dough – Add the Dry ingredients and mix until the flour is mostly incorporated. Add the choc chips and stir until the flour is fully incorporated., Make dough discs – Measure out 8 x 155g (5.3 oz/ 1/2 cup) portions of dough, roll into a ball then shape into a 3.75cm/1.5\" thick round disc. Place in a very airtight container. (Note 5 for smaller cookies)",
            "Fridge 12 hours – Refrigerate for 12 hours, up to 48 hours (Note 6 for different chill times).",
            "Preheat oven to 180°C/350°F (170°C fan-forced). (Note 7), Place 4 fridge-cold cookies 7.5 cm/3\" apart on a tray lined with baking paper/parchment paper. (Note 8 baking tips), Bake for 17 minutes or until the edges are golden and the surface is just set (ie not melty raw dough) but still pale., Decorate and cool – Working quickly, press extra choc chips on the surface (Note 9), then cool on the tray for 20 minutes – finishes baking, edges crisp more and they get more golden all over.Tip: While hot, you can also reshape with a rubber spatula or similar into a tidy round shape., Grab now – peak eating moment! Or, transfer to a rack to cool fully before storing in an airtight container."
        ]
    },
    {
        "NUMBER": 24,
        "TITLE": "",
        "LINK": "https://www.recipetineats.com/i-need-to-stop-and-get-an-assistant/",
        "AUTHOR": "",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": 25,
        "TITLE": "Devilled eggs",
        "LINK": "https://www.recipetineats.com/devilled-eggs/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "12 large eggs",
            "2 Dijon mustard, 2 Tabasco or other hot sauce, 1 white wine vinegar, 2 mayonnaise, 1/4 cooking salt / kosher sale, 50 g/ 3 tbsp cold unsalted butter",
            "Paprika, 1 chives"
        ],
        "INSTRUCTIONS": [
            "Hard boil eggs, halve, blitz yolks with Filling ingredients except butter, then blitz in butter. Pipe (18 – 20 pieces), garnish, serve!",
            "Large pot – Bring a large pot with 15cm / 6 water to the boil. Lower eggs in gently using a spider or slotted spoon. Lower heat a tiny bit if needed to stop the eggs from jostling around so much they crack., Boil and swirl –  Boil eggs for 10 minutes. Swirl the water every minute for the first 6 minutes, using the handle of a wooden spoon. Give the water 4 or 5 fast stirs in one direction to make the water and eggs swirl in the water. The centrifugal force will make the yolks cook centred in the egg white (ie no thin broken egg white walls) (Note 4)., Peel – Fill a sink with cold tap water. Remove eggs from the boiling water using a slotted spoon or spider. Leave for 5 minutes until cool enough to handle. Tap the base then peel under water (it's easier).",
            "Remove yolks – Cut eggs in half and remove the yolks using a teaspoon., Filling – Place the yolks and all filling ingredients EXCEPT butter in a small food processor (Note 5). Blitz until yolks are broken up. Add butter and blitz, scraping down the sides as needed, until the butter is blended through. The filling should be creamy (smear with back of spoon to check)., Choose the best 18 to 20 egg white halves. (Note 6) Brush yolk crumbs off the cut surface., Pipe – Transfer filling into a piping bag fitted with a nozzle of your choice (I use a star). Fill so it's mounded – I do about the same amount as a whole yolk., Sprinkle with paprika and chives. Serve! (Best enjoyed at room temperature rather than fridge cold as the filling is creamier.)"
        ]
    },
    {
        "NUMBER": 26,
        "TITLE": "Thai red duck curry",
        "LINK": "https://www.recipetineats.com/thai-red-duck-curry/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "500g/ 1 lb duck breasts, 1/4 cooking salt / kosher salt, 1/4 white pepper",
            "115g/ 4 oz (1/2 cup) Thai red curry paste, 2 large garlic cloves, 2 fresh ginger, 1 chicken stock/broth, 400ml/ 14 oz coconut milk, 6 – 8 makrut lime leaves, 2 white sugar, 2 fish sauce, 120g/ 4oz green beans, 1 Thai basil leaves",
            "8 – 12 lychees, 1 1/4 pineapple pieces",
            "Jasmine rice, Thai basil leaves, Coriander/cilantro leaves/small sprigs, Large red chilli, Lime wedges"
        ],
        "INSTRUCTIONS": [
            "Slash duck skin, season. Cold pan, no oil, 10 min medium low (weigh down duck) until golden. Reserve 3 tbsp fat. Finish in oven 8 min (target 60°C/140°F, medium), rest. Sauté curry paste in duck fat with garlic and ginger, add stock, reduce by half, add coconut, fish sauce, sugar, lime leaves, simmer 2 min. Add beans, simmer 3 min, add lychees or pineapple, simmer 2 min. Slice duck, serve!",
            "Preheat the oven to 180°C/350°F (160°C fan-forced)., Score – Sprinkle half the salt and pepper on the flesh of the duck. Turn. Use a sharp knife to make 5 or 6 diagonal scores on the skin of the breast. Don't pierce the flesh and don't cut all the way to the edge of the skin (Note 8). Pat the skin dry with paper towels, sprinkle with remaining salt and pepper., Cold pan, no oil – Don't turn the stove on yet. Use an oven-proof pan (any type). Place the duck skin side down in the cold pan, no oil required. Place another pan on top to lightly weigh the duck down (keeps skin flat)., Cook 10 minutes – Turn the stove onto medium low. Cook for 10 minutes or until the skin is golden and crispy. Fat will melt out of the duck skin and it will cook in its own fat. (Note 8), Reserve duck fat – Pour off 2 to 3 tablespoons of the duck fat into the pan you will use to make the curry sauce., Oven 8 minutes – Once the skin is crispy, turn and cook the flesh side for 1 minute. Then transfer the pan to the oven for 8 minutes or until the internal temperature is 60°C/140°F (medium, Note 9), Rest – Transfer to a rack or plate and rest for 5 minutes until ready to assemble the curry.",
            "Sauté curry paste – Heat the duck fat (from step 6 above) on medium heat in a deep skillet. Cook the curry paste, garlic and ginger for 4 to 5 minutes. It will dry out and darken in colour, and substantially improves the flavour (especially store bought, but even homemade)., Sauce – Add chicken stock, stir, then simmer rapidly to reduce by half (2 -3 minutes). Stir in coconut milk, hand-crushed kaffir lime leaves, sugar and fish sauce. Simmer gently on medium for 2 minutes., Add ins – Add the beans, simmer for 3 minutes until just cooked. Add the lychees or pineapple, simmer 1 minute. Taste and add a tad extra fish sauce if it needs salt.",
            "Spoon some sauce in to cover the base of a large deep platter or wide bowl., Slice duck breast, just shy of 5mm / 0.2\" thick. Place on the sauce, fanning it out slightly to expose the pink flesh., Remaining sauce – Spoon the remaining sauce, lychees etc around the duck, avoiding the duck skin., Garnish with Thai basil leaves, coriander, chilli and lime wedges., Serve – Take to the table with flourish and serve with jasmine rice!"
        ]
    },
    {
        "NUMBER": 27,
        "TITLE": "How to cook crispy skin duck breast",
        "LINK": "https://www.recipetineats.com/how-to-cook-duck-breast/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "2 minutes",
        "INGREDIENTS": [
            "1 duck breast, 1/8 cooking salt / kosher salt, Pinch white pepper"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 180°C/350°F (160°C fan-forced)., Score – Sprinkle half the salt and pepper on the flesh of the duck. Turn. Use a sharp knife to make 5 or 6 diagonal scores on the skin of the breast. Don't pierce the flesh and don't cut all the way to the edge of the skin (Note 2). Pat the skin dry with paper towels, sprinkle with remaining salt and pepper., Cold pan, no oil – Don't turn the stove on yet. Use an oven-proof pan (any type). Place the duck skin side down in the cold pan, no oil required. Place another pan on top to lightly weigh the duck down (keeps skin flat). (Note 3), Cook 10 minutes – Turn the stove onto medium low. Cook for 10 minutes or until the skin is golden and crispy. Fat will melt out of the duck skin and it will cook in its own fat. (Note 4), Oven 8 minutes – Once the skin is crispy, turn and cook the flesh side for 1 minute. Then transfer the pan to the oven for 6 minutes for medium rare (internal temperature 54°C/130°F, restaurant default) or 8 minutes for medium (60°C/140°F, my preferred)., Rest – Transfer to a rack or plate and rest for 5 minutes before serving. Serve whole or slice!"
        ]
    },
    {
        "NUMBER": 28,
        "TITLE": "Crunchy chicken taco fingers (baked!)",
        "LINK": "https://www.recipetineats.com/crunchy-chicken-taco-fingers-baked/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "ERROR",
        "INGREDIENTS": [
            "500g/ 1 lb chicken tenderloins, 2 1/4 panko breadcrumbs, Olive oil spray",
            "2 cumin powder, 2 paprika, 1 garlic powder, 1 onion powder, 1 dried oregano, 1/4 cayenne pepper, 1 cooking salt / kosher salt",
            "2 large eggs, 3 flour, 2 mayonnaise, salt",
            "12 – 16 taco-size soft tortillas, 1 Taco Slaw, 1 large avocado, Sriracha, 2 roughly chopped coriander/cilantro leaves"
        ],
        "INSTRUCTIONS": [
            "Toss panko with seasoning, oil spray, bake 7 min at 200°C/400°F (180°C fan). Coat fingers in dredge then crumb, spray generously, bake 12 minutes on rack. Use for tacos – or munch dipped in Avocado Sauce!",
            "Preheat the oven to 200°C/400°F (180°C fan-forced)., Mix and spray – Mix the panko and Taco Seasoning in a bowl. Pour onto a tray, spray with oil, spread out, then spray again (from height, directly down, so the panko doesn't blow off)., Bake for 7 minutes, mixing once, until golden brown. Scrape into a 20cm/8\" pan (or similar, ease for crumbing multiple pieces).",
            "Rack – Put a rack on the used tray and spray the rack with oil (Note 6)., Dredge batter – Whisk the Dredge ingredients in a bowl until lump free (it will seem too thick at first, trust, it will thin to maple syrup constancy). Add all the chicken, toss to coat., Crumb – Pick up a piece of chicken with one hand, let the excess batter drip off. Lay it down in the crumbs. Repeat with 2 – 3 more pieces. With your clean hand, cover with breadcrumbs, press to adhere, lay on rack. Repeat with remaining chicken., Warm tortillas – Separate tortillas into 2 stacks, wrap with foil., Bake – Spray generously with oil. Put in the oven with the wrapped tortillas. Bake for 12 minutes  – thin strips cook fast! (Note 7)., Serve – Serve, stuffed in tortillas with fixings of choice. My assembly order: take a warm tortilla, pile in a generous amount of Taco Slaw. Top with 2 avocado slices, crunchy chicken finger, drizzle with sriracha, sprinkle with coriander. BITE!"
        ]
    },
    {
        "NUMBER": 29,
        "TITLE": "Taco Slaw",
        "LINK": "https://www.recipetineats.com/taco-slaw-excellent-for-tacos/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "6 green cabbage, 1 green onion, 1/2 finely chopped coriander/cilantro leaves",
            "1/2 sour cream, 2 mayonnaise, 2 lime zest, 1 lime juice, 1/2 cooking salt / kosher salt"
        ],
        "INSTRUCTIONS": [
            "Mix the dressing ingredients in a large bowl., Toss – Add the Slaw ingredients then toss well with hands or tongs., Set aside for at least 1 hour until the cabbage becomes wilted and floppy. Toss again then use in tacos!"
        ]
    },
    {
        "NUMBER": 30,
        "TITLE": "Prawn cocktail mini tacos (shrimp)",
        "LINK": "https://www.recipetineats.com/prawn-cocktail-mini-tacos/",
        "AUTHOR": "Nagi | RecipeTin Eats",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "6 corn tortillas, 1/4 cooking salt / kosher salt, Olive oil spray",
            "220g/7 oz cooked prawns/shrimp, peeled",
            "4 mayonnaise, 1 ketchup, 1 Worcestershire sauce, 1/2 horseradish cream, 2 tabasco, 1/8 cayenne pepper, 1/8 garlic powder, 1 cornichons",
            "1 chives, Fancy options – salmon roe, caviar, Dried black beans or rock salt"
        ],
        "INSTRUCTIONS": [
            "Cut 17 x 6cm/2.4\" rounds, microwave to soften, oil and salt, press into upside muffin tin. Bake 12 minutes, cool in tin. Fill!",
            "Preheat the oven to 180°C/350°F (160°C fan-forced). Get a standard 12 hole muffin tin., Cut circles from the tortillas using a 6cm / 2.4\" cutter. (Note 6 on using offcuts), Warm – Spread half on a dinner plate and microwave for 30 seconds on high (makes them pliable). Spray the warm tortillas lightly with oil, sprinkle with half the salt., Wedge – Turn the muffin tin upside down. Wedge the tortillas salt side down between the muffin tin holes – they fold into taco shapes! Repeat with remaining rounds., Spray the surface of the tortillas lightly with oil (no salt)., Bake for 12 minutes, or until quite golden and crispy. Cool in the muffin tin so they set. (Stays crisp 2 days!)",
            "Dice the prawns into small 5mm / 0.2\" cubes (for large, cut in half horizontally, lengthwise then chop – see video)., Mix the Marie Rose sauce in a bowl. Then stir the prawns through, just before assembling.",
            "Fill taco shells with prawn cocktail filling, sprinkle with chives. To keep them upright, place on a bed of rock salt or dried beans for serving., Pass around, bask in praise, be coy when people ask how you made those marvellous mini taco shells!"
        ]
    },
    {
        "NUMBER": 31,
        "TITLE": "8 minute Lebanese Pizzas (Lahmacun!)",
        "LINK": "https://www.recipetineats.com/8-minute-lebanese-pizza-chicken-mince-recipe/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "1 Lebanese bread",
            "125g / 4 oz chicken mince, 2 tomato paste, 1 Baharat spice mix (aka Lebanese 7 spice), 1/2 paprika, 1 garlic clove, 1/4 cooking salt / kosher salt, 1 finely chopped parsley, 1 1/2 extra virgin olive oil",
            "Extra virgin olive oil, 2 Danish feta or goats cheese",
            "Lemon juice, Dried chilli flakes / red pepper flakes, ~1 toasted pine nuts, 1 finely chopped parsley"
        ],
        "INSTRUCTIONS": [
            "Trim bread to fit pan, mix filling, smear on bread. Heat oil on high, pan fry 90 seconds meat side down, then bread side 90 seconds until crispy. Top, cut, eat!",
            "Use a large 30cm/12\" non-stick pan. If needed, use scissors to cut one side of the Lebanese bread so it fits in your pan (Note 4), Mix the Chicken Spread ingredients in a bowl. Spread all across the surface of one side of the bread like peanut butter – use it all! It will be a fairly thin layer., Cook meat side – Heat 1 tablespoon of oil in the pan over high heat. Place the bread in meat side down and cook for 90 seconds, pressing down lightly to encourage colour. The meat will stick to the bread!, Crisp bread – Turn with tongs (there should be some golden patches) and cook the bread side for 90 seconds until golden and crispy (lower heat if browning too quickly)., Toppings – Slide onto cutting board, sprinkle with feta, drizzle with extra virgin olive oil. Sprinkle with other toppings you choose. Cut into 8 like pizza, enjoy!"
        ]
    },
    {
        "NUMBER": 32,
        "TITLE": "Coconut mango bars with lime glaze",
        "LINK": "https://www.recipetineats.com/mango-bars-with-lime-glaze/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "125g/ 1 stick unsalted butter, 1/2 caster/superfine white sugar, 1 large egg, 1 1/2 flour, 1 oats, 3/4 desiccated or finely shredded coconut, 1/2 baking powder, 1/4 cooking salt / kosher salt",
            "2 1/2 cups (400 g) mango slices, 1 1/2 cornflour / cornstarch, 2 white sugar",
            "3/4 soft icing sugar / powdered sugar, 1 lime zest, 3 lime juice, 1/4 vanilla extract"
        ],
        "INSTRUCTIONS": [
            "Melt butter, mix in sugar, then egg, then everything else. Press 1 3/4 cups into 20cm/8″ lined pan. Toss mango filling ingredients, spread on base, crumble over remaining mixture. Bake 30 min. Cool, drizzle with glaze.",
            "Preheat oven to 180°C/350°F (160°C fan-forced). Grease then line a 20cm/8\" panwith baking paper (parchment), ensuring you have overhang so you can lift it out at the end.",
            "Melt butter – Cut the butter into ~1.25cm/1/2\" chunks and melt in a microwave-proof bowl, or use a saucepan and stove. (Note 6), Mix – Add the sugar to the butter and mix with a wooden spoon. Add egg and mix until smooth. Add remaining ingredients and mix until you no longer see flour.",
            "Base – Measure out 1 3/4 cups (packed) of the mixture (the rest gets used for the topping). Spread into the pan and use your hands to evenly press it into the base., Mango filling (do this just before use) – Put the mango in a bowl. Sprinkle over the sugar and cornflour. Use your hands to gently toss until evenly coated., Assemble – Spread the mango evenly across the base. Crumble the remaining mixture across the surface, leaving spots of mango exposed., Bake for 30 minutes until the surface is light golden., Cool – Remove from the oven and fully cool in the pan (~ 2 hours) before lifting out using the excess paper onto a cutting board. (Speed things up: 30 min counter, 30 minute fridge)., Lime glaze – Mix the ingredients in a medium bowl, using extra lime juice 1/4 tsp at a time if needed until it's a honey consistency. Drizzle randomly across the surface. Leave for 10 minutes to let the glaze surface crust., Serve – Cut into 12 squares (sensible) or 9 (greedy). Devour!"
        ]
    },
    {
        "NUMBER": 33,
        "TITLE": "Creamy Goat Cheese & Roasted Red Pepper Risoni (Orzo)",
        "LINK": "https://www.recipetineats.com/creamy-goat-cheese-roasted-red-pepper-risoni-orzo/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "7 minutes",
        "INGREDIENTS": [
            "250g/ 8oz risoni pasta (orzo), 2 cooking salt/kosher salt, 2 extra virgin olive oil, 1 red onion, 2 garlic cloves, 310g/ 10oz chargrilled / fire-roasted sliced red capsicum/peppers, 2 tomato passata or puree, 1/2 sliced Kalamata olives, 1/4 cooking salt / kosher salt, 1/4 black pepper, 120g/4 oz goat's cheese",
            "1 basil leaves, 1 roughly chopped parsley"
        ],
        "INSTRUCTIONS": [
            "Boil risoni – Bring a small pot or large saucepan of water to the boil. Add salt and cook risoni until just under al dente (ie still a bit firm inside) as it will cook more in the sauce. 8 minutes for me., Drain & rinse – Just before draining, scoop out 1/2 cup pasta cooking water and set aside. Drain, rinse briefly under the tap then leave the risoni in the colander while you finish the sauce., Sauté – Heat the oil in a large non stick skillet (30cm/12\") over high heat. Add onion and cook for 2 minutes until starting to soften. Add garlic and capsicum strips. Cook for 2 minutes until the onion is softened., Simmer – Add tomato and olives. Bring to a simmer, lower heat to medium and simmer for 5 minutes, stirring every now and then., Melt goat cheese – Add cooked risoni, salt, pepper and the pasta cooking water. Stir to combine. Add most of the goat's cheese (reserve some for garnish), stir so it melts., Basil & serve – Stir through basil or parsley just before serving. Divide between bowls. Crumble over reserved goat's cheese, sprinkle with extra basil. Dig in with a spoon!"
        ]
    },
    {
        "NUMBER": 34,
        "TITLE": "Popcorn chicken – better than KFC!",
        "LINK": "https://www.recipetineats.com/popcorn-chicken/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "500g / 1lb chicken breast",
            "3/4 buttermilk, 1 1/2 cooking salt / kosher salt, 1 large egg",
            "1 1/2 flour, 1/2 corn flour / cornstarch",
            "1 cooking salt / kosher salt, 1/2 celery salt, 1 black pepper, 1 regular paprika, 1 dried thyme, 1 dried oregano, 3/4 onion powder, 2 garlic powder, 1/2 mustard powder, 1/2 ginger powder, 1/4 cayenne pepper",
            "2 1/2 – 3 1/2 canola oil (2.5 cm / 1\" depth)",
            "1/2 Honey mustard dipping sauce, Ketchup, tomato sauce,"
        ],
        "INSTRUCTIONS": [
            "Marinade chicken 1 hour+ in Buttermilk Marinade. Dribble then rub 3 tbsp marinade in breading to make small clumps. Dredge chicken, fry 2 minutes at 180C/350F.",
            "Cut chicken into small 1.25 cm / 1/2\" cubes., Marinade – Whisk marinade in a bowl. Add chicken, stir to coat, then refrigerate for 1 hour (no longer than 24 hours).",
            "Breading mixture – Mix together Breading and all KFC Secret Herbs & Spices in a large bowl (larger surface area = coat more chicken in one go)., Clump = crunchy! Drizzle 3 tablespoons of the Marinade into the flour mixture. Use your fingers to rub in so you get lots of small lumpy bits all throughout (this fries up into extra crunchy bits, secret trick!).",
            "Frying vessel (Note 5) – Large saucepan / small pot ~20cm/8\" recommended for beginners. Large pot / deep skillet ~24cm/9.5\" or larger recommended only for capable cooks. Use heavy based (not light and flimsy), for safety and heat retention., Preheat oven to 50°C/125°F, to keep cooked chicken warm.",
            "Bread chicken – Pick up a handful of chicken from the marinade with your left hand, then scatter across surface of the flour mixture. Spoon flour over chicken then toss with the spoon to coat., Shake off excess (use right hand) – Separate the chicken pieces and press the clumpy flour onto the chicken pieces. Pick up a handful, shake excess flour off through fingers (no need to be thorough). Spread chicken on tray. Repeat with remaining chicken. Voila! No clumpy flour-batter-caked fingers!, Separate and last minute coat (Note 6) – Just before frying, use your fingers to briefly re-toss the chicken you're about to cook in the residual flour on the tray (to freshen up the flour coating, as it sits around it sweats/gets wet), and make sure the chicken pieces are not stuck together.",
            "Line a tray with paper towels (for draining cooked chicken). Preheat oven to 50°C/125°F to keep cooked chicken warm., Heat oil – Add oil to your pot to a depth of 2.5 cm / 1\". Heat it over medium high to  180°C/350°F (Note 7)., Fry 2 minutes – Pick up some chicken and put it in a spider with large holes (Note 8) and shake so excess flour falls through (or use hands to shake off excess flour then then transfer into a scoop to lower into oil). Carefully lower chicken into the oil. Fry for 2 – 2.5 minutes until golden, separating any that get stuck together around halfway through., Drain – Scoop out with a spider and spread on a paper towel lined tray Keep cooked chicken warm in the oven and cook remaining chicken., Serve chicken – in popcorn boxes, for extra fun factor! – with dipping sauce of choice (pictured, Honey Mustard)."
        ]
    },
    {
        "NUMBER": 35,
        "TITLE": "Honey Mustard Dipping Sauce",
        "LINK": "https://www.recipetineats.com/honey-mustard-dipping-sauce/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "3 minutes",
        "INGREDIENTS": [
            "1/2 mayonnaise, 2 dijon mustard, 2 honey, 1 – 2 apple cider vinegar or lemon juice, of salt and white pepper"
        ],
        "INSTRUCTIONS": [
            "Mix the ingredients together, starting with 1 teaspoon of vinegar or lemon juice, then adding the other if you want it a bit tangier. Ready to use!"
        ]
    },
    {
        "NUMBER": 36,
        "TITLE": "Bruschetta summer pasta salad",
        "LINK": "https://www.recipetineats.com/bruschetta-summer-pasta-salad/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "500g/1 lb penne, 2 cooking salt / kosher salt",
            "1 kg / 2 lb tomatoes, 1/2 cooking salt / kosher salt, 3/4 tightly packed basil leaves, 1/2 finely shredded parmesan",
            "1/2 extra virgin olive oil, 1/4 balsamic vinegar, 2 garlic cloves, 3/4 cooking salt / kosher salt, 1/4 black pepper",
            "1/4 pinenuts, Balsamic glaze"
        ],
        "INSTRUCTIONS": [
            "Cook pasta in salted water until extra soft, toss with 2/3 Dressing, cool. Toss tomato with remaining Dressing, leave 10 min. Pour off juices into pasta, toss. Add 1/2 tsp salt into tomato, toss. Add into pasta with basil, parmesan. Finish with balsamic glaze and pine nuts. Enjoy!",
            "Dressing – Shake the ingredients in a jar (or whisk in a jug)., Soft cooked pasta – Bring a large pot of water to the boil with the 2 teaspoons of salt. Cook the pasta per the packet time plus 2 minutes, until the pasta is overcooked and soft. (Note 5) Drain in a colander, then return the pasta into the same pot., Flavour the pasta – Give the dressing a good shake then pour 2/3 of it over the pasta. Stir (enjoy the smell!). Set aside to cool for 15 minutes and let the pasta absorb the dressing flavour., Bruschetta – Put chopped tomato and all watery juices into a bowl. Pour over remaining Dressing, gently toss. Set aside for 10 minutes or until the pasta is cool to let the flavours meld., Finishing (the order matters!) – Pour the juices accumulated in the tomato bowl into the pasta then toss to disperse. Add the salt into the tomato, gently toss, then add the tomato into the pasta. Add the basil, parmesan, gently toss., Serve – Pour into a big bowl and serve! If using extra finishes, drizzle with a swish of balsamic glaze (not too much, it's strong!) and sprinkle with pine nuts. Eat!"
        ]
    },
    {
        "NUMBER": 37,
        "TITLE": "",
        "LINK": "https://www.recipetineats.com/how-to-store-basil/",
        "AUTHOR": "",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": 38,
        "TITLE": "",
        "LINK": "https://www.recipetineats.com/ultimate-christmas-menu-planning-guide/",
        "AUTHOR": "",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": 39,
        "TITLE": "Easy Christmas Cheesecake Slab – no bake!",
        "LINK": "https://www.recipetineats.com/christmas-cheesecake/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "300g/10 oz Biscoff, 120g (8 tbsp) unsalted butter, 1/2 cinnamon powder, 1 brown sugar, salt",
            "3 1/2 tsp (13.5 g) gelatin powder, 3 cold tap water, 1 1/2 thickened or heavy cream, 750g/ 24 oz cream cheese block (3 blocks,, 1 1/4 caster sugar / superfine sugar, 1 1/2 vanilla extract, 1 lemon juice",
            "2 thickened or heavy cream, 3 caster sugar / superfine sugar, 1 1/2 vanilla extract",
            "Strawberries, Berries, Cherries, Rosemary sprigs, 6 orange slices, Icing sugar / confectionary sugar"
        ],
        "INSTRUCTIONS": [
            "Blitz crumb. Press into 33 x 23 cm / 9 x 13\" lined pan with paper overhang (important). Bloom gelatine in the water, re-melt. Whip cream. In separate bowl whip cream cheese + sugar, then vanilla, lemon, salt and gelatine. Fold in 1/4 cream, then remaining cream. Fill pan, fridge 12 hours, decorate!",
            "Line – Grease a 23 x 33 cm / 9 x 13\" can VERY lightly with butter or spray with a plain oil (I use canola). Line with parchment/baking paper with lots of overhang on the long side to lift the cheesecake out once set (see photos).",
            "Blitz – Break up biscuits roughly by hand and place in a food processor. Blitz until it becomes fine crumbs (~30 seconds)., Add butter – Add the butter, cinnamon and salt. Blitz until it resembles wet sand (~ 10 second). It should stay together when pinched between your fingers., Press – Pour into the prepared pan. Spread then use your hand or something flat to press it in firmly (firmer = more stable base). Refrigerate until required.",
            "Bloom gelatine – Put the water in a small bowl and sprinkle the gelatine across the surface (don't dump it in one place. Whisk until dissolved then set aside for 3 minute or until it firms up like rubber., Melt – Microwave for 15 seconds on high or until it melts (do not let it boil). Cool for 5 minutes while you make the filling (make sure it's still liquid when you use it, if there's a skin on surface or walls, warm for 5 seconds to liquify).",
            "Whip cream – Put the cream in a bowl and whip it with an electric beater on high for 2 1/2 to 3 minutes until firm peaks form (ie not softly whipped, we want good aeration!)., Whip cream cheese – Put the cream cheese and sugar in a separate large bowl. Using the same beater (no need to clean), beat on high for 1 1/2 minutes just until it's soft and smooth. Add the vanilla, lemon and melted gelatine, then beat for 10 seconds on high to mix it through thoroughly. Don't beat excessively as we don't want too many air bubbles in the cheesecake (unsightly)., Fold – Add about 1/4 of the whipped cream into the cream cheese mixture. Gently fold through using a rubber spatula or large spoon (don't mix aggressively, you'll knock all the air out of the cream!). Then fold in the rest of the cream., Refrigerate – Pour into the pan and smooth the surface. Refrigerate for 12 hours+ to set.",
            "Remove – Use the paper overhang to lift the cheesecake out of the pan and transfer it onto a serving platter. Then slide the paper out from underneath. Refrigerate until ready to decorate., Whip cream – Put the ingredients in a bowl and whip on high for 2 to 3 minutes until softly whipped. (Use an electric beater or stand mixer fitted with a whisk. Also, see Note 6 for stabilising to assemble ahead)., Decorate – Spread the cream in big swirls across the surface of the cake. Pile on the berries and cherries, tuck in the orange slices and rosemary. Dust with icing sugar then cut into slices and serve!"
        ]
    },
    {
        "NUMBER": 40,
        "TITLE": "Thai Sweet Chilli Beef Bowls",
        "LINK": "https://www.recipetineats.com/thai-sweet-chilli-beef-bowls/",
        "AUTHOR": "Nagi",
        "PREP_TIME": "13 minutes",
        "INGREDIENTS": [
            "1/3 roasted cashews, 1 canola oil, 500 g / 1 lb beef mince, 1 small onion, 2 garlic cloves, 3 roughly chopped coriander/cilantro leaves",
            "2 sweet chilli sauce, 2 fish sauce, 2 rice vinegar, 1 oyster sauce, 1 dark soy sauce",
            "1 garlic clove, 3 sweet chilli sauce, 2 lime juice, 2 fish sauce",
            "2 jasmine rice, Steamed or fresh veg"
        ],
        "INSTRUCTIONS": [
            "Mix each sauce. Toast cashews, sauté onion + garlic 1 min, then cook beef. Add sauce, cook until reduced/caramelised, serve over rice with veg on side. Spoon over drizzle sauce, top with cashews and coriander.",
            "Drizzle sauce – Mix the ingredients in a bowl, set aside., Stir fry sauce – Mix the ingredients in a separate bowl, set aside., Toast cashews – Heat a large non-stick pan over medium high heat. Add the cashews and toast for 2 minutes. Transfer to a cutting board then roughly chop once cool., Cook beef – Heat the oil in the same pan over high heat. Add the garlic and onion, cook for 1 minute. Add the beef and cook, breaking it up as you go, until you no longer see raw meat., Sauce it! Add the cooking sauce and cook well, stirring, until it mostly reduces down so the sauce caramelises on the beef, about 3 – 4 minutes. (Don't shortcut this step, it's where the flavour is!), Serve the beef over rice with a side of veg. Douse everything with the sauce, top with cashews and coriander (fresh chilli wouldn't go astray either). To eat, jumble everything up then dig in!"
        ]
    }
]