[
    {
        "TITLE": "Bourbon Chicken",
        "AUTHOR": "LinMarie",
        "PREP_TIME": "35mins",
        "INGREDIENTS": [
            "2 lbs    boneless chicken breasts, cut into bite-size pieces",
            "1 -2 tablespoon    olive oil",
            "1 garlic clove, crushed",
            "1⁄4 teaspoon    ginger",
            "3⁄4 teaspoon    crushed red pepper flakes",
            "1⁄4 cup    apple juice",
            "1⁄3 cup    light brown sugar",
            "2 tablespoons    ketchup",
            "1 tablespoon    cider vinegar",
            "1⁄2 cup    water",
            "1⁄3 cup    soy sauce"
        ],
        "INSTRUCTIONS": [
            "Editor's Note:  Named Bourbon Chicken because it was supposedly created by a Chinese cook who worked in a restaurant on Bourbon Street.\nHeat oil in a large skillet.\nAdd chicken pieces and cook until lightly browned.\nRemove chicken.\nAdd remaining ingredients, heating over medium Heat until well mixed and dissolved.\nAdd chicken and bring to a hard boil.\nReduce heat and simmer for 20 minutes.\nServe over hot rice and ENJOY.\n"
        ]
    },
    {
        "TITLE": "Best Banana Bread",
        "AUTHOR": "lkadlec",
        "PREP_TIME": "1hr 10mins",
        "INGREDIENTS": [
            "1⁄2 cup    butter, softened",
            "1 cup    granulated sugar",
            "2 eggs, beaten",
            "3 bananas, finely crushed  (for serious and extreme moist and delicious, try 4 bananas)",
            "1 1⁄2 cups    all-purpose flour",
            "1 teaspoon    baking soda",
            "1⁄2 teaspoon    salt",
            "1⁄2 teaspoon    vanilla (optional)"
        ],
        "INSTRUCTIONS": [
            "Remove odd pots and pans from oven.\nPreheat oven to 350º / 180º.\nCream together butter and sugar.\nAdd eggs and crushed bananas.\nCombine well.\nSift together flour, soda and salt.\n Add to creamed mixture.\n Add vanilla.\nMix just until combined.\n Do not overmix.\nPour into greased and floured loaf pan.\nBake at 350º / 180º for 55 minutes.\nKeeps well, refrigerated.\n"
        ]
    },
    {
        "TITLE": "To Die for Crock Pot Roast",
        "AUTHOR": "yooper",
        "PREP_TIME": "9hrs 5mins",
        "INGREDIENTS": [
            "1 (4 -5   lb)    beef roast, any kind",
            "1 (1 1/4  ounce) package   brown gravy mix, dry",
            "1 (1 1/4  ounce) package   dried Italian salad dressing mix",
            "1 (1 1/4  ounce) package   ranch dressing mix, dry",
            "1⁄2 cup    water"
        ],
        "INSTRUCTIONS": [
            "Place beef roast in crock pot.\nMix the dried mixes together in a bowl and sprinkle over the roast.\nPour the water around the roast.\nCook on low for 7-9 hours.\n\nOptional tweaks:\n1.\n Use onion soup mix instead of ranch.\n2.\n Add one cup of red wine along with the water.\n3.\n Add potatoes, carrots, mushrooms, celery and onion 2-3 hours before end.\n"
        ]
    },
    {
        "TITLE": "Crock-Pot Chicken With Black Beans & Cream Cheese",
        "AUTHOR": "Jen Santiago",
        "PREP_TIME": "4hrs 3mins",
        "INGREDIENTS": [
            "4 -5 boneless chicken breasts, frozen",
            "1 (15 1/2  ounce) can   black beans",
            "1 (15   ounce) can   corn",
            "1 (15   ounce) jar   salsa, any kind",
            "1 (8   ounce) package   cream cheese"
        ],
        "INSTRUCTIONS": [
            "Take 4-5 frozen, yes, frozen, boneless chicken breasts put into crock pot.\nAdd 1 can of black beans, drained, 1 jar of salsa, 1 can of corn drained.\nKeep in crock pot on high for about 4-5 hours or until chicken is cooked.\nAdd 1 package of cream cheese (just throw it on top!) and let sit for about 1/2 hour.\nAll done and enjoy!"
        ]
    },
    {
        "TITLE": "Creamy Cajun Chicken Pasta",
        "AUTHOR": "Lorac",
        "PREP_TIME": "25mins",
        "INGREDIENTS": [
            "2 boneless skinless chicken breast halves, cut into thin strips",
            "4 ounces    linguine, cooked al dente",
            "2 teaspoons    cajun seasoning (your recipe, Cajun Seasoning Mix or store-bought)",
            "2 tablespoons    butter",
            "1 thinly sliced green onion",
            "1⁄2 cup    heavy whipping cream",
            "2 tablespoons   chopped sun-dried tomatoes",
            "1⁄4 teaspoon    salt",
            "1⁄4 teaspoon    dried basil",
            "1⁄8 teaspoon    ground black pepper",
            "1⁄8 teaspoon    garlic powder",
            "1⁄4 cup   grated parmesan cheese"
        ],
        "INSTRUCTIONS": [
            "Place chicken and Cajun seasoning in a bowl and toss to coat.\nIn a large skillet over medium heat, sauté chicken in butter or margarine until chicken is tender, about 5 to 7 minutes.\nReduce heat add green onion, heavy cream, tomatoes, basil, salt, garlic powder, black pepper and heat through.\nPour over hot linguine and toss with Parmesan cheese.\n"
        ]
    },
    {
        "TITLE": "Oatmeal Raisin Cookies",
        "AUTHOR": "Bev I Am",
        "PREP_TIME": "26mins",
        "INGREDIENTS": [
            "2 cups    all-purpose flour",
            "1 teaspoon    baking soda",
            "1 teaspoon    baking powder",
            "1 teaspoon    kosher salt",
            "1 cup    unsalted butter, softened",
            "1 cup    sugar",
            "1 cup    dark brown sugar, firmly packed",
            "2 large    eggs",
            "2 teaspoons    vanilla",
            "3 cups    oats (not instant)",
            "1 1⁄2 cups    raisins"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 350°.\nWhisk dry ingredients; set aside.\nCombine wet ingredients with a hand mixer on low.\nTo cream, increase speed to high and beat until fluffy and the color lightens.\nStir the flour mixture into the creamed mixture until no flour is visible.\n(Over mixing develops the gluten, making a tough cookie.\n) Now add the oats and raisins; stir to incorporate.\nFill a #40 cookie scoop and press against side of bowl, pulling up to level dough (to measure 2 tablespoons of dough).\nDrop 2-inches apart onto baking sheet sprayed with nonstick spray.\nBake 11-13 minutes (on center rack), until golden, but still moist beneath cracks on top.\nRemove from oven; let cookies sit on baking sheet for 2 minutes before transferring to a wire rack to cool.\n"
        ]
    },
    {
        "TITLE": "Best Ever Banana Cake With Cream Cheese Frosting",
        "AUTHOR": "Rhonda J",
        "PREP_TIME": "1hr 15mins",
        "INGREDIENTS": [
            "1 1⁄2 cups    bananas, mashed, ripe",
            "2 teaspoons    lemon juice",
            "3 cups    flour",
            "1 1⁄2 teaspoons    baking soda",
            "1⁄4 teaspoon    salt",
            "3⁄4 cup    butter, softened",
            "2 1⁄8 cups    sugar",
            "3 large    eggs",
            "2 teaspoons    vanilla",
            "1 1⁄2 cups    buttermilk",
            "1⁄2 cup    butter, softened",
            "1 (8   ounce) package   cream cheese, softened",
            "1 teaspoon    vanilla",
            "3 1⁄2 cups    icing sugar",
            " chopped walnuts"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 275°F (135C).\nGrease and flour a 9 x 13 pan.\nIn a small bowl, mix mashed banana with the lemon juice; set aside.\nIn a medium bowl, mix flour, baking soda and salt; set aside.\nIn a large bowl, cream 3/4 cup butter and  2 1/8 cups sugar until light and fluffy.\nBeat in eggs, one at a time, then stir in 2 tsp vanilla.\nBeat in the flour mixture alternately with the buttermilk.\nStir in banana mixture.\nPour batter into prepared pan and bake in preheated oven for one hour or until toothpick inserted in center comes out clean.\nRemove from oven and place directly into the freezer for 45 minutes.\n  This will make the cake very moist.\nFor the frosting, cream the butter and cream cheese until smooth.\nBeat in 1 teaspoon vanilla.\nAdd icing sugar and beat on low speed until combined, then on high speed until frosting is smooth.\nSpread on cooled cake.\nSprinkle chopped walnuts over top of the frosting, if desired.\n"
        ]
    },
    {
        "TITLE": "Yes, Virginia There is a Great Meatloaf",
        "AUTHOR": "Nita Holleman",
        "PREP_TIME": "1hr 20mins",
        "INGREDIENTS": [
            "1 1⁄2 lbs    ground beef (ground shoulder roast is good)",
            "1 slice    bread (broken or chopped finely)",
            "1 egg",
            "1 small    vidalia onions or 1   small   type sweet onion, finely chopped",
            "1 teaspoon    table salt",
            "1⁄4 teaspoon    black pepper",
            "4 tablespoons    ketchup",
            "1⁄2 - 2⁄3 cup    whole milk or 1/2-2/3  cup    half-and-half",
            "4 tablespoons    apple cider vinegar",
            "2 -4 tablespoons    dark brown sugar, packed firm  (to taste)",
            "1⁄2 cup    ketchup"
        ],
        "INSTRUCTIONS": [
            "Meatloaf: Combine meat loaf ingredients and place into a loaf baking dish.\nSmooth out top.\nSauce: Combine sauce ingredients and pour on top and sides of meatloaf.\nBake at 350°F about 1 hour to 1 hour 15 minutes or until done.\nENJOY!*The addition of 1 or 2 teaspoons of Kitchen Bouquet® makes this recipe very good.\n**Recipe should be\"plump\" from the addition of the milk or Half & Half.\nIt should NOT be runny.\n***A second batch of sauce served hot is good to serve with the meatloaf.\nNita's Note: I note that some of you are using game meat such as deer -- Deer is a very DRY meat.\n It is wise to HAVE some fat added to the deer -- especially to ground deer.\n Maybe 25 % fat, ( I recommend 1 lb of ground venison, and 1/2 lb of deer sausage for fat content), otherwise your results will be poor.\n I don't know about some of the other game meat some are using.\n Please consult an expert.\n The recipe is delicious as it stands! Enjoy! Nita Holleman.\n"
        ]
    },
    {
        "TITLE": "Ice Cubes",
        "AUTHOR": "CHRISSYG",
        "PREP_TIME": "6hrs 2mins",
        "INGREDIENTS": [
            "2 cups    water (approximately)",
            "2 tablespoons    water (additional if needed)"
        ],
        "INSTRUCTIONS": [
            "Empty the ice cubes that are left in the trays (if there are any left) into the bin.\nTake the trays over to the sink and fill them with cold water.\n (Hot water will freeze faster and more clear).\nPlace the water filled ice trays back in the freezer.\nReplace the ice bin if you had to remove it.\nShut the door to the freezer.\nBe sure to leave for around 4-6 hours at least to make sure it is frozen.\nIf you want to experiment, you can freeze things like fruit infused waters or juices.\n"
        ]
    },
    {
        "TITLE": "Pancakes",
        "AUTHOR": "Ellen Brody",
        "PREP_TIME": "10mins",
        "INGREDIENTS": [
            "1 egg",
            "3⁄4 cup    milk",
            "2 tablespoons    butter or 2   tablespoons    margarine, melted",
            "1 cup    flour",
            "1 tablespoon    sugar (or 1/2 teaspoon honey or molasses)",
            "1 teaspoon    baking powder",
            "1⁄2 teaspoon    salt"
        ],
        "INSTRUCTIONS": [
            "Beat egg until fluffy.\nAdd milk and melted margarine.\nAdd dry ingredients and mix well.\nHeat a heavy griddle or fry pan which is greased with a little butter on a paper towel.\nThe pan is hot enough when a drop of water breaks into several smaller balls which 'dance' around the pan.\nPour a small amount of batter (approx 1/4 cup) into pan and tip to spread out or spread with spoon.\nWhen bubbles appear on surface and begin to break, turn over and cook the other side.\n"
        ]
    },
    {
        "TITLE": "Beer Bread",
        "AUTHOR": "Gerald Norman",
        "PREP_TIME": "1hr 3mins",
        "INGREDIENTS": [
            "3 cups    flour (sifted)",
            "3 teaspoons    baking powder (omit if using Self-Rising Flour)",
            "1 teaspoon    salt (omit if using Self-Rising Flour)",
            "1⁄4 cup    sugar",
            "1 (12   ounce) can   beer",
            "1⁄2 cup   melted butter (1/4 cup will do just fine)"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 375 degrees.\nMix dry ingredients and beer.\nPour into a greased loaf pan.\nPour melted butter over mixture.\nBake 1 hour, remove from pan and cool for at least 15 minutes.\nUPDATED NOTES: This recipe makes a very hearty bread with a crunchy, buttery crust.\n If you prefer a softer crust (like a traditional bread) mix the butter into the batter instead of pouring it over the top.\nSifting flour for bread recipes is a must-do.\n Most people just scoop the 1 cup measure in the flour canister and level it off.\n That compacts the flour and will turn your bread into a \"hard biscuit\" as some have described.\n That's because they aren't sifting their flour! If you do not have a sifter, use a spoon to spoon the flour into the 1 cup measure.\n Try it once the \"correct\" way and you will see an amazing difference in the end product.\nI have had many email from you kind folks about using non-alcoholic beverages instead of beer.\n That is fine to do but I highly recommend adding a packet of Dry Active Yeast or 2 teaspoons of Bread (Machine) Yeast so that you get a proper rise.\nThe final result should be a thick, hearty and very tasteful bread, NOT A BRICK! ;).\nThank you all for the incredibly nice comments and those of you who left a bad review - learn to sift sift SIFT! You will be amazed at the results you get.\n"
        ]
    },
    {
        "TITLE": "Kittencal's Italian Melt-In-Your-Mouth Meatballs",
        "AUTHOR": "Kittencalrecipezazz",
        "PREP_TIME": "50mins",
        "INGREDIENTS": [
            "1 1⁄2 lbs    ground beef (a mixture of 1 pound ground beef and 1/2 pound ground pork will work well also)",
            "1 large    egg, slightly beaten",
            "1⁄2 cup   grated parmesan cheese",
            "1⁄3 cup    breadcrumbs (or use enough to hold the meat together (no dry breadcrumbs? just soak 3 slices of bread in the 1/3 )",
            "1 -2 tablespoon   fresh minced garlic (or use 1 teaspoon garlic powder or to taste)",
            "1 -2 teaspoon    salt (or to taste, I use 2 teaspoons seasoned salt)",
            "1 teaspoon    fresh ground black pepper",
            "1⁄3 cup    milk (can use up to 1/2 cup milk)",
            "1⁄2 teaspoon    dried oregano (optional, or to taste)",
            "1⁄4 cup   chopped fresh parsley (or 2 tablespoons dried parsley)"
        ],
        "INSTRUCTIONS": [
            "Mix all ingredients together in a large bowl.\nShape into small meatballs (at this point you can place on a jelly-roll/baking sheet and freeze to use later, or cover with plastic wrap refrigerate up to 24 hours before using).\nDrop the meatballs into simmering pasta sauce, do not stir for at least 20 minutes or you will risk breaking the meatballs.\nContinue cooking in the simmering sauce for another 20 minutes (depending on how fast your sauce is simmering 40 minutes total should fully cook the meatballs).\nAfter the 40 minutes cooking time continue cooking your sauce with the meatballs in for as long as desired.\n**note**  you may also bake the meatballs at 350 degrees F for 25 minutes or until cooked through.\n"
        ]
    },
    {
        "TITLE": "Japanese Mum's Chicken",
        "AUTHOR": "JustJanS",
        "PREP_TIME": "45mins",
        "INGREDIENTS": [
            "8 chicken drumsticks, skin on  (the skin is important for flavour, and is so tasty to eat!)",
            "1 cup    water",
            "1⁄2 cup    balsamic vinegar",
            "1⁄3 cup    soy sauce",
            "2 1⁄2 tablespoons    sugar",
            "1 garlic clove, peeled and bruised",
            "1 small    hot chili pepper, slit open, seeds removed"
        ],
        "INSTRUCTIONS": [
            "Place all the ingredients in a saucepan over a high heat.\nBring to the boil, then reduce to a simmer for about 20 minutes.\nRemove any scum that rises to the surface.\nIncrease the heat, turning the drumsticks frequently in the liquid, and cook until the liquid has reduced to a sticky glaze.\nArrange the chicken on a serving platter, remove the garlic clove and chili from the liquid, and spoon the glaze over.\nNOTE It's a glaze rather than a sauce, so there's not a whole lot of it.\n"
        ]
    },
    {
        "TITLE": "Creamy Burrito Casserole",
        "AUTHOR": "TXHomemaker",
        "PREP_TIME": "50mins",
        "INGREDIENTS": [
            "1 lb    ground beef or 1   lb    ground turkey",
            "1⁄2 medium    yellow onion, chopped",
            "1 (1 1/4  ounce) package   taco seasoning",
            "6 large    flour tortillas",
            "1 (16   ounce) can   refried beans",
            "2 -3 cups   shredded taco cheese or 2 -3   cups    cheddar cheese",
            "1 (10 3/4  ounce) can   cream of mushroom soup",
            "4 ounces    sour cream",
            " jarred hot sauce, if desired to spice it up"
        ],
        "INSTRUCTIONS": [
            "Brown ground meat/turkey & onion; drain.\nAdd taco seasoning and stir in refried beans.\nMix soup and sour cream in a separate bowl.\nSpread 1/2 sour cream mixture in the bottom of a casserole dish.\nTear up 3 tortillas and spread over sour cream mixture.\nPut 1/2 the meat bean mixture over that.\nAdd a layer of cheese.\nYou could put some hot sauce on this now.\nRepeat the layers.\nSprinkle cheese over the top and bake, uncovered, at 350°F for 20-30 minutes.\n"
        ]
    },
    {
        "TITLE": "Kittencal's Moist Cheddar-Garlic Oven Fried Chicken Breast",
        "AUTHOR": "Kittencalrecipezazz",
        "PREP_TIME": "1hr",
        "INGREDIENTS": [
            "1⁄3 cup    butter, melted",
            "2 tablespoons   minced garlic (can use more or less)",
            "2 teaspoons    garlic powder, divided  (garlic lovers can use more)",
            "1⁄2 teaspoon    seasoning salt (or can use white salt)",
            "3⁄4 cup    seasoned dry bread crumb (seasoned or plain)",
            "1⁄2 cup   finely grated cheddar cheese",
            "1⁄4 cup   freshly grated parmesan cheese",
            "1⁄2 teaspoon    ground black pepper (or to taste)",
            "4 boneless skinless chicken breasts",
            " shredded cheddar cheese (optional and use any amount desired, or can use shredded mozzarella cheese)"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 350°F.\nButter an 11 x 7-inch pan (if using more than 4 breasts use a larger pan).\nIn a bowl, combine melted butter with fresh minced garlic, 1 teaspoon garlic powder and salt.\nIn another bowl, combine the dry breadcrumbs with 1/2 cup finely grated cheddar cheese, Parmesan cheese 1 teaspoon garlic powder and coarse ground black pepper.\nDip chicken in butter mixture; then in crumb mixture.\nPlace in prepared pan and bake uncovered for 35-45 minutes or until cooked through, larger breasts may take more time (placing the chicken on a rack in a pan will produce an extra crispy crust).\nTop with shredded cheddar or mozzarella the last 5 minutes of cooking (this is only optional.\n"
        ]
    },
    {
        "TITLE": "Banana Banana Bread",
        "AUTHOR": "Shelley Albeluhn",
        "PREP_TIME": "1hr 15mins",
        "INGREDIENTS": [
            "2 cups    all-purpose flour",
            "1 teaspoon    baking soda",
            "1⁄4 teaspoon    salt",
            "1⁄2 cup    butter",
            "3⁄4 cup    brown sugar",
            "2 large    eggs, beaten",
            "2 1⁄3 cups   mashed very overripe bananas"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 350°.\nLightly grease 9 x 5 loaf pan.\nIn large bowl, combine flour, soda and salt.\nIn separate bowl, cream together butter and brown sugar.\nStir in eggs and mashed bananas until well blended.\nStir banana mixture into flour mixture; stir just to moisten.\nPour batter into prepared loaf pan.\nBake in preheated oven for 60-65 minutes until a toothpick inserted into center of loaf comes out clean.\nLet bread cool in pan for 10 minutes, then turn out onto a wire rack.\n"
        ]
    },
    {
        "TITLE": "Oven-Fried Chicken Chimichangas",
        "AUTHOR": "Miss Annie",
        "PREP_TIME": "45mins",
        "INGREDIENTS": [
            "2⁄3 cup    picante sauce or 2/3  cup   your favorite salsa",
            "1 teaspoon    ground cumin",
            "1⁄2 teaspoon    dried oregano leaves, crushed",
            "1 1⁄2 cups    cooked chicken, chopped",
            "1 cup   shredded cheddar cheese",
            "2 green onions, chopped with some tops  (about 1/4 cup)",
            "6 (8   inch)    flour tortillas",
            "2 tablespoons    margarine, melted",
            " shredded cheddar cheese, for serving",
            " chopped green onion, for serving",
            " picante sauce, for serving"
        ],
        "INSTRUCTIONS": [
            "Mix chicken, picante sauce or salsa, cumin, oregano, cheese and onions.\nPlace about 1/4 cup of the chicken mixture in the center of each tortilla.\nFold opposite sides over filling.\nRoll up from bottom and place seam-side down on a baking sheet.\nBrush with melted margarine.\nBake at 400°F for 25 minutes or until golden.\nGarnish with additional cheese and green onion and serve salsa on the side.\n"
        ]
    },
    {
        "TITLE": "Simply Sour Cream Chicken Enchiladas",
        "AUTHOR": "Debs Recipes",
        "PREP_TIME": "45mins",
        "INGREDIENTS": [
            "1 lb    chicken breast, diced",
            "1 medium    onion, minced",
            "1 tablespoon    vegetable oil",
            "8 (8   inch)    flour tortillas, softened",
            "1 1⁄2 cups   grated monterey jack cheese or 1 1/2  cups    Mexican blend cheese, divided",
            "1⁄4 cup    butter",
            "1⁄4 cup    flour",
            "1 (15   ounce) can   chicken broth",
            "1 cup    sour cream",
            "1 (4   ounce) can  chopped green chilies or 2       fresh chili peppers, minced"
        ],
        "INSTRUCTIONS": [
            "In a frying pan, cook chicken and onion together in oil over medium-high heat until chicken is just done.\nDivide cooked chicken evenly between 8 tortillas; add 1 1/2 tablespoons cheese to each tortilla.\nRoll enchiladas and place seam-side down in a 9x13\" baking dish that has been lightly sprayed with no-stick cooking spray.\nMelt butter in a medium saucepan; stir in flour to make a roux, stir and cook until bubbly, and gradually whisk in chicken broth then bring to boiling, stirring frequently.\nRemove from heat; stir in sour cream and green chilies.\nPour sauce evenly over enchiladas.\nTop with remaining 3/4 cup cheese (a baking dish may be double-wrapped and frozen at this point) and bake at 400° F for 20 minutes until cheese is melted and sauce near edges of baking dish is bubbly.\n"
        ]
    },
    {
        "TITLE": "Fannie Farmer's Classic Baked Macaroni & Cheese",
        "AUTHOR": "Carla C.",
        "PREP_TIME": "40mins",
        "INGREDIENTS": [
            "1 (8   ounce) package   macaroni",
            "4 tablespoons    butter",
            "4 tablespoons    flour",
            "1 cup    milk",
            "1 cup    cream",
            "1⁄2 teaspoon    salt",
            " fresh ground black pepper, to taste",
            "2 cups    cheddar cheese, shredded good quality",
            "1⁄2 cup    breadcrumbs, buttered"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 400°F.\nCook and drain macaroni according to package directions; set aside.\nIn a large saucepan melt butter.\nAdd flour mixed with salt and pepper, using a whisk to stir until well blended.\nPour milk and cream in gradually; stirring constantly.\nBring to boiling point and boil 2 minutes (stirring constantly).\nReduce heat and cook (stirring constantly) 10 minutes.\nAdd shredded cheddar little by little and simmer an additional 5 minutes, or until cheese melts.\nTurn off flame.\nAdd macaroni to the saucepan and toss to coat with the cheese sauce.\nTransfer macaroni to a buttered baking dish.\nSprinkle with breadcrumbs.\nBake 20 minutes until the top is golden brown.\n(You can also freeze this recipe in zip-lock bags for later use - once you have mixed the macaroni along with the cheese sauce allow to cool to room temperature before adding to your freezer - I generally pull it out the night before and allow macaroni and cheese to reach room temperature; I then add the macaroni and cheese to a buttered baking dish, sprinkle with bread crumbs and then bake for 20 to 30 minutes, until golden brown on top and bubbling.\n"
        ]
    },
    {
        "TITLE": "Southern Buttermilk Biscuits",
        "AUTHOR": "P48422",
        "PREP_TIME": "22mins",
        "INGREDIENTS": [
            "2 cups    unbleached all-purpose flour, plus more for dusting the board  (if you can get White Lily flour, your biscuits will be even better)",
            "1⁄4 teaspoon    baking soda",
            "1 tablespoon    baking powder (use one without aluminum)",
            "1 teaspoon    kosher salt or 1   teaspoon    salt",
            "6 tablespoons    unsalted butter, very cold",
            "1 cup    buttermilk (approx)"
        ],
        "INSTRUCTIONS": [
            "Preheat your oven to 450°F.\nCombine the dry ingredients in a bowl, or in the bowl of a food processor.\nCut the butter into chunks and cut into the flour until it resembles course meal.\nIf using a food processor, just pulse a few times until this consistency is achieved.\nAdd the buttermilk and mix JUST until combined.\nIf it appears on the dry side, add a bit more buttermilk.\n It should be very wet.\nTurn the dough out onto a floured board.\nGently, gently PAT (do NOT roll with a rolling pin) the dough out until it's about 1/2\" thick.\n Fold the dough about 5 times, gently press the dough down to a 1 inch thick.\nUse a round cutter to cut into rounds.\nYou can gently knead the scraps together and make a few more, but they will not be anywhere near as good as the first ones.\nPlace the biscuits on a cookie sheet- if you like soft sides, put them touching each other.\nIf you like\"crusty\" sides, put them about 1 inch apart- these will not rise as high as the biscuits put close together.\nBake for about 10-12 minutes- the biscuits will be a beautiful light golden brown on top and bottom.\nDo not overbake.\nNote: The key to real biscuits is not in the ingredients, but in the handling of the dough.\nThe dough must be handled as little as possible or you will have tough biscuits.\nI have found that a food processor produces superior biscuits, because the ingredients stay colder and there's less chance of overmixing.\nYou also must pat the dough out with your hands, lightly.\nRolling with a rolling pin is a guaranteed way to overstimulate the gluten, resulting in a tougher biscuit.\nNote 2: You can make these biscuits, cut them, put them on cookie sheets and freeze them for up to a month.\nWhen you want fresh biscuits, simply place them frozen on the cookie sheet and bake at 450°F for about 20 minutes.\n"
        ]
    },
    {
        "TITLE": "Soft Snickerdoodle Cookies",
        "AUTHOR": "Juju Bee",
        "PREP_TIME": "25mins",
        "INGREDIENTS": [
            "1 cup    butter, softened",
            "1 1⁄2 cups    sugar",
            "2 large    eggs",
            "2 3⁄4 cups    flour",
            "2 teaspoons    cream of tartar",
            "1 teaspoon    baking soda",
            "1⁄4 teaspoon    salt",
            "3 tablespoons    sugar",
            "3 teaspoons    cinnamon",
            "1 teaspoon    vanilla extract"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 350°F.\nMix softened butter, 1 1/2 cups sugar, 1tps of vanilla extract and eggs thoroughly in a large bowl.\nCombine flour, cream of tartar, baking soda and salt in a separate bowl.\nBlend dry ingredients into butter mixture.\nChill dough, and chill an ungreased cookie sheet for about 10-15 minutes in the fridge.\nMeanwhile, mix 3 tablespoons sugar, and 3 teaspoons cinnamon in a small bowl.\nScoop 1 inch globs of dough into the sugar/ cinnamon mixture.\nCoat by gently rolling balls of dough in the sugar mixture.\nPlace on chilled ungreased cookie sheet, and bake 10 minutes.\nRemove from pan immediately.\n"
        ]
    },
    {
        "TITLE": "Panera's Cream Cheese Potato Soup",
        "AUTHOR": "Shawn H",
        "PREP_TIME": "1hr",
        "INGREDIENTS": [
            "4 cups    chicken broth",
            "4 cups   peeled and cubed potatoes",
            "1⁄2 teaspoon    seasoning salt",
            "1⁄4 teaspoon    white pepper",
            "1⁄4 teaspoon    ground red pepper",
            "1 (8   ounce) package   cream cheese, cut into chunks"
        ],
        "INSTRUCTIONS": [
            "Combine broth, potatoes, and spices.\nBoil on medium heat until potatoes are tender.\nSmash a few of the potatoes to release their starch for thickening.\nReduce to low heat.\nAdd cream cheese.\nHeat, stirring frequently, until cheese melts.\n"
        ]
    },
    {
        "TITLE": "Crock Pot Whole Chicken",
        "AUTHOR": "Kathy",
        "PREP_TIME": "23hrs",
        "INGREDIENTS": [
            "4 teaspoons    salt (per recipe reviews, 2 tsp is better)",
            "2 teaspoons    paprika",
            "1 teaspoon    cayenne pepper",
            "1 teaspoon    onion powder",
            "1 teaspoon    thyme",
            "1 teaspoon    white pepper",
            "1⁄2 teaspoon    garlic powder",
            "1⁄2 teaspoon    black pepper",
            "1 large    roasting chicken (with pop-up timer if possible)",
            "1 cup   chopped onion (optional)"
        ],
        "INSTRUCTIONS": [
            "In a small bowl, combine the spices.\nRemove any giblets from chicken and clean chicken.\nRub spice mixture onto the chicken.\nPlace in resealable plastic bag and refrigerate overnight.\n (I usually skip this step because I'm always in a hurry).\nWhen ready to cook, put chopped onion in bottom of crock pot.\nAdd chicken.\n  No liquid is needed, the chicken will make its own juices.\nCook on low 4-8 hours.\nNote:  I highly recommend a pop-up timer in the chicken because some crock pots cook faster/slower than others (my crock pot cooks this recipe in 4-5 hours).\n"
        ]
    },
    {
        "TITLE": "Delicious Chicken Pot Pie",
        "AUTHOR": "vincy bramblett",
        "PREP_TIME": "1hr 45mins",
        "INGREDIENTS": [
            "1 cup    potato, diced",
            "1 cup    onion, diced",
            "1 cup    celery, diced",
            "1 cup    carrot, diced",
            "1⁄3 cup   melted margarine",
            "1⁄2 cup    all-purpose flour",
            "2 cups    chicken broth",
            "1 cup    half-and-half",
            "1 teaspoon    salt",
            "1⁄4 teaspoon    pepper",
            "4 cups    chicken, cooked and chopped",
            "2 pie crusts (either store bought or your own recipe)"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 400°F.\nSaute onion, celery, carrots and potatoes in margarine for 10 minutes.\nAdd flour to sauteed mixture, stirring well, cook one minute stirring constantly.\nCombine broth and half and half.\nGradually stir into vegetable mixture.\nCook over medium heat stirring constantly until thickened and bubbly.\nStir in salt and pepper; add chicken and stir well.\nPour into shallow 2 quart casserole dish and top with pie shells.\nCut slits to allow steam to escape.\nBake for 40-50 minutes or until pastry is golden brown and filling is bubbly and cooked through.\n"
        ]
    },
    {
        "TITLE": "Pete's Scratch Pancakes",
        "AUTHOR": "Bill Hilbrich",
        "PREP_TIME": "20mins",
        "INGREDIENTS": [
            "2 cups    flour",
            "3 tablespoons    sugar",
            "1⁄2 teaspoon    salt",
            "1 tablespoon    baking powder",
            "2 eggs, beat them separately before adding to mixture",
            "1⁄4 cup    butter, melted  (1/8 of a pound)",
            "1 3⁄4 cups    milk"
        ],
        "INSTRUCTIONS": [
            "Mix the dry items first.\nCombine the eggs and melted butter to the milk and slowly stir into the flour mixture.\nHeat the griddle to325 F or the pan to medium high let sit at least 10 minutes while heating the griddle orpan.\nThese will be high, but light and fluffy -- .\n"
        ]
    },
    {
        "TITLE": "Olive Garden Copycat Zuppa Toscana",
        "AUTHOR": "Cycle Michael",
        "PREP_TIME": "1hr",
        "INGREDIENTS": [
            "1 lb    Italian sausage (I like mild sausage)",
            "2 large    russet baking potatoes, wash, sliced in half, and then in 1/4 inch slices",
            "1 large    vidalia onion, chopped",
            "4 slices    cooked bacon, chopped",
            "1 teaspoon    Accent seasoning (optional)",
            "1⁄2 teaspoon    salt",
            "1⁄4 teaspoon    black pepper",
            "1⁄2 teaspoon    red pepper flakes",
            "2 garlic cloves, minced  or 1   tablespoon   of minced garlic from jar",
            "2 cups   packed in measuring cup kale or 2   cups    swiss chard, chopped",
            "2 (8   ounce) cans   chicken broth, add i envelope of chicken bouillon for extra flavor",
            "1 quart    water",
            "2 teaspoons    flour or 2   teaspoons    cornstarch, mixed with enough water to make a paste",
            "1 cup    heavy whipping cream (tempered)"
        ],
        "INSTRUCTIONS": [
            "Chop or slice uncooked sausage into small pieces and cook until browned and meat is ground in bottom of your soup pan over med-high heat.\nAdd onions, garlic, salt, pepper, and red pepper flakes to Sausage and cook until onions are clear and aromatics of the seasonings blend together.\nReduce heat back to medium and place, potatoes, in the pot.\n and slowly add the Chicken Stock and water and stir.\n (use Chicken Bouillon envelope for extra flavor is Chicken Stock is weak).\nCook on medium heat until potatoes are done and stir occasionally.\n Once Potatoes are done, Add flour or cornstarch and simmer for another 15 minutes.\nReduce heat to lowest setting and sprinkle in your kale and cooked bacon and slowly pour cream while stirring.\nCheck for taste and then serve.\n"
        ]
    },
    {
        "TITLE": "Crock Pot Cream Cheese Chicken",
        "AUTHOR": "Dawn399",
        "PREP_TIME": "7hrs 20mins",
        "INGREDIENTS": [
            "3 lbs    chicken pieces",
            "1 (2/3  ounce) package   Italian salad dressing mix",
            "4 tablespoons   melted butter (divided)",
            "1 small    onion, chopped",
            "1 garlic clove, chopped",
            "1 (10 1/2  ounce) can   cream of chicken soup",
            "8 ounces    cream cheese",
            "1⁄2 cup    chicken broth"
        ],
        "INSTRUCTIONS": [
            "Place chicken pieces in crock pot and sprinkle Italian seasoning over chicken.\n Sprinkle with 2 tablespoons melted butter.\nCook on low for 4-6 hours.\nMelt 2 tablespoons butter in a sauce pan and saute onion and garlic.\n Add Cream of Chicken Soup, cream cheese, and chicken broth.\n Stir until smooth.\nAdd this mixture to crock pot and cook on low for an additional hour.\n"
        ]
    },
    {
        "TITLE": "Chicken Lazone",
        "AUTHOR": "Luby Luby Luby",
        "PREP_TIME": "25mins",
        "INGREDIENTS": [
            "1 teaspoon    salt",
            "1 1⁄2 teaspoons    chili powder",
            "1 1⁄2 teaspoons    onion powder",
            "2 teaspoons    garlic powder",
            "4 whole boneless skinless chicken breasts",
            "1⁄4 cup    butter, divided",
            "1⁄2 cup    heavy cream"
        ],
        "INSTRUCTIONS": [
            "Combine the seasonings and coat chicken breasts.\nIn large saute pan melt half of the butter and cook chicken over medium heat for about 7 to 8 minutes, turning once.\nPour the cream into the skillet and lower the heat.\nSimmer for several minutes, stirring until the sauce thickens then add the remaining butter.\nWhen butter is melted place chicken breasts on four plates and top with the sauce.\n"
        ]
    },
    {
        "TITLE": "Fudge Crinkles (A Great 4 Ingredient Cake Mix Cookie)",
        "AUTHOR": "Karen=^..^=",
        "PREP_TIME": "15mins",
        "INGREDIENTS": [
            "1 (18 1/4  ounce) box   devil's food cake mix (Betty Crocker Super Moist suggested)",
            "1⁄2 cup    vegetable oil",
            "2 large    eggs",
            " confectioners' sugar or   granulated sugar, for rolling"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 350Â°.\nStir (by hand) dry cake mix, oil and eggs in a large bowl until dough forms.\nDust hands with confectioners' sugar and shape dough into 1\" balls.\nRoll balls in confectioners' sugar and place 2 inches apart on ungreased cookie sheets.\nBake for 8-10 minutes or until center is JUST SET.\nRemove from pans after a minute or so and cool on wire racks.\n\n*My Notes*:\nI have tried these with several different cake mix brands.\n  They all come out good, but the Betty Crocker does come out the best.\nI was having a problem with my cookies flattening while baking.\n  This usually happens with the generic cake mix brands.\n  You can play with your oven temp and try them on 375 to keep them from spreading.\n  Adding more oil than called for will also cause the cookies to spread -- I wouldn't suggest it, they really don't need extra oil.\nAnother way to keep them nice and thick and to get the most \"crinkled\" or \"crackled\" look is to make them bigger.\n  When I roll them at about 1.\n5 inches they look prettier.\nAnd my best tip:  My confectioners' sugar was consistently being absorbed by the dough.\n  The last time I baked them, I rolled them into balls without rolling in the sugar and let them \"dry\" for a few minutes.\n  Then I rolled them in sugar and baked.\n  These came out with a nice coating of sugar that didn't disappear.\n"
        ]
    },
    {
        "TITLE": "Pork Chops Yum-Yum",
        "AUTHOR": "Brad Beckwith",
        "PREP_TIME": "1hr 10mins",
        "INGREDIENTS": [
            "2 -4 pork chops, 1/2 inch to 3/4 inch thick",
            "1⁄4 cup    chicken broth",
            "1⁄8 cup    honey",
            "1⁄8 cup    soy sauce",
            "1 tablespoon    ketchup",
            "1⁄4 teaspoon    ginger",
            "1⁄8 teaspoon    garlic salt"
        ],
        "INSTRUCTIONS": [
            "Brown chops on both sides.\nPlace in greased casserole dish.\nMix all remaining ingredients and pour over pork chops.\nBake, uncovered, at 350 for one hour.\n"
        ]
    },
    {
        "TITLE": "The Best Brownies",
        "AUTHOR": "Juenessa",
        "PREP_TIME": "40mins",
        "INGREDIENTS": [
            "1⁄2 cup    vegetable oil",
            "1 cup    sugar",
            "1 teaspoon    vanilla",
            "2 large    eggs",
            "1⁄4 teaspoon    baking powder",
            "1⁄3 cup    cocoa powder",
            "1⁄4 teaspoon    salt",
            "1⁄2 cup    flour"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 350 degrees Fahrenheit or 180 degrees Celsius.\nMix oil and sugar until well blended.\nAdd eggs and vanilla; stir just until blended.\nMix all dry ingredients in a separate bowl.\nStir dry ingredients into the oil/sugar mixture.\nPour into greased 9 x 9 square pan.\nBake for 20 minutes or until sides just starts to pull away from the pan.\nCool completely before cutting.\nNote: I usually double the recipe and bake in a 9 x 13 pan.\n If you double the recipe, you will need to cook longer than 20 minutes.\n"
        ]
    },
    {
        "TITLE": "Mexican Rice",
        "AUTHOR": "Pot Scrubber",
        "PREP_TIME": "55mins",
        "INGREDIENTS": [
            "12 ounces    tomatoes, very ripe and cored",
            "1 medium    white onion",
            "3 medium    jalapenos",
            "2 cups    long grain white rice",
            "1⁄3 cup    canola oil",
            "4 minced garlic cloves",
            "2 cups    chicken broth",
            "1 tablespoon    tomato paste (may omit if using canned tomatoes)",
            "1 1⁄2 teaspoons    salt",
            "1⁄2 cup    fresh cilantro, minced",
            "1 lime"
        ],
        "INSTRUCTIONS": [
            "Adjust rack to middle position and preheat oven to 350.\nProcess tomato and onion in processor or blender until pureed and thoroughly smooth.\n Transfer mixture to measuring cup and reserve exactly 2 cups.\n Discard excess.\nRemove ribs and seeds from 2 jalapenos and discard.\n Mince flesh and set aside.\n Mince remaining jalapeno.\n Set aside.\nPlace rice in a fine mesh strainer and rinse under cold running water until water runs clear- about 1 1/2 minutes.\nShake rice vigorously to remove excess water.\nThis step removes the starch from the rice so it will not stick.\n IF YOU OMIT THIS STEP YOUR RICE WILL NOT BE DRY AND FLUFFY.\nHeat oil in heavy bottomed ovensafe 12 inch straight sided sautee pan or Dutch oven with tight fitting lid over low-medium heat about 2 minutes.\n (The recipe is very specific about this but I used a 10 inch dutch oven and it worked out fine.\n) Drop a few rice grains in and if they sizzle then it is ready.\n Add rice and fry stirring until rice is light golden and translucent, about 6-8 minutes.\n  Be careful that the oil doesn't get too hot too fast or the oil will splatter.\nReduce heat to medium, add garlic and 2 minced jalapenos and cook , stirring constantly until fragrant, about 1 1/2 minutes.\nStir in broth, pureed mixture,tomato paste, and salt.\n Increase heat to medium high, and bring to a boil.\nCover pan and transfer pan to oven to bake until liquid is absorbed and rice is tender, 30-35 minutes.\nStir well after 15 minutes.\nStir in cilantro, minced jalapeno to taste, and pass lime wedges separately.\nEdited to add 6-15-05: If you can't get good fresh tomatoes you are better off using canned tomatoes.\n Don't use those awful hard and underipe tomatoes that are at most supermarket chains.\n Just be sure that the processed tomatoes and the one onion equals 2 cups.\n One the other hand- if you find that after processing your tomatoes and onions that you have less than 2 cups- simply add enough bottled salsa to make up the difference.\nEdited 8-21-06: Do not skip any of the steps.\n It may seem stupid- but rinsing the rice to remove the starch is very important if you want fluffy rice.\n It will only take two minutes of your time but it makes the difference.\nEdited 8-15-08: Leftovers are just as delicious the next day so this is a perfect dish to make ahead time for potlucks.\n This rice also freezes well.\n For Freezing Ahead: Cool, portion and freeze in a ziploc bag.\n To reheat from frozen: Place in a pyrex dish and warm in the microwave, stirring every 2-3 minutes until heated through.\nYou'll love this rice! Money back guarantee.\n"
        ]
    },
    {
        "TITLE": "Kittencal's 5-Minute Cinnamon Flop Brunch Cake",
        "AUTHOR": "Kittencalrecipezazz",
        "PREP_TIME": "25mins",
        "INGREDIENTS": [
            "2 cups    all-purpose flour",
            "1 1⁄4 cups    sugar (add in more for a sweeter taste)",
            "1 1⁄4 cups    milk",
            "1 -2 teaspoon    vanilla (optional) or 1 -2   teaspoon    almond extract (optional)",
            "3 teaspoons    baking powder",
            "1 pinch    salt",
            "1 large    egg (optional)",
            "1⁄2 cup    brown sugar (can use more or less)",
            "1 -2 teaspoon    cinnamon",
            "1⁄4 cup   melted butter",
            " chopped walnuts (optional) or   pecans (optional)"
        ],
        "INSTRUCTIONS": [
            "Set oven to 350 degrees F.\nPrepare a greased 13 x 9-inch baking dish, or two 8 or 9-inch round cake pans (although the batter will seem like it will fit into only one 8 or 9-inch pan, this flop rises very high and will run over the sides if baked in just one pan).\nIn a bowl mix the 2 cups flour, 1-1/4 cups white sugar, milk, vanilla or almond extract, baking powder, pinch of salt and egg (if using) until just combined careful not to overmix.\nPour into prepared baking pan/s.\nGenerously spread brown sugar and cinnamon on top.\nIf desired sprinkle chopped walnuts or pecans over top.\nDrizzle melted butter over top.\nBake for about 20-25 minutes for 8 or 9-inch round cake pan, and about 30 minutes for a 13 x 9-inch pan.\n"
        ]
    },
    {
        "TITLE": "Greek Potatoes (Oven-Roasted and Delicious!)",
        "AUTHOR": "evelynathens",
        "PREP_TIME": "1hr 29mins",
        "INGREDIENTS": [
            "8 large    potatoes, peeled, cut into large wedges  (about 6-7 wedges per potato)",
            "4 garlic cloves, minced  (more garlic is a good thing, less garlic is a no-no for this recipe)",
            "1⁄2 cup    olive oil",
            "1 cup    water",
            "1 tablespoon    dried oregano (to taste)",
            "1 large    lemon, juiced",
            " sea salt",
            " fresh coarse ground black pepper"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 420°F  A reviewer has suggested spraying the baking pan with Pam - that sounds like a great idea!Put all the ingredients into a baking pan large enough to hold them.\nSeason generously with sea salt and black pepper.\nMake sure your hands are very clean and put them in the pan and give everything a toss to distribute.\nThe garlic will drop into the water/oil solution but its flavour will permeate the potatoes, and this way, it won't burn.\nBake for 40 minutes.\nWhen a nice golden-brown crust has formed on the potatoes, give them a stir to bring the white underside up, season lightly with a bit more sea salt and pepper and just a light sprinkling of oregano.\nAdd 1/2 cup more water if pan appears to be getting dry, and pop back into oven to brown other side of potatoes.\nThis will take about another 40 minutes.\nDo not be afraid of overcooking the potatoes- they will be delicious.\nNote:  I often melt a bouillon cube in the water; if you do, make sure to cut back some on the salt.\n"
        ]
    },
    {
        "TITLE": "Chicken Tortilla Soup II",
        "AUTHOR": "Eddie Shipman",
        "PREP_TIME": "1hr 10mins",
        "INGREDIENTS": [
            "8 ounces    carrots, diced",
            "8 ounces    celery",
            "8 ounces    onions, diced",
            "1⁄2 teaspoon    garlic powder or 1       garlic clove, diced",
            "1⁄8 teaspoon    salt",
            "1⁄4 teaspoon    pepper",
            "1 tablespoon    corn oil",
            "4 (15   ounce) cans   chicken broth",
            "1 (15   ounce) can   tomatoes, diced  (optional)",
            "1 (10   ounce) can   Rotel tomatoes & chilies, diced",
            "1 (1 1/4-1 1/2  ounce) packet   taco seasoning (I use McCormicks)",
            "10 (8   inch)    corn, tortillas  (NOT FLOUR, cut into small pieces, about 1-in x1-in)",
            "12 ounces    chicken meat, poached, diced",
            "1 cup    milk or 1   cup    sour cream",
            "12 ounces    monterey jack cheese or 12   ounces    Mexican blend cheese, shredded",
            " corn tortilla chips, broken into small pieces for garnish"
        ],
        "INSTRUCTIONS": [
            "Saute carrots, onions, celery in corn oil, garlic, salt and pepper until  tender.\nAdd chicken broth and bring to boil.\nAdd tomatoes, Rotel, taco seasoning, and chicken.\nCut Tortillas into small pieces and add to broth mixture.\nLet boil for 45 minutes or until tortillas are thoroughly incorporated into soup stirring occasionally to keep from sticking.\nReduce heat and add 8 oz.\n cheese.\n Simmer for additional 10 minutes.\nAdd milk and simmer for additional 10 minutes.\nIf thicker soup is desired, add more diced tortillas and let incorporate into soup.\nGarnish with shredded cheese and broken tortilla chips.\nSubstitutions: 1 cup Masa Harina (Masa Flour) for 1 10 ct.\n package of corn tortillas.\nMix masa with 1 cup cold water, then add masa flour mix into soup.\n  If thicker soup is  desired, add more masa/water mix.\nIf you don't want  to use the seasoning packet, substitute 1/2 teaspoons cumin + 1 tsp, chili powder.\nYou can also use grilled chicken fajita meat for poached diced chicken.\nNOTE: If you use FLOUR tortillas, as some people have, you WILL end up with a \"TORTILLA MESS\", this recipe is for CORN tortillas.\n Don't go blaming me and giving me a bad review because you used the wrong stuff.\n"
        ]
    },
    {
        "TITLE": "Better Than Olive Garden Alfredo Sauce",
        "AUTHOR": "Parker?s mom",
        "PREP_TIME": "25mins",
        "INGREDIENTS": [
            "3 tablespoons    sweet butter",
            "2 tablespoons    olive oil",
            "2 garlic cloves, minced",
            "2 cups    heavy cream",
            "1⁄4 teaspoon    white pepper",
            "1⁄2 cup   grated parmesan cheese, plus more for garnish",
            "3⁄4 cup   grated mozzarella cheese",
            "1 (12   ounce) box   angel hair pasta (or fettuccini)",
            "2 tablespoons   chopped parsley, for garnish  (optional)",
            " freshly cracked black pepper, for garnish  (optional)"
        ],
        "INSTRUCTIONS": [
            "Melt butter in medium saucepan with olive oil over medium/low heat.\nAdd the garlic, cream, white pepper and bring mixture to a simmer.\nStir often.\nAdd the Parmesan cheese and simmer sauce for 8-10 minutes or until sauce has thickened and is smooth.\nWhen sauce has thickened add the Mozzarella cheese and stir until smooth.\n            STIR FREQUENTLY.\nWhile the sauce cooks, boil noodles for 3-5 minutes.\nPlace pasta on serving plates and spoon sauce over pasta.\nGarnish with parsley, freshly cracked black pepper and more grated parmesan (optional).\n"
        ]
    },
    {
        "TITLE": "The Best Chili You Will Ever Taste",
        "AUTHOR": "AmandaAOates",
        "PREP_TIME": "2hrs 30mins",
        "INGREDIENTS": [
            "2 teaspoons    oil",
            "2 onions, chopped",
            "3 cloves    garlic, minced",
            "1 lb    lean ground beef",
            "3⁄4 lb    beef sirloin, cubed",
            "1 (14 1/2  ounce) can   diced tomatoes",
            "1 can    dark beer",
            "1 cup    strong coffee",
            "2 (6   ounce) cans   tomato paste",
            "1 can    beef broth",
            "1⁄2 cup    brown sugar",
            "3 1⁄2 tablespoons    chili sauce",
            "1 tablespoon    cumin",
            "1 tablespoon    cocoa",
            "1 teaspoon    oregano",
            "1 teaspoon    cayenne",
            "1 teaspoon    coriander",
            "1 teaspoon    salt",
            "4 (15   ounce) cans   kidney beans",
            "4 chili peppers, chopped"
        ],
        "INSTRUCTIONS": [
            "Heat oil.\nCook onions, garlic and meat until brown.\nAdd tomatoes, beer, coffee, tomato paste and beef broth.\nAdd spices Stir in 2 cans of kidney beans and peppers.\nReduce heat and simmer for 1 1/2 hours.\nAdd 2 remaining cans of kidney beans and simmer for another 30 minutes.\n"
        ]
    },
    {
        "TITLE": "Reeses Squares - 5 Ingredients & No Bake (Reese's)",
        "AUTHOR": "Karen=^..^=",
        "PREP_TIME": "15mins",
        "INGREDIENTS": [
            "1 1⁄2 cups    graham cracker crumbs",
            "1 lb    confectioners' sugar (3 to 3 1/2 cups)",
            "1 1⁄2 cups    peanut butter",
            "1 cup    butter, melted",
            "1 (12   ounce) bag   milk chocolate chips"
        ],
        "INSTRUCTIONS": [
            "Combine graham crumbs, sugar and peanut butter and mix well.\nBlend in melted butter until well combined.\nPress mixture evenly into a 9 x 13 inch pan.\nMelt chocolate chips in microwave or in double boiler.\nSpread over peanut butter mixture.\nChill until just set and cut into bars (these are very hard to cut if the chocolate gets \"rock hard\".\n"
        ]
    },
    {
        "TITLE": "Absolute Best Ever Lasagna",
        "AUTHOR": "ratherbeswimmin",
        "PREP_TIME": "2hrs 30mins",
        "INGREDIENTS": [
            "1 1⁄2 lbs    lean ground beef",
            "1⁄2 lb    Italian sausage or 1/2  lb    ground veal",
            "1 large    onion, chopped",
            "2 -3 garlic cloves, minced",
            "1 teaspoon    salt",
            "1 teaspoon    fresh coarse ground black pepper",
            "1 tablespoon    dried parsley flakes",
            "1 tablespoon    dried oregano",
            "1 tablespoon    dried basil",
            "2 (14 1/2  ounce) cans   whole tomatoes, undrained and chopped  (or canned chopped tomatoes)",
            "12 ounces    tomato paste",
            "24 ounces    ricotta cheese",
            "2 eggs, beaten",
            "1⁄2 teaspoon    pepper",
            "2 tablespoons    parsley",
            "1⁄2 cup   grated parmesan cheese",
            "1 lb    mozzarella cheese, divided",
            "12 -15 lasagna noodles"
        ],
        "INSTRUCTIONS": [
            "Brown ground meat, onion and garlic.\nAdd salt, pepper, parsley, oregano, basil, chopped tomatoes with juice, tomato paste; stirring until well mixed.\nCover and simmer 1 hour (or longer,but watch for getting too dry).\nCook lasagna noodles according to package directions; drain and set aside.\nSpray a 13 x 9\" baking pan with cooking spray.\nCombine riccota cheese, eggs, pepper, 2 tablespoons parsley, Parmesan cheese and 1/2 1lb of mozzarella cheese; In a lasagna pan, layer noodles, meat sauce, and cheese mixture; repeat.\nTop off with layer of noodles; sprinkle evenly with remaining mozzarella cheese; make sure to cover noodles completely.\nBake at 375F for 40-60  minutes, or until cheese mixture is thoroughly melted.\n (I cover w/ foil for about 40 minutes, then uncover for 15-20 minutes.\nLet sit for 15-20 minutes before cutting and serving.\n"
        ]
    },
    {
        "TITLE": "Spinach Artichoke Dip",
        "AUTHOR": "Juli9251",
        "PREP_TIME": "30mins",
        "INGREDIENTS": [
            "2 cups    parmesan cheese",
            "1 (10   ounce) box   frozen chopped spinach, thawed and drained of excess liquid",
            "1 (14   ounce) can   artichoke hearts, drained and chopped",
            "2⁄3 cup    sour cream",
            "1 cup    cream cheese",
            "1⁄3 cup    mayonnaise",
            "2 teaspoons    garlic, minced"
        ],
        "INSTRUCTIONS": [
            "Preheat oven to 375°F.\nMix together Parmesan cheese, spinach, and artichoke hearts.\nCombine remaining ingredients and mix with spinach mixture.\nBake for 20-30 minutes.\nServe with crackers or toasted bread.\n"
        ]
    },
    {
        "TITLE": "Peach Cobbler",
        "AUTHOR": "Suellen Anderson",
        "PREP_TIME": "55mins",
        "INGREDIENTS": [
            "1⁄2 cup   melted butter",
            "1 cup    flour",
            "1 cup    sugar",
            "2 teaspoons    baking powder",
            "1⁄4 teaspoon    salt",
            "2⁄3 cup   room temperature milk",
            "1 room temperature egg",
            "1 (28   ounce) can  sliced peaches, drained",
            "1 cup    sugar",
            "1 teaspoon    cinnamon",
            "1⁄2 teaspoon    nutmeg"
        ],
        "INSTRUCTIONS": [
            "Melt butter in a 9 x 13 inch pan.\nMix together flour, sugar, baking powder & salt.\nStir in milk & egg.\nPour evenly over melted butter.\nCombine peaches, sugar & spices and spread over batter-DO NOT STIR!Bake 35-45 minutes at 350°F until batter comes to the top and is golden brown.\nServe warm with ice cream.\n"
        ]
    },
    {
        "TITLE": "Easy Stove-Top Macaroni & Cheese",
        "AUTHOR": "Marie",
        "PREP_TIME": "30mins",
        "INGREDIENTS": [
            "16 ounces    elbow macaroni",
            "1⁄4 cup    butter",
            "1⁄4 cup    all-purpose flour",
            "1⁄2 teaspoon    salt",
            "1 dash    black pepper",
            "2 cups    milk, warmed",
            "2 cups    shredded cheddar cheese or 8   ounces    cheddar cheese"
        ],
        "INSTRUCTIONS": [
            "Cook macaroni according to package directions.\nIn medium saucepan, melt butter over medium heat; stir in flour, and cook for 3-5 minutes stirring constantly to form a roux; add salt and pepper; slowly add milk, stirring well after each addition.\nCook and stir until bubbly.\nStir in cheese a small amount at a time until fully melted.\nDrain macaroni; add to cheese sauce; stir to coat.\n"
        ]
    },
    {
        "TITLE": "The Sweetest Blueberry Muffins",
        "AUTHOR": "KRUSTY",
        "PREP_TIME": "30mins",
        "INGREDIENTS": [
            "1⁄2 cup    butter or 1/2  cup    margarine, at room temp",
            "1 cup    granulated sugar",
            "2 large    eggs",
            "1 teaspoon    vanilla",
            "2 teaspoons    baking powder",
            "1⁄4 teaspoon    salt",
            "2 cups    all-purpose flour",
            "1 cup    milk",
            "2 1⁄2 cups    fresh blueberries or 2 1/2  cups    frozen blueberries",
            " lemon zest",
            "1 tablespoon    granulated sugar, mixed with",
            "1⁄4 teaspoon    ground nutmeg"
        ],
        "INSTRUCTIONS": [
            "Heat oven to 375°.\nGrease 18 regular-size muffin cups (or 12 large size muffins).\nIn bowl, mix butter until creamy.\n  Add sugar and beat until pale and fluffy.\nAdd eggs one at a time, beating after each.\nBeat in vanilla, baking powder, lemon zest, and salt.\nWith spoon, fold in half of flour then half of milk into batter; repeat.\nFold in blueberries.\nSpoon into muffin cups and sprinkle topping onto each muffin.\nBake 15 to 20 minutes, until golden brown and springy to touch.\n"
        ]
    },
    {
        "TITLE": "The Most Wonderful Gingerbread Cookies",
        "AUTHOR": "gingerkitten D",
        "PREP_TIME": "2hrs 23mins",
        "INGREDIENTS": [
            "3 cups    all-purpose flour",
            "1 1⁄2 teaspoons    baking powder",
            "3⁄4 teaspoon    baking soda",
            "1⁄4 teaspoon    salt",
            "1 tablespoon    ground ginger",
            "1 3⁄4 teaspoons    ground cinnamon",
            "1⁄4 teaspoon    ground cloves",
            "6 tablespoons    unsalted butter",
            "3⁄4 cup    dark brown sugar",
            "1 large    egg",
            "1⁄2 cup    molasses",
            "2 teaspoons    vanilla",
            "1 teaspoon   finely grated lemon zest (optional)"
        ],
        "INSTRUCTIONS": [
            "In a small bowl, whisk together flour, baking powder, baking soda, salt, ginger, cinnamon, and cloves until well blended.\nIn a large bowl (KitchenAid's great for this) beat butter, brown sugar, and egg on medium speed until well blended.\nAdd molasses, vanilla, and lemon zest and continue to mix until well blended.\nGradually stir in dry ingredients until blended and smooth.\nDivide dough in half and wrap each half in plastic and let stand at room temperature for at least 2 hours or up to 8 hours.\nPreheat oven to 375 deg.\n  Prepare baking sheets by lining with parchment paper.\n(Dough can be stored in the refrigerator for up to 4 days, but in this case it should be refrigerated.\n Return to room temp before using.\n) Preheat oven to 375°.\nGrease or line cookie sheets with parchment paper.\nPlace 1 portion of the dough on a lightly floured surface.\nSprinkle flour over dough and rolling pin.\nRoll dough to a scant 1/4-inch thick.\nUse additional flour to avoid sticking.\nCut out cookies with desired cutter-- the ginger bread man is our favorite of course.\nSpace cookies 1 1/2-inches apart.\nBake 1 sheet at a time for 7-10 minutes (the lower time will give you softer cookies-- very good!).\nRemove cookie sheet from oven and allow the cookies to stand until the cookies are firm enough to move to a wire rack.\nAfter cookies are cool you may decorate them any way you like.\nI usually brush them with a powdered sugar glaze when I am in a hurry, but they look wonderful decorated with Royal icing.\n"
        ]
    },
    {
        "TITLE": "Crumb Topped Banana Muffins",
        "AUTHOR": "MizzNezz",
        "PREP_TIME": "35mins",
        "INGREDIENTS": [
            "1 1⁄2 cups    flour",
            "1 teaspoon    baking soda",
            "1 teaspoon    baking powder",
            "1⁄2 teaspoon    salt",
            "3 large   ripe bananas, mashed",
            "3⁄4 cup    sugar",
            "1 egg, lightly beaten",
            "1⁄3 cup    butter, melted",
            "1⁄3 cup   packed brown sugar",
            "1 tablespoon    flour",
            "1⁄8 teaspoon    cinnamon, to taste",
            "1 tablespoon   cold butter",
            "1⁄4 cup    nuts, chopped  (optional)"
        ],
        "INSTRUCTIONS": [
            "In a large bowl, mix the flour, baking soda, baking powder, and salt.\nMix bananas, sugar, egg and melted butter.\nStir into dry mixture until thoroughly combined, then stop mixing.\nFill muffin cups 3/4 full.\nCombine brown sugar, flour, and cinnamon topping ingredients.\nCut in cold butter until crumbly.\nSprinkle over muffins.\nBake at 375 degrees Fahrenheit for about 20 minutes, until muffins test done.\nCool in pan for 10 minutes.\n"
        ]
    },
    {
        "TITLE": "Chinese Fried Rice",
        "AUTHOR": "PalatablePastime",
        "PREP_TIME": "28mins",
        "INGREDIENTS": [
            "3⁄4 cup   finely chopped onion",
            "2 1⁄2 tablespoons    oil",
            "1 egg, lightly beaten  (or more eggs if you like)",
            "3 drops    soy sauce",
            "3 drops    sesame oil",
            "8 ounces   cooked lean boneless pork or 8   ounces    chicken, chopped",
            "1⁄2 cup   finely chopped carrot (very small)",
            "1⁄2 cup    frozen peas, thawed",
            "4 cups   cold cooked rice, grains separated  (preferably medium grain)",
            "4 green onions, chopped",
            "2 cups    bean sprouts",
            "2 tablespoons    light soy sauce (add more if you like)"
        ],
        "INSTRUCTIONS": [
            "Heat 1 tbsp oil in wok; add chopped onions and stir-fry until onions turn a nice brown color, about 8-10 minutes; remove from wok.\nAllow wok to cool slightly.\nMix egg with 3 drops of soy and 3 drops of sesame oil; set aside.\nAdd 1/2 tbsp oil to wok, swirling to coat surfaces; add egg mixture; working quickly, swirl egg until egg sets against wok; when egg puffs, flip egg and cook other side briefly; remove from wok, and chop into small pieces.\nHeat 1 tbsp oil in wok; add selected meat to wok, along with carrots, peas, and cooked onion; stir-fry for 2 minutes.\nAdd rice, green onions, and bean sprouts, tossing to mix well; stir-fry for 3 minutes.\nAdd 2 tbsp of light soy sauce and chopped egg to rice mixture and fold in; stir-fry for 1 minute more; serve.\nSet out additional soy sauce on the table, if desired.\n"
        ]
    },
    {
        "TITLE": "Wonderful Salsa",
        "AUTHOR": "Jazze22",
        "PREP_TIME": "1hr 15mins",
        "INGREDIENTS": [
            "8 cups    tomatoes, peeled, chopped and drained",
            "2 1⁄2 cups    onions, chopped",
            "1 1⁄2 cups    green peppers",
            "1 cup    jalapeno pepper, chopped",
            "6 garlic cloves, minced",
            "2 teaspoons    cumin",
            "2 teaspoons    pepper",
            "1⁄8 cup    canning salt",
            "1⁄3 cup    sugar",
            "1⁄3 cup    vinegar",
            "1 (15   ounce) can   tomato sauce",
            "1 (12   ounce) can   tomato paste"
        ],
        "INSTRUCTIONS": [
            "Mix all together and bring to a slow boil for 10 minute.\nSeal in jars and cook in hot water bath for 10 minute.\nThis is a medium salsa.\n This is also a chunky salsa so if you want a smoother salsa cut your veggies into smaller pieces.\nYields 3-6 quarts or pints.\n"
        ]
    },
    {
        "TITLE": "Dark Chocolate Cake",
        "AUTHOR": "Marg (CaymanDesigns)",
        "PREP_TIME": "1hr",
        "INGREDIENTS": [
            "2 cups    sugar",
            "1 3⁄4 cups    flour",
            "3⁄4 cup    baking cocoa (dutch process or dark cocoa preferably)",
            "1 1⁄2 teaspoons    baking powder",
            "1 1⁄2 teaspoons    baking soda",
            "1 teaspoon    salt",
            "2 eggs",
            "1 cup    milk",
            "1⁄2 cup    vegetable oil",
            "2 teaspoons    vanilla extract",
            "3⁄4 - 1 cup    boiling water (see note below)"
        ],
        "INSTRUCTIONS": [
            "Heat oven to 350°F.\nGrease and flour two 9 inch round baking pans or one 13x9 inch pan.\nIn large mixer bowl, stir together dry ingredients.\nAdd eggs, milk, oil, and vanilla; beat on medium speed for 2 minutes.\nStir in boiling water by hand (batter will be thin).\n NOTE: I have tried it with 1/2 cup, 2/3 cup and 3/4 cup boiling water and we prefer it with less than 1 cup water.\n I usually use between 2/3 & 3/4 cups.\n The cake is still very moist but it doesn't seem to \"fall\" as much as it cools.\n This might have to do with our high humidity or brand of flour or other factors so I don't know if it will work for everyone.\nPour into prepared pan.\nBake 30 to 35 minutes for round 9-inch pans, 35 to 40 minutes for rectangular pan or until wooden pick inserted in center comes out clean.\n (Do not use 8-inch pans or the batter will overflow.\n).\nBecause they have a tendency to overflow if you fill them more than 2/3 full, I usually get about 27-28 cupcakes per batch.\n Bake for approximately 18-20 minutes.\nCool 10 minutes; remove from pan to wire racks.\nPlease note: baking cocoa isn't hot chocolate drink mix! Baking cocoa contains no sugar and it is found on the baking aisle.\n Chocolate drink mixes that you add to milk or water to drink WILL NOT work in this recipe.\n"
        ]
    }
]