[
    {
        "NUMBER": "1",
        "TITLE": "Yummy Air Fryer Chicken Tenders",
        "LINK": "https://pinchofyum.com/air-fryer-chicken-tenders",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1.5 - 2 lbs. chicken tenderloins (about 12-16 pieces)\n3/4 cup all-purpose flour\n1/2 teaspoon kosher salt\none 1-ounce packet ranch seasoning (optional, see notes)\n1 egg\n1-2 teaspoons hot sauce (optional)\n3/4 cup milk + 1 1/2 teaspoons vinegar\n2 1/2 cups plain breadcrumbs\n2 1/2 tablespoons seasoning mix (I use the McCormick rotisserie chicken seasoning)\navocado oil spray"
        ],
        "INSTRUCTIONS": [
            "Prep your dipping stations!1:Combine the flour, salt, and ranch seasoning.2:Let the milk and vinegar sit together for 5 minutes (you’re making a “buttermilk”). Add it to the eggs and hot sauce; whisk to combine.3:Stir the breadcrumbs with the seasoning mix.",
            "Flatten Chicken Tenderloins.Smash each of the chicken tenderloins a few times on a cutting board using the flat side of a knife (see video). You want them to be slightly flattened or fanned out.",
            "Batter Up!Dip each chicken tenderloin in flour; shake off excess. Dip in the buttermilk mixture; let excess drip off. Then coat in the breadcrumbs, flipping and gently pressing a few times until the whole surface is covered. Set aside and repeat with all the chicken tenderloins.",
            "Place in Air Fryer.Place as many as you can fit into the air fryer, keeping them in one flat layer (mine can usually get 6 in at a time). Spray generously with avocado oil spray until the surface is lightly and evenly moistened with oil – this helps them get that evenly golden brown, fried look.",
            "Cook and Serve:Air fry at 400 degrees for 7-9 minutes. You want them to be golden brown on the outside, and 165-175 degrees on the inside. Serve with your favorite sauce! SO yummy!"
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Brandon’s Egg Roll Tacos",
        "LINK": "https://pinchofyum.com/egg-roll-tacos",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 lb. ground chicken, turkey, or pork\n3 tablespoons soy sauce\n1 tablespoon chili crisp\n1 tablespoon garlic paste (or 2 cloves garlic, grated)\n1 tablespoon ginger paste (or a 1/2-inch piece ginger, grated)\n1 cup shredded cabbage and carrots mix (great time to use a store-bought coleslaw or salad mix, where the base is cabbage)\n6-8 small flour tortillas (I like the Mission Street Taco ones for this)\n2-3 tablespoons avocado oil or toasted sesame oil\nMore fresh cabbage / carrot mix (can use the same bag from before!)\nFresh cilantro or green onion\nChili crisp\nGochujang sauce"
        ],
        "INSTRUCTIONS": [
            "Make Filling:Mix the ground meat, soy sauce, chili crisp, garlic, ginger, and veggies together. I just mix it all up with my hands.",
            "Spread Filling:Press the mixture onto one side of the tortillas. I find it easiest to do all of them at once, before you start cooking them.",
            "Cook Tacos:Heat a skillet over medium high heat. Add the oil. Working in batches, add the tacos, meat-side down, and cook for 3-4 minutes until they are browned. Flip to the back side for 1 minute to get the tortillas a bit golden, and then finish with one more flip to being meat-side down to ensure it’s cooked through. (165 degrees for chicken and turkey, 160 for ground pork.)",
            "Top and Eat:Top with more fresh cabbage, cilantro or green onions, and your sauces of choice. Fold in half – it eats kind of like a hybrid between a taco and sandwich, but tastes like an eggroll. I *love* these with the gochujang sauce!"
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Boursin Appetizer with Pistachios and Honey",
        "LINK": "https://pinchofyum.com/boursin-appetizer-with-pistachios-and-honey",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "one 5.4 ounce wheel of Boursin cheese (I like the garlic herb flavor)\n1/2 cup roasted salted shelled pistachios, chopped or crushed (about 1/4 cup crushed)\n3-4 tablespoons hot honey (affiliate link)\ncrackers or apple slices for dipping"
        ],
        "INSTRUCTIONS": [
            "Prep (Optional):Let the Boursin come to room temperature for 15 minutes.(Optional – this just makes it easier to spread, dip, and eat.)",
            "Spread Cheese:Grab a pretty plate or platter – even just a nice dinner plate will work. Use the back of a spoon to press the Boursin onto the plate in an even layer.",
            "Add Toppings:Top with the pistachios. Drizzle with hot honey.",
            "Serve:Serve with crackers or apple slices. I like to throw a small spoon on the plate to make it easier to spread the dip on the crackers. It’s so good!"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Thai Shrimp Curry with Yummy Shallot Crispies",
        "LINK": "https://pinchofyum.com/thai-shrimp-curry-with-yummy-shallot-crispies",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 tablespoon avocado oil\n2 tablespoons red curry paste\n2 cloves garlic, minced (or 2 teaspoons garlic paste)\n1/2 inch piece ginger, grated (or 1 teaspoon ginger paste)\n2 cups veggies of choice (I use red pepper and green beans - see notes)\none 14-ounce can coconut milk\n1 lb. frozen shrimp, thawed (I like to use jumbo shrimp that are peeled with tails removed)\n1 tablespoon fish sauce\n1 tablespoon brown sugar\n3-4 tablespoons avocado oil\n2 shallots, thinly sliced into rings or strips\n1/2 cup panko breadcrumbs\n1/2 cup chopped cilantro and/or torn Thai basil"
        ],
        "INSTRUCTIONS": [
            "Make shallot crispies (optional): Heat the oil over medium heat in a large wide skillet. Add the shallots; sauté until golden, 5-10 minutes. Add panko and mix with the shallots in the pan; sauté another couple of minutes until the whole mixture is golden. Transfer to a small bowl. Toss with the herbs and a pinch of salt.",
            "Start the curry:Wipe the pan out. Turn the heat back on to medium. Add the oil, curry paste, garlic, ginger, and veggies; let it cook for a few minutes. Add coconut milk; simmer until the sauce has thickened slightly and veggies are starting to get tender, about 5 minutes.",
            "Add shrimp:Place the shrimp on top of the gently bubbling curry. The shrimp will basically just steam / poach in the liquid! Easy. After 2-3 minutes, flip the shrimp so they can finish cooking on the other side. When they’re done they’ll start to curl and be fully opaque – in this picture they’re about half done.",
            "Season:Stir in the fish sauce and brown sugar. Taste and adjust – make it more spicy with chili crisp, more salty with fish sauce, etc.",
            "You’re Done! Yum.Scoop the curry over some rice, and top with a little sprinkle of the shallot crispies (OMG)."
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Crispy Buffalo Tofu with Caesar Salad",
        "LINK": "https://pinchofyum.com/crispy-buffalo-tofu",
        "PREP_TIME": "17 minutes",
        "INGREDIENTS": [
            "16 ounce package of tofu (firm or extra firm)\n2 tablespoons cornstarch\n1 tablespoon soy sauce\n1 tablespoon avocado oil\n1 teaspoon paprika\n1/2 teaspoon garlic powder\n3 tablespoons butter\n1/4 cup hot sauce (like Frank's red hot)\nSalad with Caesar, ranch, or bleu cheese dressing (I especially love to throw this tofu on top of an avocado kale Caesar salad!)"
        ],
        "INSTRUCTIONS": [
            "Take the tofu out of the packaging and drain the water. Wrap it with a clean dish towel, or a few paper towels, and gently squeeze out some of the excess moisture. I spend less than a minute on this.",
            "Pull the tofu into bite-sized chunks. Toss with the cornstarch, soy sauce, oil, paprika, and garlic powder.",
            "When everything is well-coated, air fry at 400 degrees for 8 minutes. Shake or toss, then air fry for another 5-6 minutes until golden and crispy. (See notes for baking instructions.)",
            "Melt the butter and whisk with the hot sauce. Toss the crispy tofu in the sauce to coat.",
            "Dip in your favorite sauce or throw in a wrap, bowl, or salad! So yum!"
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Burger Bowls with House Sauce and Ranch Fries",
        "LINK": "https://pinchofyum.com/burger-bowls-with-house-sauce-and-ranch-fries",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 lb. ground beef (85/15 for the juiciest)\n2 teaspoons burger seasoning (one teaspoon per side)\nShredded lettuce\nDiced tomatoes\nDiced burger pickles\n1 22-ounce bag frozen waffle fries\n3 tablespoons butter\n1 1-ounce packet ranch seasoning mix (or 3 tablespoons)\n1/2 cup mayo\n2 tablespoons ketchup\n1 teaspoon horseradish\n1 teaspoon Worcestershire\n1/2 teaspoon paprika\n1 clove grated garlic"
        ],
        "INSTRUCTIONS": [
            "For the ranch fries:Bake the fries according to package directions. Add butter to the sheet pan and toss to get the fries kinda juicy. Then toss those juicy fries with ranch seasoning, adding more or less depending on how many fries you make, and your level of ranch obsession. Yummy.",
            "For the sauce:Whisk your sauce. Taste and season with salt. Or, use a store-bought burger sauce!",
            "For the beef:Heat a cast iron over high heat with no oil (use a well-seasoned pan). You want that pan to be very hot so it’ll sear the beef. Season one side of the ground beef with 1 teaspoon burger seasoning. Add the ground beef to the hot pan, seasoning side down (see video for how I did this straight from package). Resist the urge to break it up immediately –leave it undisturbedfor several minutes to get a nice browned crust. The fat will start to render and it should start to develop some browning.",
            "To finish the beef:Sprinkle the exposed side with the other teaspoon of seasoning. After a few minutes, flip the beef in large chunks – you want to break it up into fork-sized bits, but not too small – this just keeps it juicy and makes it more pleasant to eat with a fork. Once it’s well-browned, remove from heat.",
            "Assemble:Put it all together! The juicy burger crumbles, the ranch fries, the toppings, the house sauce. It’s SO yum."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Roasted Red Pepper Pasta",
        "LINK": "https://pinchofyum.com/roasted-red-pepper-pasta",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1/2 cup roasted red peppers (jarred, drained - 3-5 pieces)\n3/4 cup water\n1/2 teaspoon Better than Bouillon chicken or vegetable broth base\n2 tablespoons butter\n1 large shallot, sliced thinly on a mandoline\n3/4 cup heavy cream\n8 ounces pasta - my favorite is pennoni\n1/2 cup reserved pasta water (optional, as needed)\n1/4 cup Parmesan\nbasil leaves and/or red pepper flakes"
        ],
        "INSTRUCTIONS": [
            "Red Pepper Puree:Blend the red peppers, water, and broth base until smooth.",
            "Saute the Shallots:Heat a large skillet over medium heat. Add the butter and shallots; sauté until the shallots are lightly golden brown and caramelized, about 10-15 minutes.",
            "Cook Pasta:During this time, cook the pasta according to package directions, to al dente so the noodles can finish in the sauce.",
            "Combine Sauce:Turn the heat down to avoid splatters; add the red pepper puree and let it sizzle out for a moment. Then add the cream. Stir to combine; let it gently bubble for a few moments until it has thickened into a nice creamy sauce.",
            "Add Pasta:Add pasta into the sauce; let it simmer for a few moments to thicken and coat the noodles. If needed, add reserved pasta water to reach desired consistency.",
            "Yum.Serve immediately, topped with Parmesan, basil, and/or red pepper flakes. It’s so gooood."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Apricot Chicken with Charred Scallions",
        "LINK": "https://pinchofyum.com/apricot-chicken-with-charred-scallions",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 lb. boneless, skinless chicken breasts\n1 teaspoon kosher salt + 10 cracks of freshly ground pepper\n1/4 cup toasted sesame oil\n1/4 cup reduced-sodium soy sauce\n10 scallions, sliced in half lengthwise\n1/4 cup apricot preserves\na few tablespoons of chili crisp\nRice\nAny other vegetables - I like cucumbers"
        ],
        "INSTRUCTIONS": [
            "Preheat:Preheat the oven to 450 degrees. Place an oven rack in top 1/3 of oven.",
            "Prep Scallions:Cut the scallions in half lengthwise.",
            "Prep Chicken:Cut the chicken into thinner pieces horizontally. Place chicken on a sheet pan; season with salt and pepper. Drizzle sesame oil and soy sauce directly over the chicken.",
            "Add Scallions:Toss the scallions in some of the oil.",
            "Bake:Place the scallions on top of the chicken. Bake for 6 minutes on the rack that is in the top 1/3 of the oven.",
            "Broil:Turn the broiler on; broil for 1-2 minutes – the goal is to get the chicken cooked through (165 degrees) a small amount of charring on the scallions. There is tons of yummy flavor in those charred bits! Immediately spoon apricot jam and chili crisp over the top of each piece so it kind of melts in.",
            "Serve:Serve chicken and a tangle of the charred scallions with rice, spooning extra pan juices over the top (or just drizzling with extra sesame oil and soy sauce). Humble method, max flavor!"
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Chipotle Chicken with Chunky Pistachio Sauce",
        "LINK": "https://pinchofyum.com/chipotle-chicken-with-chunky-pistachio-sauce",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken thighs\n2 1/2 - 3 tablespoons taco seasoning (I use Siete Mild Taco Seasoning, a little more than half the packet)\n1/8 teaspoon chipotle powder (spicy! sub 1/4 tsp smoked paprika if you don't want it spicy)\n1 tablespoon olive oil\n1 large avocado, diced (more firm)\n1/2 cup roasted, salted pistachios\n1/2 cup packed cilantro\na small bundle of chives (.5 oz, a full package)\njuice and zest of one lemon\n1 tablespoon olive oil\n1/2 teaspoon kosher salt (more to taste)"
        ],
        "INSTRUCTIONS": [
            "Prep the Chicken:Trim the fat from the chicken thighs, if you want. Then toss the chicken with the spices and olive oil. You want them to be nicely coated with the spices.",
            "Cook Chicken:Heat the olive oil in a skillet orgrill pan(affiliate link)over medium high heat. Grill or saute the chicken, flipping once, until nice and browned on both sides with an internal temperature of 165 degrees.(See notes for alternate cooking methods.)",
            "Make the Sauce:While the chicken is cooking, use amini-chopper(affiliate link)or food processor to pulse the pistachios, cilantro, and chives until finely chopped.",
            "Finish Sauce:Add to a bowl with the avocado chunks, lemon juice and zest, olive oil, and salt. Stir it up – it’ll be thick, chunky, and a little bit irresistible.",
            "Serve:Cut the chicken into bite-sized pieces (makes it easier to build a bowl and eat)! Season with salt. Top with spoonfuls of the chunky pistachio sauce. I love this with rice and a salad. The flavors!! So good."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Sheet Pan Salmon with Dill Potatoes",
        "LINK": "https://pinchofyum.com/sheet-pan-salmon-with-dill-potatoes",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "24 ounces yukon baby gold potatoes\n1 1/2 tablespoons olive oil\n1 1/2 teaspoon kosher salt\n1/2 cup water\n3 tablespoons butter, melted\n1 clove garlic, grated\n1 tablespoon freeze dried dill, or 3 tablespoons fresh dill\n1.5 pounds salmon filet (I use skin-on)\n3 tablespoons Dijon\n2 tablespoons mayo\nred pepper flakes, more dill, lemon wedge for serving"
        ],
        "INSTRUCTIONS": [
            "Prep the Potatoes:Preheat the oven to 450 degrees. Toss potatoes, oil, and salt on a sheet pan. Add water directly to the pan.",
            "Roast the Potatoes:Roast potatoes for 30 minutes. I recommend stirring every 10-15 minutes to prevent sticking. During this time the water will evaporate / steam the potatoes, and they will get beautifully golden at the same time.(Some sticking is normal and okay – just use a good spatula to firmly get under the potatoes and lift them to keep them all moving around and roasty toasty.)",
            "Prep the Salmon:Move potatoes to the side. Add the salmon filet in one piece to the center of the sheet pan, skin side down. Season with 1/2 teaspoon salt. Mix the mayo and Dijon in a small dish; spread over the top to cover. Bake for 6 minutes. Then broil close to the top of the oven for 2-3 more minutes to get browning on the salmon. You want to bake it until it flakes apart easily – see notes.",
            "Garlic Butter:Mix the melted butter, grated garlic, and dill; spoon over the hot potatoes. Sprinkle the salmon with dill and red pepper flakes.",
            "You’re Done!Squeeze lemon over the whole thing. Flake big chunks of salmon off to serve with the potatoes. Unreal."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "The Best Carrot Cake Cupcakes with Cream Cheese Frosting",
        "LINK": "https://pinchofyum.com/best-carrot-cake-cupcakes-with-cream-cheese-frosting",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "3/4 cup canola oil (see notes)\n1 cup packed brown sugar (190 grams)\n1 1/2 teaspoons vanilla\n2 eggs\n2 medium carrots, peeled, grated, and chopped (180 grams - about 1 1/2 cups)\n1 cup + 2 tablespoons flour (160 grams)\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1 1/4 teaspoon ground cinnamon\n1/4 teaspoon ground ginger (optional)\n3/4 teaspoon salt (I use table salt)\n5 ounces cream cheese, softened\n5 tablespoons butter (I prefer salted butter), softened\n2 1/2 cups powdered sugar\n1 teaspoon vanilla extract"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 350 degrees. Grease a muffin tin with nonstick spray.(I like these without paper liners – they get a perfect ridged edge and nice little domed top, plus a chewier edge!)",
            "Carrots:Grate the carrots, and then roughly chop them into smaller, papery bits. You can also do this in the food processor, but when compared side by side I liked the grated and chopped version better.",
            "Cupcake Batter: Whisk the oil, brown sugar, eggs, and vanilla together until combined. Fold in the carrots. Mix in the dry ingredients until just combined.",
            "Bake:Fill each muffin tin about two thirds of the way full with batter. Bake for 16-17 minutes. Gently press on the centers – if they spring back, they’re done. If not, give them another 2-3 minutes. (Using paper liners will require closer to 19 minutes.)",
            "Cream Cheese Frosting:Using an electric mixer, beat the softened butter and cream cheese together until smooth. Add the powdered sugar and vanilla; mix until smooth. It should be structured enough for piping, but if it’s not, just pop it in the fridge for a moment to solidify.",
            "Frost and Enjoy:Pipe the frosting on top of the cooled cupcakes; serve immediately or store in the fridge. (They’re also great a day later!)"
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Crispy Gochujang Chicken",
        "LINK": "https://pinchofyum.com/crispy-gochujang-chicken",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "1 lb. chicken breasts\n1 teaspoon kosher salt and freshly ground pepper to taste\n1/2 cup flour\n2 eggs + 1/2 tablespoon gochujang sauce\n2 cups panko\navocado oil spray\n4 tablespoons butter\n1 clove grated garlic\n1 1/2 tablespoons gochujang sauce (I use Bibigo brand)\nsalt to taste\nYum Yum sauce for dipping (I will never complain about double sauce)"
        ],
        "INSTRUCTIONS": [
            "Chicken:Cut each chicken breast into thinner pieces. Start by cutting the tenderloin piece off the back. Then slice the breast in half horizontally, or into thirds if it’s a very thick piece. Season the chicken with salt and pepper.",
            "Bowls:Prep three bowls for your breading. 1: the flour. 2: the eggs and gochujang. 3: the panko. Season the panko and flour bowls with an extra 1/2 teaspoon salt.",
            "Breading:Dip the chicken in the flour; shake off excess. Dip into the egg mixture; let excess drip off. Press into the panko on both sides until coated.",
            "Cook:Spray each chicken piece with avocado oil to coat the top surface. Air fry at 375 degrees for 5 minutes, and then at 400 degrees for another 2-3 minutes to get it golden. (Alternate cooking methods in the notes.)",
            "Sauce:Whisk the melted butter, gochujang, and grated garlic in a small bowl. Use a brush to coat each piece of crispy chicken with sauce.",
            "Finish:Slice the chicken up and bring it out to the table on a platter or just directly on the cutting board. Serve it with whatever veggies you have in the fridge. I LOVE this dipped in yum yum sauce!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Crispy Chicken Cutlets",
        "LINK": "https://pinchofyum.com/crispy-chicken-cutlets",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken breasts\n1 teaspoon salt + freshly ground pepper to taste\n1/2 cup flour\n2 eggs, beaten\n1 tablespoon hot sauce like Frank's red hot (a few shakes, optional)\n2 cups panko breadcrumbs\navocado oil spray\nmore salt :)"
        ],
        "INSTRUCTIONS": [
            "Prep:Slice each chicken breast into 3 thin pieces – start by cutting the tenderloin piece off the back, then cut the remaining chicken breast in half horizontally. Season the chicken with salt and pepper.",
            "Three Bowls:Use a wide, shallow bowl for each of the following: 1) flour. 2) eggs + hot sauce. 3) panko. Season the flour and panko bowls with 1/2 teaspoon salt.",
            "Dip and Coat:Dip the chicken into the flour; shake off excess. Dip into the egg mixture; let the excess drip off. Press into the panko, turn it a few times, pressing gently, until fully coated. Transfer to a plate. Repeat for all pieces. Spray each piece with avocado oil spray so it’ll get nice and evenly golden for ya.",
            "Cook It Up:Air fry in a single layer at 375 for 6 minutes, then 400 degrees for 2-3 minutes for extra browning. You want an internal temp of at least 165 degrees. I do it in two batches.(Alternate methods listed in the notes.)",
            "You’re done!Hot, crunchy, salty, juicy, thin and delicious. Perfect dipped or brushed with just about any sauce. We love it."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Ridiculously Good Air Fryer Broccoli",
        "LINK": "https://pinchofyum.com/air-fryer-broccoli",
        "PREP_TIME": "9 minutes",
        "INGREDIENTS": [
            "one 12-ounce bag broccoli florets (or, one head of broccoli cut into about 3 cups of florets)\n2 tablespoons water\n1-2 tablespoons avocado oil or olive oil\n1 teaspoon coarse kosher salt"
        ],
        "INSTRUCTIONS": [
            "Prep The Broccoli:Place florets in a bowl. Add water, oil, and salt. Break into bite-sized pieces and massage gently for 30-60 seconds, until the broccoli turns a slightly brighter green. You want to get it to drink up some of that water and oil mixture a bit!",
            "Cook:Add broccoli to your air fryer. (There will still be a bit of water left over in the bowl; that’s fine.) Air fry at 350 for 5 minutes; give it a quick shake. It should look bright green, like steamed broccoli.",
            "Crisp It Up:Air fry at 375 for another 2 minutes. Now it should start to look browned, crisped, and roasty toasty.(You can adjust the time and temp toget your desired level of crispness).",
            "Finish:You’re done! Yum! It’s fluffy and tender, but crisped and browned at the same time. I love this with a dipping sauce or just sprinkled with a bit of Parmesan."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Whipped Feta Spread",
        "LINK": "https://pinchofyum.com/whipped-feta-spread",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "6 ounces feta cheese\n4 ounces cream cheese\n1/4 cup Greek yogurt\n2 tablespoons olive oil + 2 tablespoons water as needed\na clove of fresh garlic\na pinch of fresh or freeze-dried dill (yummy)\na squeeze of lemon juice"
        ],
        "INSTRUCTIONS": [
            "Blend:Place everything in a small blender or food processor. Pulse until smooth and spreadable, with some flecks of feta remaining.",
            "You’re Done!Serve on sandwiches, wraps, salads, bowls, burgers, or as a dip! This stuff is delicious."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "My New Favorite Pizza Has a Cottage Cheese Crust",
        "LINK": "https://pinchofyum.com/my-new-favorite-pizza-has-a-cottage-cheese-crust",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 cup cottage cheese\n1 cup flour + a few tablespoons for dusting\n1 teaspoons baking powder\n1 teaspoons coarse kosher salt\n1-2 tablespoons olive oil\n1/4 to 1/3 cup sauce (I've been using Rao's marinara)\n1/3 to 1/2 cup shredded mozzarella cheese\n1/4 to 1/2 cup grated Parmesan cheese"
        ],
        "INSTRUCTIONS": [
            "Preheat:Preheat the oven to 450 degrees andplace a rack at the highest position, near the top.",
            "Prep Cottage Cheese:Blend the cottage cheese until smooth.",
            "Make Dough for Crust:Place blended cottage cheese in a bowl; mix with the flour, baking powder and salt until a dough starts to come together. It will start to get kind of shaggy, crumbly, and sticky – use your hands to really bring it together. I usually turn it out on the counter and give it a few squishes, coating with a bit of extra flour, to make it into a cohesive ball.",
            "Form The Crust:Place a sheet of parchment on a pizza pan or baking sheet. Place the dough on the parchment and press into a circle that is about 10-12 inches in diameter. It is a pretty bready crust, so you want to really press it out into a thinner, wider surface area.",
            "Prep The Crust:Rub the top of the crust with olive oil.",
            "Pre-Bake The Crust:Place in the oven; bake (no toppings) for 8-10 minutes.",
            "Add Sauce and Cheese:Remove from oven. Spread with sauce and top with the two cheeses. Bake on that same top rack for another 5 minutes to melt the cheeses.",
            "Broil and Finish:Finally, broil for 2-3 minutes until the cheese and crust edges are deeply golden, like the picture. I like to sprinkle the slices with red pepper flakes, drizzle with olive oil or hot honey, and dip into more sauce! It’s too good!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Mixed Berry Muffins with Sugary Tops",
        "LINK": "https://pinchofyum.com/mixed-berry-muffins-with-sugary-tops",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "3/4 cup coconut oil, melted (see notes)\n1/2 cup brown sugar\n1/4 cup maple syrup\n1/4 cup plain Greek yogurt\n2 eggs\n1 1/2 teaspoons vanilla\n2 cups flour (280 grams)\n2 1/2 teaspoons baking powder\n1/2 teaspoon baking soda\n1 teaspoon fine kosher salt (such as Diamond Crystal)\n2 cups frozen mixed berries (I use the triple berry blend from Costco)\n1/4 cup turbinado sugar for topping (brown sugar also works)\n4 tablespoons softened salted butter\n1/4 cup honey"
        ],
        "INSTRUCTIONS": [
            "Make the Muffin Batter:Preheat the oven to 400 degreses. Whisk the coconut oil, brown sugar, maple syrup, yogurt, eggs, and vanilla together until smooth. Add the flour, baking powder, baking soda, and salt. Stir to form a soft dough.",
            "Thaw the Berries:Microwave 2 cups frozen berries for one minute. Transfer thawed berries to a fine mesh strainer; gently rinse the berries with warm water for 15-30 seconds to wash off the excess colored juices. I like to tap the side of the strainer to get even more water out. The berries will reduce in volume and you’ll be left with about 1 cup of thawed berries.",
            "Add Berries to Muffin Batter:Gently fold the berries into the muffin batter. (There shouldn’t be much excess juice going into the bowl with the thawed berries.) Give it just a few stirs so you incorporate the berries – they’ll get a little mashed, but you want to keep about half of the berries intact.",
            "Top with Sugar:Grease a muffin tin with butter or nonstick baking spray (I prefer this over paper liners). Divide the batter between 9-10 muffin cups, and top with a spoonful of turbinado sugar.",
            "Bake:Bake the muffins for 14-16 minutes, in the middle to top of the oven. Remove from oven and let cool slightly before using a knife to gently release and pull each one out of the muffin tin.",
            "You’re Done! Yum!If you want to serve these with honey butter, which I think you do – just stir the softened butter with the honey until incorporated. Spread it on a warm muffin and live your best life!"
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Sweet Potato Soup with Roasted Cauliflower Crumbles",
        "LINK": "https://pinchofyum.com/sweet-potato-soup-with-roasted-cauliflower-crumbles",
        "PREP_TIME": "1 hour 5 minutes",
        "INGREDIENTS": [
            "1 red onion, cut into large chunks or slices\n3 sweet potatoes, cut into chunks (about 6 cups)\n2 tablespoons avocado oil or olive oil\n1 teaspoon coarse kosher salt\n6 cups vegetable broth (see notes)\n1/2 inch knob of fresh ginger\n1/2 cup macadamia nuts or cashews\n4-6 cups cauliflower florets\na small bundle of chives, chopped\nlemon wedges\na drizzle of infused oil (I like a spicy chili oil)"
        ],
        "INSTRUCTIONS": [
            "Preheat Oven:Preheat the oven to 425 degrees.",
            "Roast Soup Vegetables:Place sweet potatoes and onions on a sheet pan; drizzle with oil, sprinkle with salt. Roast in the oven for 30-45 minutes, until golden brown and softened.",
            "Roast Cauliflower:At the same time, place the cauliflower florets on a second sheet pan, toss with 1 tablespoon oil and 1 teaspoon salt. Roast in the oven for 30 minutes (I just tuck it underneath the sweet potatoes and onions).",
            "Crumble Cauliflower:Break up the cauliflower into smaller bits using the back of a wooden spoon or spatula. Return to the oven for 10-15 minutes to get extra browned.",
            "Blend Soup:Allow the sweet potatoes and onions to cool slightly. Working in two batches, transfer the sweet potatoes and onions to a blender. Add broth, ginger, and macadamia nuts; puree until very smooth.",
            "Serve:Taste and adjust for salt. Serve the soup topped with the roasted cauliflower bits, a sprinkle of chives, a drizzle of oil, and a squeeze of lemon juice. It’s sensory and beautiful! I love this soup!"
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "French Toast Crepes",
        "LINK": "https://pinchofyum.com/french-toast-crepes",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3 eggs\n1 tablespoon maple syrup\n1-2 tablespoons of heavy cream\ndash of cinnamon\n7-10 almond flour tortillas (I love the Siete ones!)"
        ],
        "INSTRUCTIONS": [
            "Make Batter:Whisk together the eggs, maple syrup, cinnamon, and cream if using.",
            "Fry The Crepes:Dip a tortilla in the batter so it’s covered on both sides, and fry in a pan over medium heat until cooked. Repeat for each tortilla.",
            "Serve:Fold and eat with maple syrup, or roll up with yogurt and jam in the middle."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Buffalo Chicken Burgers with Whipped Feta Spread",
        "LINK": "https://pinchofyum.com/buffalo-chicken-burgers-with-whipped-feta-spread",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. ground chicken\n1/2 cup panko breadcrumbs\n1/3 cup hot sauce (I used Frank's Red Hot)\n1/2 teaspoon garlic powder\n1/2 teaspoon salt\n6 ounces feta cheese (block or crumbles)\n4 ounces cream cheese\n1/4 cup Greek yogurt\n2 tablespoons olive oil\n2 tablespoons water\n2 tablespoons melted butter + 2 tablespoons hot sauce for brushing\nBuns\nLettuce"
        ],
        "INSTRUCTIONS": [
            "Make the Whipped Feta:Blend all the ingredients together in a small food processor until it incorporates into a thick and spreadable texture with flecks of feta.",
            "Mix the Burgers:In a medium bowl, mix the burger ingredients together. Form into 4-5 patties.",
            "Cook the Burgers:Heat a small bit of oil in a large nonstick skillet over medium high heat. Add burgers and cook for 3-4 minutes per side, until golden brown and the inside of the burgers is fully cooked (165 degrees).",
            "Brush with Butter:As the burgers are finishing cooking, brush the outside with the melted butter and hot sauce mixture.",
            "Finish:Arrange your burgers on buns with lettuce and a shmear of the whipped feta. SO GOOD."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Crockpot Chicken Bowls with Yellow Rice and Cilantro Pesto",
        "LINK": "https://pinchofyum.com/crockpot-chicken-bowls-with-yellow-rice-and-cilantro-pesto",
        "PREP_TIME": "3 hours 20 minutes",
        "INGREDIENTS": [
            "1 lb. chicken breasts\n8 ounces of a simmer sauce or enchilada sauce that you like (see notes for my recs)\n1 tablespoon cornstarch whisked into 1-2 tablespoons water\nextra seasoning to taste - I often add a few shakes of chipotle powder, salt, and pepper\n1 cup white rice\n1 1/2 cups water\n1 tablespoon butter\n1/2 teaspoon salt\n1/2 teaspoon chili powder\n1/8 teaspoon turmeric\n1 1/2 cups cilantro leaves\n1/2 jalapeño, ribs and seeds removed\n1 clove garlic\njuice and zest of 1 lime\n1/4 cup olive oil or avocado oil\n1/2 cup roasted salted pistachios\nPickled onions (a must for me, every time)\nSour cream and/or your favorite salsa (see notes)\nA salad mix"
        ],
        "INSTRUCTIONS": [
            "For the Crockpot Chicken:Put the chicken in a slow cooker and cover with sauce; cook for 2 1/2 – 3 hours on high. Shred chicken directly in the slow cooker. Add the cornstarch slurry to thicken the sauce. Season to taste.",
            "For the Rice:Rinse the rice in a fine mesh colander. Add the rice, water, butter, salt, chili powder, and turmeric to a small saucepan. Bring to a boil. Cover, reduce heat, and cook for 15 minutes. Remove the cover, fluff it up, and season to taste.",
            "For the Cilantro Pesto:Blend everything up in a small chopper or food processor until smooth-ish (I leave some texture in mine)! It’ll be a very thick sauce, which I love – you can add water as desired to thin it out.",
            "Build Your Bowls:I love the combination of the yellow rice with a scoop of chicken, some salad greens, pickled onions, and a dollop of that cilantro pesto on top!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Cilantro Pesto",
        "LINK": "https://pinchofyum.com/cilantro-pesto",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 bunch cilantro (1.5 - 2 cups - I just cut the top off of the bunch that I buy from the store)\n1/2 jalapeño, ribs and seeds removed\n1 clove garlic\njuice and zest of 1 lime\n1/4 cup olive oil or avocado oil\n1/2 cup roasted salted pistachios\nsalt to taste"
        ],
        "INSTRUCTIONS": [
            "Blend all ingredients in a small food processor, chopper, or blender until it reaches your desired consistency! I like to leave it a little bit textured / chunky.",
            "Enjoy! I like this on top of bowls, soups, pizza, eggs, sandwiches, and wraps… it’s good on just about everything. Store it in the fridge in an airtight container for 3-4 days."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Thai Peanut Chicken Bowls",
        "LINK": "https://pinchofyum.com/thai-peanut-chicken-bowls",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken breasts or thighs, cut into thin slices\n8-ounce jar Thai peanut satay sauce (from Trader Joe's)\n1 clove grated garlic\n2 cups thinly sliced cucumber (1 large English cucumber)\n1/2 cup thinly sliced red onion (about 1/4 an onion)\n2 tablespoons avocado oil\n1 tablespoon vinegar\nsalt and sugar to taste\n4 ounces vermicelli noodles\na few tablespoons of crushed peanuts\na few sprigs of herbs - I like mint, cilantro, and basil because I'm an herb hog!"
        ],
        "INSTRUCTIONS": [
            "Marinate the Chicken:Marinate the chicken with half the jar of sauce and the garlic for about 30 minutes to an hour.",
            "Cucumber Salad:Meanwhile, toss the cucumbers, onions, oil, vinegar, salt and sugar together.",
            "Cook the Chicken:Heat a small amount of oil in a nonstick pan over medium heat; add chicken, let it sit undisturbed for a few minutes to caramelize, then flip and repeat until the chicken is cooked through and golden brown. To caramelize it further, you can add a pinch of sugar towards the end.",
            "Make a Bowl:Serve the chicken over rice noodles, with some of the cucumber salad, fresh herbs, and peanuts.",
            "Sauce:Using your remaining sauce, add a bit of water, soy sauce, or chili oil to the jar to thin it out into more of a dressing. Drizzle over the bowls and dive into that."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Gingery Cranberry Salsa",
        "LINK": "https://pinchofyum.com/gingery-cranberry-salsa",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 12-ounce bag of fresh cranberries\n1/3 cup sugar\nhalf of a jalapeño, ribs and seeds removed (see notes)\none 1-inch knob of fresh ginger root, peeled\n1 clove garlic\n1/2 cup fresh cilantro leaves\n1/2 cup fresh parsley leaves\njuice and zest of 1-2 limes (to taste)\n1/2 teaspoon salt (more to taste)\n1/2 cup salted roasted pistachios (optional)"
        ],
        "INSTRUCTIONS": [
            "Chop Cranberries:Blitz cranberries in a food processor until broken down into a very finely chopped texture, being careful not to overly-chop or puree them. Transfer to a bowl.",
            "Combine with Sugar:Toss cranberries with sugar.",
            "Chop Aromatics and Mix:Add jalapeño, ginger, garlic, and cilantro to the food processor; pulse until finely chopped. Mix into the cranberry bowl; add lime juice, zest, and salt.",
            "Let It Rest (Optional):Let the salsa rest for 12-24 hours, if you can! This helps the cranberries tenderize and get super juicy, and the flavors will all come together so well!",
            "Also Optional:add pistachios to the same food processor, pulse until finely chopped, and add to the cranberry salsa just before serving."
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Deb’s Ranch Crackers",
        "LINK": "https://pinchofyum.com/debs-ranch-crackers",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 bag of oyster crackers (9-10 ounces)\n1 packet of ranch seasoning (I use the 1-ounce packet of Hidden Valley ranch)\n1/2 cup vegetable oil, or 1/2 cup butter, melted and cooled (see notes)\n1 teaspoon dried dill (2 teaspoons if you love dill like I do)"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 250 degrees.",
            "Whisk the ranch seasoning, oil, and dried dill together.",
            "Pour mixture over the oyster crackers in a large bowl. Stir gently to combine. (Taste and adjust at this point and make them your own! Add some red pepper flakes, extra garlic or onion powder, etc.)",
            "Transfer to a sheet pan; bake for 15-20 minutes until dried. You’re done! They’re SO GOOD."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Dulce De Leche Tiramisu",
        "LINK": "https://pinchofyum.com/dulce-de-leche-tiramisu",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "6 egg yolks\n3/4 cup granulated sugar\n1 1/2 cups mascarpone (see notes)\n1 1/2 cups heavy cream\n1/4 cup + 2 tablespoons dulce de leche (I use this canned dulce de leche, which I buy at Target or Cub Foods)\npinch of salt to taste\ntwo 4.4-ounce boxes of soft ladyfingers (I am very loyal to St. Michel soft ladyfingers - absolutely perfect with a little sugar crunch on top)\n2 cups strong coffee or espresso (can be decaf but highly recommend that it is rich, dark, and strong)\n1/2 cup cocoa powder\nchocolate bar for shaving / topping"
        ],
        "INSTRUCTIONS": [
            "Mix Bowl 1:Mix egg yolks and sugar with electric mixer until smooth. The mixture should “ribbon” off the end of the beaters in a silky, steady stream. Make it look smooth and creamy, basically. Add the mascarpone cheese and beat again until combined.",
            "Mix Bowl 2:Beat the heavy whipping cream on high for 1-2 minutes until you get whipped cream. Add dulce de leche, mix again, and add a pinch of salt to taste.",
            "Combine Bowls:Fold whipped cream into the egg and mascarpone mixture. WARNING: IT WILL BE DIVINE.",
            "Pan Prep:Grab an 11×7 pan (a 9×13 will work, as will honestly any shape or size of pan, but 11×7 is my favorite). Use a fine mesh strainer to dust the bottom of your pan with cocoa powder. This helps absorb excess moisture from the espresso so it doesn’t get too wet.",
            "Layer:Dip ladyfingers very briefly in the espresso; turn to coat (I give a slow count of 3 while flipping each one – back side, front side, back side again and remove). You don’t want these in the espresso for a very long time or the whole thing will fall apart. Ladyfingers should cover the bottom of the pan. Layer half the creamy mixture on top of the ladyfingers; repeat ladyfingers layer, then finish with the rest of the creamy layer. Finish with a dusting of cocoa powder again, and/or shaved chocolate.",
            "Fridge:Cover with plastic and transfer to the fride. Let it set for 4 hours minimum, but ideally 12-24 hours.",
            "You’re Done!Yum! Cut and serve straight out of the fridge. Finish slices with more cocoa powder or chocolate shavings on top if you want. Absolutely incredible."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Lemon Rosemary Chicken Soup",
        "LINK": "https://pinchofyum.com/lemon-rosemary-chicken-soup",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1/4 cup olive oil, divided\nhalf an onion, finely chopped\n3 carrots, finely chopped\n3 ribs celery, finely chopped\n3 cloves garlic, minced\n1/2 teaspoon Italian seasoning\n2 sprigs fresh rosemary and/or 2 sprigs fresh thyme\n1 teaspoon coarse kosher salt\n1 can cannellini or navy beans, rinsed and drained\n3 cups shredded kale\n2-3 cups cooked shredded chicken or turkey (see notes)\n5 cups chicken broth (I like the Better Than Bouillon broth base, or bone broth)\njuice of two lemons\nsalt and pepper to taste\ngrated Parmesan, bread, and butter for serving"
        ],
        "INSTRUCTIONS": [
            "Saute Veggies:In a large soup pot, heat 1 tablespoon oil over medium high heat. Add onion, carrots, and celery. Saute for 5-8 minutes or until very soft.",
            "Add Aromatics:Add the garlic, Italian seasoning, rosemary sprigs, thyme sprigs, and salt. Let it get nice and delicious for a minute, stirring to avoid burning or browning the garlic.",
            "Simmer:Add the beans, kale, chicken, broth, and remaining olive oil (optional). Bring to a low simmer for 10-20 minutes, until the kale is wilted. If you have time to cook it for a while longer over low heat, great. Delicious.",
            "Finish:Pull out the herb stems. Add lemon juice, more salt, fresh black pepper to taste (all optional and to taste)! Top with parm and serve with a thick slice of bread, a thick shmear of butter, and a pinch of rosemary salt. Fresh, bright, yummy!"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Brussels Sprouts with Gochujang Butter",
        "LINK": "https://pinchofyum.com/brussels-sprouts-with-gochujang-butter",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "12 ounces shaved brussels sprouts\n1 tablespoon avocado or olive oil\n1/4 teaspoon salt\n3/4 cup walnuts, roughly chopped\n1/4 cup dried cranberries\n4 tablespoons salted butter, softened\n1 1/2 tablespoons gochujang sauce, like this one (Bibigo)\n2 teaspoons toasted sesame oil\n2 teaspoons brown sugar (optional)\n1 small clove garlic, grated\n1/2 teaspoon soy sauce"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 425 degrees.",
            "Mix up the butter ingredients – this can be done in advance and the mixture just wait for you in the fridge.",
            "Arrange the brussels on a sheet pan. Drizzle with the oil and salt and toss to coat. Roast for 15-20 minutes, until golden, crispy, and tender.",
            "Add the walnuts; return to the oven for 3-5 minutes to get the walnuts toasted. Remove from the oven.",
            "Add the cranberries and butter while the pan is still warm; toss to combine.",
            "You’re done! Yum! The butter will melt and coat every nook and cranny. It’ll smell amazing and it’s such a delight to eat!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Incredible Arancini",
        "LINK": "https://pinchofyum.com/incredible-arancini",
        "PREP_TIME": "1 hour 45 minutes",
        "INGREDIENTS": [
            "4 tablespoons butter, divided\nhalf of a yellow onion, finely diced\n4 garlic cloves, thinly sliced or minced\n1 cup arborio rice (DeLallo is the best!)\n1 teaspoon kosher salt\n1/2 cup dry white wine\n3 1/2 cups chicken broth, warmed (see notes)\n1 cup grated Parmesan cheese\na bit of lemon zest (1-2 teaspoons)\n1/4 cup heavy cream\npepper to taste\na block of low moisture Mozzarella cheese, cut into small cubes\n2 cups panko, crushed in a food processor (optional on the crushing but it makes for a finer crisp)\n1/2 cup flour\n2 eggs, whisked\nvegetable oil or canola oil for frying\nYour favorite store-bought tomato sauce, or arrabbiata sauce for something spicy."
        ],
        "INSTRUCTIONS": [
            "Start The Risotto:Melt 2 tablespoons butter in a large skillet. Sauté the onion and garlic until translucent. Add the arborio rice and salt; let it toast a bit to turn lightly golden brown.",
            "Simmer The Risotto:Add the wine; let it sizzle out. Add the broth, about one cup at a time, stirring gradually as you let it simmer. We want the liquid to be absorbed slowly after each addition. This process will take about 15-20 minutes and you’ll be left with something that looks like slightly creamy rice.",
            "Make It Creamy and Cheesy:Add the remaining 2 tablespoons butter, Parmesan, lemon zest, cream, and pepper to taste. IT’S DELICIOUS ALREADY. Try not to eat the whole thing.",
            "Chill:Spread the risotto onto a baking sheet lined with parchment paper. Chill for about an hour.",
            "Form Into Balls:Take a small piece of the chilled risotto and press it into your palm. Tuck a cube or two of mozzarella cheese in there, and wrap the risotto around it into a ball.",
            "Dredge Risotto Balls:Dip the balls into the flour (shaking off excess), then the eggs, then the panko.",
            "Fry The Arancini:Heat the oil (3-5 cups depending on pan size) over medium high heat. When the oil is hot (350 degrees is ideal if you have a thermometer), add the arancini. It should bubble a bit and start to turn golden brown. Flip and brown on the other side.",
            "Finish and Serve:Place on paper towel lined plates to drain excess oil. Sprinkle with salt. Dip in your sauce of choice and OH MY GOODNESS they are so so so good. Your efforts paid off."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Bang Bang Salmon with Avocado Cucumber Salsa",
        "LINK": "https://pinchofyum.com/bang-bang-salmon-with-avocado-cucumber-salsa",
        "PREP_TIME": "22 minutes",
        "INGREDIENTS": [
            "1 1/2 pounds salmon filet\n1-2 tablespoons all-purpose seasoning mix (this is the one I use - see notes for homemade)\n1/4 cup mayo\n2 tablespoons sweet chili sauce\n1 clove garlic, grated\n1 teaspoon soy sauce\nchili crisp for topping\nCooked rice\nSome kind of vegetable - I like a little avocado cucumber salsa which you can find in the notes below!"
        ],
        "INSTRUCTIONS": [
            "Prep the Salmon:Preheat oven to 400 degrees. Cut the salmon into individual portions if you want. Pat the salmon dry. Coat the salmon with the spice mix. Place salmon on a parchment-lined baking sheet.",
            "Make the Bang Bang Sauce:Mix mayo, sweet chili sauce, garlic, and soy sauce in a small bowl. Set half of it aside for after baking.",
            "Bake the Salmon:Spread a small spoonful of sauce over the seasoned salmon pieces. Bake for 10 minutes towards the top of the oven. Then turn the broiler on for another 2-3 minutes, until your salmon looks golden brown and a bit caramelized on top.",
            "Serve:Serve the salmon over rice, with a vegetable of choice, and the reserved bang bang sauce + chili crisp drizzled over top! So easy and so good."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Scallion Pancake with Eggs",
        "LINK": "https://pinchofyum.com/scallion-pancake-with-eggs",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 scallion pancake\na spritz of avocado oil, or a small pat of butter\n1 handful of spinach\n1-2 eggs\nsalt and pepper\nhalf an avocado\nchili crisp to taste"
        ],
        "INSTRUCTIONS": [
            "Fry your scallion pancake in the oil until golden on both sides. Remove from the pan and set aside. (I use a nonstick pan for this.)",
            "In the same pan, add a handful of spinach to wilt it down. When it’s softened, scoot it towards the center of the pan so the scallion pancake will catch all of it when you put it back down.",
            "Add the eggs; fry until the whites have started to set. Use a spatula to break the yolks and spread gently. Before the eggs are fully cooked, squish the scallion pancake on top of the eggs so it sticks to them as they finish cooking.",
            "Remove from heat, fill with toppings of choice (cheese, avocado, sauces, chili crisp is a good move). Roll it up and slice it in half and GO TO TOWN! These are amazing."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Homemade Alfredo Sauce",
        "LINK": "https://pinchofyum.com/homemade-alfredo-sauce",
        "PREP_TIME": "12 minutes",
        "INGREDIENTS": [
            "1/2 cup butter\n3 cloves garlic\n1/2 cup chicken or vegetable broth\n1 cup heavy cream\n1 cup finely grated Parmesan cheese\nsalt and pepper to taste\nPasta of choice! I love this with DeLallo fettuccine or egg pappardelle - this amount of sauce works well with about 8 ounces of pasta"
        ],
        "INSTRUCTIONS": [
            "Melt butter in a large saucepan. Keep the heat very low, and add garlic cloves to butter. Cook until fragrant – about 5 minutes. (If you’re serving this with pasta, start that now! Don’t forget to add a generous pinch of salt to the water!)",
            "Remove garlic cloves from the butter. Add heavy cream and broth, and bring to a very gentle simmer. Whisk to incorporate. Simmer over low heat for 3-5 minutes, or until slightly thickened.",
            "Add Parmesan to the sauce. Whisk in until fully melted and thickened. Taste and add salt and pepper as needed.",
            "Toss with the pasta and keep over low heat until the sauce is clinging to the pasta the way you want! Or spoon the sauce over a protein and/or veg of choice. SO LUSCIOUS!"
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Sticky Gochujang Tofu with Herbs and Peanuts",
        "LINK": "https://pinchofyum.com/sticky-gochujang-tofu-with-herbs-and-peanuts",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1 16-ounce block extra firm tofu - ideally the kind that comes vacuum-packed\n1 tablespoon avocado oil\n2 teaspoons cornstarch\n1/2 teaspoon kosher salt, and pepper to taste\n3 tablespoons gochujang sauce (see note 1)\n2 tablespoons sesame oil\n2 tablespoons soy sauce\n2 tablespoons peanut butter\n1 teaspoon garlic powder\n1-2 tablespoons water as needed\nRice\nCilantro, green onion, and/or peanuts as a garnish\nCucumber, or other veggies for the bowl"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 400 degrees. Press the tofu a few times with paper towels (if you use the vacuum-packed kind, this is hardly necessary at all – yay!). Tear the tofu into rough chunks.",
            "Tofu:Put the tofu chunks in a nonstick square baking dish, or a sheet pan lined with parchment. Add the oil, cornstarch, salt, and pepper directly to the pan; shake or toss to coat.",
            "Bake:Bake tofu for 15 minutes. Give it a shake or stir to rotate the pieces. Then bake for another 10 minutes. (Total bake time: 25 minutes.)",
            "Make Sauce:While baking is happening, shake up the sauce ingredients in a jar until smooth.",
            "Sauce on Tofu:Pour just enough sauce over the tofu to coat; toss to combine. Return to the oven for another 5-10 minutes, checking every so often to prevent burning, until golden brown.",
            "Done!Remove the pan from the oven and toss with a fresh drizzle of sauce. Serve with rice and a vegetable, and top with chopped peanuts, cilantro, green onion, and any remaining sauce. SO GOOD!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Ridiculously Good Chicken Tacos with Green Sauce",
        "LINK": "https://pinchofyum.com/chicken-tacos",
        "PREP_TIME": "22 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken thighs\n1/2 tablespoon soy sauce\n1/2 tablespoon avocado oil\n1 clove garlic, grated (or 1 tsp of garlic paste, or 1/2 teaspoon garlic powder)\n2-3 tablespoons taco seasoning (I use Siete brand)\n1/2 avocado\n1/2 cup mayo\n3-ounce chunk of cotjia cheese\n1 big handful of cilantro stems and leaves (roughly 1/2 cup)\n1 clove garlic\njuice of 1-2 limes (2 tablespoons)\n2 tablespoons water (more as needed)\nTortillas\nLimes, cilantro, and onion for topping"
        ],
        "INSTRUCTIONS": [
            "Season the Chicken:Trim the fat off the chicken thighs if you want (I do). Toss the chicken thighs with soy sauce, oil, and garlic. Sprinkle with taco seasoning and give it a quick mix.",
            "Cook the Chicken:Place the chicken in the basket of an air fryer (alternate cooking instructions in the notes). Air fry at 400 degrees for 10-12 minutes – at this point it should be very crusty, golden, juicy, and delicious.",
            "Make the Sauce:While the chicken is cooking, blitz up the sauce in a small food processor or blender. If it’s too thick, add more water. If it’s too thin, add a bit more avocado or mayo.",
            "Chop the Chicken:When the chicken is done, let it stand for a few minutes and then roughly chop or pull it into bite-sized pieces. Squeeze some lime juice over it. *chef’s kiss*",
            "You’re Done! Yum!A dollop of sauce into a tortilla, a big pile of that juicy chicken, and finish with cilantro and diced onion (and probably more sauce)! It is a dream come true."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Garlic and Black Pepper Beef Skewers",
        "LINK": "https://pinchofyum.com/garlic-and-black-pepper-beef-skewers",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "lbs. skirt steak, cut against the grain into very thin strips (see photos and video)\n1 tablespoon soy sauce\n1 tablespoon garlic paste\n1 tablespoon ginger paste\n1 teaspoon coarse kosher salt\n1 teaspoons granulated sugar\n1 teaspoon curry powder\nfreshly cracked black pepper\nfish sauce, lime juice, chili crisp, and cilantro for topping\nrice\nbroccoli, bagged salad, or a quick cucumber salad, see notes!"
        ],
        "INSTRUCTIONS": [
            "Prep:Soak your skewers – 15 minutes minimum for wood skewers and cut your beef into strips.",
            "Beef:Mix the beef strips with the other beef ingredients. If you have time to marinate, go for it. A 30-45 minute marinating session is delicious! But I promise that if all you have is 5-10 minutes, they’ll still be great.",
            "Skewer:Thread the beef onto skewers – just scrunch it on there (see video). Place skewers on a parchment-lined baking sheet. Top with freshly cracked black pepper.",
            "Broil:Arrange an oven rack 4-6 inches below the heating element. Preheat the broiler on high heat for a few minutes. Broil the beef for 6 minutes – we’re going for caramelization on that top surface.(Alternative cooking methods in notes below)",
            "Serve:Let the beef stand for a few minutes; brush the golden tops with the pan juices, and drizzle with a bit of lime juice and fish sauce. MAGIC WILL HAPPEN. Top with cilantro or chili crisp and serve with a cucumber salad (recipe in notes). Holy smokes! You can eat them plain, drizzled, or in a rice bowl. They are finger licking good. I have been known to eat them standing right over the stove."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Chicken with Coconut Kale",
        "LINK": "https://pinchofyum.com/chicken-with-coconut-kale",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken breasts, cut or pounded into thin pieces\n2-3 tablespoons all-purpose chicken seasoning (I use the McCormick Rotisserie Chicken Seasoning)\n1 1/2 tablespoons avocado oil (divided)\n1 shallot, thinly sliced\n2-3 cups finely shredded curly kale, stems removed (about 3-4 stalks)\n1 tablespoon yellow curry paste (see notes for subs)\n1 can full-fat coconut milk\n1 tablespoon soy sauce\n1 tablespoon brown sugar\nrice\nchili crisp or cilantro for garnish"
        ],
        "INSTRUCTIONS": [
            "Cook the Chicken:Coat the chicken with the spices. In a large nonstick pan, heat 1 tablespoon of avocado oil over medium high heat. Add chicken and cook until golden brown and cooked through, about 2-3 minutes per side. Set chicken aside.",
            "Start the Coconut Kale:If needed, wipe your pan out (see notes). In the same pan, add 1/2 tablespoon avocado oil if needed. Saute the shallots, kale, and yellow curry paste for 5 minutes until everything is aromatic and tender.",
            "Simmer the Coconut Kale:Add all other sauce ingredients; simmer for 5-10 minutes to thicken. When the sauce has thickened, tuck the chicken back in the sauce. Let it get gently bubbly and spoon the sauce over top.",
            "You’re Done! Yum!Sprinkle the whole thing with cilantro. Serve chicken with scoops of the sauce over rice! Finish with whatever toppings you like – for me it’s chili crisp!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Ricotta Meatballs with the Crispy Topping",
        "LINK": "https://pinchofyum.com/ricotta-meatballs-with-the-crispy-topping",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1 lb. ground turkey (I used 93/7 ground turkey - ground chicken also works, as does just about any other type of ground meat that you like!)\n1/2 cup full-fat ricotta cheese\n1/2 cup Parmesan cheese\n1/2 cup panko \n1 teaspoon garlic powder\n1 teaspoon salt\n1/2 teaspoon Italian seasoning\n1 jar tomato sauce (like a marinara or pasta sauce - I like a lot of sauce so I typically use a 28-32 ounce jar)\n1/4 cup panko\n1/4 cup Parmesan cheese\n2 teaspoons olive oil\nchopped parsley"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 400 degrees. Mix all meatball ingredients together.",
            "Meatballs:Roll mixture into 20-24 small meatballs. Drizzle some olive oil in the bottom of a shallow Dutch oven or oven-safe pan to prevent sticking. Put the meatballs in the pan.",
            "Bake:Bake for 20-25 minutes on a middle oven rack. Gently loosen them from the bottom of the pan with a spatula; they should have some nice browning.",
            "Sauce:Add the tomato sauce directly to the pan with the meatballs and stir to get them all coated.",
            "Optional Topping:Mix the 1/4 cup panko, 1/4 cup parmesan cheese, 2 teaspoons olive oil, and parsley in a small bowl. Sprinkle on top of the meatballs and sauce.",
            "Final Bake:Return to the oven for 5-7 minutes to warm the sauce. Turn on the broiler for the last 2-3 minutes to get the crispies nice and golden (just watch it so it doesn’t burn).",
            "You’re Done! Get into this! SO good served with agreen saladandgarlic breadfor dunking into the sauce!"
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Welcome to the SOS Series",
        "LINK": "https://pinchofyum.com/welcome-to-the-sos-series",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": "3",
        "TITLE": "Spicy Shrimp with Peach Salad",
        "LINK": "https://pinchofyum.com/spicy-shrimp-with-peach-salad",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. shrimp\n1 teaspoon smoked paprika\n1 teaspoon curry powder\n1/2 teaspoon garlic powder\n1/2 teaspoon coarse sea salt (start here, add more as necessary)\n1/8 to 1/4 teaspoon cayenne pepper (add to taste - it'll make it spicy!)\n1 tablespoon butter\na drizzle of honey (to taste - 1 tsp to 1 tablespoon)\n2 peaches, pitted and sliced (about 2 cups)\nhalf an English cucumber, thinly sliced (about 1 cup)\nhalf a shallot, thinly sliced (about 1/4 cup)\n2-3 teaspoons olive oil\n1 lime, juiced and zested (about 1 tablespoon juice, 1 teaspoon zest)\nsalt and pepper to taste\nmint leaves (about 2 packed tablespoons)\n2-3 teaspoons honey to finish (I like hot honey!)\n1 avocado, cubed (optional)"
        ],
        "INSTRUCTIONS": [
            "Peaches and Rice:Toss everything together for the peach salad. Prep anything else you might serve this with (I like rice).",
            "Shrimp Seasoning:Toss the shrimp with the spices.",
            "Cook Shrimp:Heat a drizzle of avocado oil in a skillet over medium heat. Add the shrimp and cook until no longer translucent, about 2 minutes per side.",
            "Finish:Add a knob of butter and a drizzle of honey at the end of cooking to toss with the shrimp and pull up some of the browned bits from the bottom of the pan. This will also make the shrimp saucy, glazey, and delicious.",
            "You’re Done! Yum!Plate the shrimp over rice with a big scoop of that peach salad! So yum."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Party Brownies",
        "LINK": "https://pinchofyum.com/party-brownies",
        "PREP_TIME": "55 minutes",
        "INGREDIENTS": [
            "1 box brownie mix (usually 16-18 ounces)\n6 tablespoons butter\n1/3 cup milk\n1 1/4 cups granulated sugar\n1 teaspoon vanilla extract\n1/2 teaspoon coarse kosher salt\n1 cup semi-sweet chocolate chips\nrainbow sprinkles"
        ],
        "INSTRUCTIONS": [
            "Make the brownies:Bake the brownies according to package directions in a 9×13 pan or slightly smaller rectangular pan (see note 1). I usually try to let them cool for an hour before frosting them.",
            "Make the frosting:Melt the butter in a small saucepan over medium heat. Add the milk, sugar, vanilla, and salt; bring to a consistent boil over medium heat and cook for 45 seconds (it should be at a rolling boil for the full 45 seconds). Set a timer so you don’t overcook it!",
            "Mix in the chocolate:Turn off the heat and add chocolate chips and stir to combine (if there are stubborn lumps, just whisk it for a minute).",
            "Frost the brownies:Working quickly, pour the frosting over the brownies and spread evenly and add sprinkles. The frosting will start to set immediately, so don’t be a slow poke with this part (see note 2)!",
            "Rest and serve:Let the frosting rest for 15-30 minutes, depending on how clean you want your slices to be! Cut, serve, PARTY TIME!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "How You Should Be Doing Oat Bran for Breakfast",
        "LINK": "https://pinchofyum.com/how-you-should-be-doing-oat-bran-for-breakfast",
        "PREP_TIME": "6 minutes",
        "INGREDIENTS": [
            "1 cup oat bran\n1 3/4 cups water\n1 cup whole milk (or milk of choice)\npinch of salt\n2 eggs or 3 egg whites, beaten\n2 tablespoons maple syrup (more to taste)\nbutter for serving\nfruit for topping (I like raspberries)"
        ],
        "INSTRUCTIONS": [
            "Simmer:In a small saucepan, simmer the oat bran, water, milk, and salt. Cook until thickened, 2-3 minutes.",
            "Add eggs:Pour the eggs in and stir continuously over low heat until incorporated (if it’s too hot, the eggs will scramble, so make sure to stir vigorously and continuously to work them in gradually). I usually do this for 1-3 minutes until I feel that they’ve been heated enough to be cooked. You can use a whisk or a wooden spooon.",
            "You’re Done! Yum!Stir in maple syrup and more water or milk if needed. Serve with butter on top, raspberries, and a drizzle of maple syrup if you want!"
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Gorgeous Peach Salad",
        "LINK": "https://pinchofyum.com/gorgeous-peach-salad",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "2 peaches, pitted and sliced (about 2 cups)\nhalf an English cucumber, thinly sliced (about 1 cup)\nhalf a shallot, thinly sliced (about 1/4 cup)\n2-3 teaspoons olive oil\n1 lime, juiced and zested (about 1 tablespoon juice, 1 teaspoon zest)\nsalt and pepper to taste\nmint leaves (about 2 packed tablespoons)\n2-3 teaspoons honey to finish (I like hot honey!)"
        ],
        "INSTRUCTIONS": [
            "Do all your slicing / prep! I like to use amandolinefor the shallots and cucumber.(affiliate link)",
            "Toss the cucumbers and shallots with the lime juice, lime zest, olive oil, and a bit of salt and pepper. Let them sit for 5-15 minutes.",
            "Add peaches, mint leaves, and a drizzle of hot honey. Toss gently to combine.",
            "To make it extra pretty, serve with extra mint leaves, honey honey, and salt and pepper on top! Eat right away, within an hour."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Honey Chipotle Chicken Skewers",
        "LINK": "https://pinchofyum.com/honey-chipotle-chicken-skewers",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 pound chicken breasts, cut into bite-sized pieces\nwood skewers (optional)\n1 1/2 tablespoon honey\n1 chipotle pepper in adobo, minced\n1 clove garlic, grated\n2 tablespoons taco seasoning (I like the Siete brand)\n1 orange, zest and juice (1-2 teaspoons zest and 1 tablespoon juice)\n1/2 teaspoon kosher salt\n1 tablespoon avocado oil"
        ],
        "INSTRUCTIONS": [
            "Soak:Soak the skewers in water for 15-30 minutes while you prep the chicken.",
            "Mix:Using your hands or tongs, mix the chicken with the honey chipotle mix. It’ll look saucy and messy, in a good way.",
            "Skewers:Thread the chicken pieces onto skewers (usually I get 4 skewers with a pound of chicken).",
            "Cook Em Up:You can cook these a number of different ways – I air fry them at 400 degrees for 10 minutes or until internal temperature reaches 165 degrees. Grilling would also be amazing! Finish with a drizzle of honey, or (yum) 2 tablespoons of melted butter mixed with honey. It’s so good!"
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Amazing Green Rice",
        "LINK": "https://pinchofyum.com/amazing-green-rice",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 1/2 cups long-grain white rice\n1 bunch cilantro (about 1 cup packed)\n3-4 cups fresh spinach\n1 shallot, peeled and roughly chopped\n1 serrano pepper, ribs and seeds removed, roughly chopped (sub a jalapeño pepper)\n1-2 cloves garlic\n2 tablespoons olive oil\n1/2 teaspoon salt (1 teaspoon salt if using water)\n2 cups chicken or vegetable broth, or water (up to 2 1/2 cups for stickier rice)"
        ],
        "INSTRUCTIONS": [
            "Rice Prep:Thoroughly rinse the rise in a mesh colander. Shake it a few times to remove excess water, or blot it dry with paper towels. (This prevents it from splattering in the oil when you add it to the pan in Step 3.)",
            "Make Green Herb Mixture:Pulse the cilantro, spinach, shallot, serrano, and garlic in a food processor until very finely chopped.",
            "Saute the Rice:Add olive oil to a skillet over medium high heat. Add rice and sauté for 3-5 minutes until lightly toasted. Add the herb mixture and salt; sauté for another 3-5 minutes until nice and fragrant.",
            "Cook the Rice:Add the broth or water, bring to a simmer. Cover and keep over low heat for 15-ish minutes. Check the rice by fluffing with a fork; add more water / cook longer if necessary. When the rice is done to your liking, remove from heat and fluff with a fork to distribute the greens.",
            "You’re Done!Yum! Serve withchicken skewers,air fryer chickenorsalmon,tacos, beans and creamy corn, etc."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Super Yummy Chicken Salad",
        "LINK": "https://pinchofyum.com/super-yummy-chicken-salad",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "1/2 cup plain Greek yogurt (I prefer 2% milkfat or higher)\n1/4 cup mayo\n1 tablespoon Dijon mustard\n2 teaspoons sugar (more or less to taste - and honey also works!)\n3/4 teaspoon kosher salt\n3/4 teaspoon onion powder\n1/2 teaspoon garlic powder\n2 1/2 cups cooked chicken, cubed or diced (I use rotisserie chicken breast)\n1 1/2 cups red grapes, sliced\n1 cup finely diced celery (about 2-3 stalks)\n1 cup roasted cashew halves and pieces\nany extra seasonings you like (dried herbs, fresh herbs, salt and pepper, etc. - I typically add dried chives!)"
        ],
        "INSTRUCTIONS": [
            "Dressing:Whisk the dressing ingredients until smooth. Taste and adjust, keeping in mind that it should taste salty / concentrated as it will distribute amongst all the other ingredients.",
            "Mix:Toss your mix-ins (chicken, grapes, celery, and cashews) with as much of the dressing as you like.",
            "Season:Taste, adjust, and zhuzh to your heart’s content. I usually stir in some freeze-dried chives and white pepper.",
            "You’re Done! Yum!Eat on a whole wheat wrap, lettuce wrap, sandwich, toast, dipped with crackers or just PLAIN! Delicious, cold, creamy, I love it. Store leftovers in an airtight container the fridge for up to 4 days."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Avocado Caesar Green Beans",
        "LINK": "https://pinchofyum.com/avocado-caesar-green-beans",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "half an avocado\n1/4 cup mayonnaise\n1/4 cup water (up to 1/2 cup)\n1 large clove garlic\n1/2 tablespoon Dijon mustard\n2 tablespoons lemon juice\n1/2 teaspoon salt\n1 cup panko breadcrumbs\n1/2 teaspoon garlic powder\n2 tablespoons olive oil\npinch of salt\n12 ounces green beans, ends trimmed\nParmesan for topping"
        ],
        "INSTRUCTIONS": [
            "Make the Avocado Caesar:Blitz everything in a small blender jar until smooth sauce / dressing forms. Taste and adjust (look out, it’s really good). If it’s too thick, add some extra water until it drizzles smoothly off the end of a spoon.",
            "Make the Panko Crispies:Mix panko, garlic powder, olive oil, and salt in a small microwave-safe bowl. Microwave in 30 second increments, stirring after each one, until the panko starts to turn golden (about 2-3 minutes total). It’ll be very hot – be careful, don’t taste it yet.",
            "Cook the Green Beans:Boil green beans for 3-5 minutes until bright green. If you want to preserve the best color, drain and transfer to a bowl with ice water to shock the green beans and stop them from cooking further. Not necessary, but I do this sometimes because I like the very bright green!",
            "Assemble and Serve:Arrange the green beans on a platter, top with dollops of the avocado caesar, and sprinkles of panko crispies and grated Parmesan. (You’ll probably have a little bit of avocado caesar left which I never have any issues using up!) Add lemon zest, black pepper, or chili flakes if you want. Serve warm or cold with your favorite protein, and maybe a little extra sauce for dunking. So good!"
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Two Huge Double Chocolate Cookies",
        "LINK": "https://pinchofyum.com/two-huge-double-chocolate-cookies",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3 tablespoons butter, very soft (see photos)\n5 1/2 tablespoons brown sugar\n1 egg yolk\n1/4 teaspoon vanilla\n4 tablespoons flour (37 grams, see note 1)\n2 1/2 tablespoons cocoa powder (15 grams, see note 2)\n1/4 teaspoon baking soda\n1/8 teaspoon salt\n3-4 tablespoons chocolate chips or chunks\ngranulated sugar for rolling"
        ],
        "INSTRUCTIONS": [
            "Soften the Butter: Preheat the oven to 350 degrees. Soften the butter for about 10 seconds in the microwave – the ideal is slightly melted but not all the way, like what’s in the picture.",
            "Mix the Dough:Add brown sugar; stir to combine. Add egg yolk and vanilla; stir to combine. Add flour, cocoa powder, baking soda, and salt; stir to combine. Stir in the chocolate chips",
            "Make the Dough Balls:Form the dough into two huge balls (reserving a bit of cookie dough for tasting, obviously) and roll each of them in granulated sugar.",
            "Bake:Transfer the dough balls to a baking sheet – they may feel slightly heavy and/or loose which is normal. Bake for 10 minutes. Remove from the oven and let them rest on the pan for another 10 minutes to set up.",
            "Eat:Enjoy your moment of bliss!"
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Big Yummy Italian Salad",
        "LINK": "https://pinchofyum.com/big-yummy-italian-salad",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3-4 cups chopped romaine lettuce\n12-15 pieces salami, cut into bite-sized pieces\n1/2 cup cubed cheese like Provolone\n1/4 cup grated Parmesan cheese\n1/2 cup DeLallo Sliced Mild Pepperoncini\n1/2 cup thinly sliced red onion\n1 cup panko\n1/2 teaspoon garlic powder\n2 tablespoons DeLallo Castelvetrano Extra Virgin Olive Oil\nDrizzle of DeLallo Castelvetrano Extra Virgin Olive Oil (3 tablespoons)\nSplash of pepperoncini brine (1-2 tablespoons)\nA few shakes of Italian seasoning (about 1/2 teaspoon)\nsalt and pepper to taste"
        ],
        "INSTRUCTIONS": [
            "Prep Salad Stuff:Chop all your salad veggies, meat, cheese, etc.",
            "Make Golden Crispy Garlic Panko:Mix panko, oil, and garlic powder in a bowl. Microwave for 1 minute, stir, and microwave again for 20-40 seconds until it’s nice and golden. (It’ll be hot! Don’t taste it yet.) Season with salt.",
            "Toss with No-Recipe Dressing:Add all your salad stuff to a large bowl. Drizzle with oil, pepperoncini brine, Italian seasoning, salt and pepper. Toss to combine, taste, adjust, you know the drill. Finish by tossing those golden panko crispies in there! YUM!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Crispy Rice Salad with Cucumbers and Herbs",
        "LINK": "https://pinchofyum.com/crispy-rice-salad-with-cucumbers-and-herbs",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "a 1/2-inch knob of fresh ginger, or a spoonful of ginger paste (note 1)\n1 clove garlic\n1/4 cup fish sauce\n1/4 cup + 2 tablespoons avocado oil, or another neutral oil\n1/4 cup lime juice (3-4 small limes)\n2 tablespoons brown sugar\n1/2 tablespoon chili crisp (more for spicier)\n2 cups cooked jasmine rice (note 2)\n2 tablespoons avocado oil\n2 teaspoons red curry paste\n2 teaspoons cornstarch (optional)\nhalf an English cucumber, thinly sliced (about 1 cup)\n1 shallot, thinly sliced or minced (about 1/4 cup)\n1 bunch cilantro, roughly chopped (about 1/2 cup)\n1 bunch mint, roughly chopped or torn (about 1/4 cup)\n1/2 cup chopped peanuts\nchili crisp to taste"
        ],
        "INSTRUCTIONS": [
            "Dressing:Blitz everything up in a blender or food processor to make this SUPER yummy, punchy sauce.",
            "Crispy Rice:Toss the rice in a bowl with the oil and curry paste. If it’s not sticking together when you squeeze it, add the cornstarch and get your hands wet to mix it again (this happens if the rice is pre-cooked or several days old). Squeeze it into loose, squishy chunks and transfer to the air fryer in a single layer. Air fry at 400 for 7-9 minutes, until golden and crisped.(See Note 3 for alternative methods – I find the air fryer to be fastest and most convenient!)",
            "You’re Done! Yum!Break the crispy rice apart into little golden, delightful chunks. Toss with about half of the dressing and however many veggies you want. Garnish it with some peanuts and chili crisp if you want. I mean, honestly. Wow. This is so good."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Incredible Gochujang Sauce",
        "LINK": "https://pinchofyum.com/incredible-gochujang-sauce",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "1/2 cup mayo (vegan or regular)\n1-2 tablespoons gochujang sauce (I use a sauce like this)\n1 clove grated garlic\n1 teaspoon soy sauce\n1 teaspoon rice vinegar\nsalt and pepper to taste"
        ],
        "INSTRUCTIONS": [
            "Mix all ingredients together in a small bowl. Taste and adjust! I usually add a small pinch of salt because I love salt. You can also thin it out with a tablespoon of water so more of a drizzle if that’s what you’re going for!",
            "Serve as a dip with grilled orair-fried chicken, a dressing for a creamy slaw, a spread on a burger – whatever floats your boat. It’s all so delicious."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Ridiculously Good Air Fryer Salmon",
        "LINK": "https://pinchofyum.com/air-fryer-salmon",
        "PREP_TIME": "13 minutes",
        "INGREDIENTS": [
            "1 lb. salmon (see note 1)\n1 tablespoon brown sugar\n1 teaspoon paprika\n1 teaspoon smoked paprika\n1/2 teaspoon chili powder\n1 teaspoon onion powder\n1/2 teaspoon garlic powder\n1 teaspoon cornstarch\n3/4 teaspoon coarse kosher salt (or 1/2 teaspoon table salt)\n2-3 teaspoons avocado or olive oil"
        ],
        "INSTRUCTIONS": [
            "Prep the salmon:Remove the skin from your salmon, if it has skin. Pat with paper towels so the surface is mostly dry. Cut your salmon into cubes, 1 to 2 inches each (see photo).",
            "Prep the spices:Mix the spices together in a small bowl.",
            "Toss salmon with spices:Toss your salmon cubes in the spices and oil – I usually use my hands to mix it all together.",
            "Air fry the salmon:Place your salmon pieces in the air fryer (I just dump them right in) and spread them out a bit so they’re not laying all over each other. Air fry at 400 degrees for 8 minutes!",
            "You’re Done! Yum!At this point it should be textured and golden on the outside, and juicy and delicious on the inside. When you press each piece with a fork, they should easily flake / slip apart with a buttery, juicy texture inside. (You can do 6-7 minutes if you prefer more of a medium doneness.)"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "33 Things You Absolutely Need To Be Buying At Trader Joe’s (and 3 You Can Skip)",
        "LINK": "https://pinchofyum.com/33-things-you-absolutely-need-to-be-buying-at-trader-joes",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": "5",
        "TITLE": "Two Huge Chocolate Chip Cookies",
        "LINK": "https://pinchofyum.com/two-huge-chocolate-chip-cookies",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3 tablespoons butter, very soft or partially melted\n3 tablespoons packed brown sugar\n1 1/2 tablespoons white sugar\n1/4 teaspoon vanilla\n1 egg yolk\n1/3 cup + 2 tablespoons all-purpose flour (~60 grams, see note 1)\n1 teaspoon cornstarch\n1/4 teaspoon baking soda\n1/4 teaspoon kosher salt\n1/4 cup chocolate chips"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 350 degrees.",
            "Mix butter, sugars, vanilla, and egg yolk until combined.",
            "Stir in flour, cornstarch, baking soda, and salt. When a soft dough has formed, stir in the chocolate chips.",
            "Roll the dough into two balls and place on a baking sheet – there should be plenty for two large cookies plus a little bit of dough for a snack. (You’re welcome.) You can add more chocolate chips to the top of the cookies if you want.",
            "Bake for 10-12 minutes, depending on your oven temp and desired level of gooey cookie center.",
            "Rest the cookies for a few minutes so they settle down and solidify a bit –  I set a timer for 10-15 minutes and just let them rest right on the pan. At that point they should be able to transfer to a plate, or maybe even held in your hand, for warm, delicious eating on the couch. Yum, yum, yum."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Marry Me Chicken",
        "LINK": "https://pinchofyum.com/marry-me-chicken",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "2 tablespoons butter\n3 cloves garlic, thinly sliced (note 1)\n1 tablespoon tomato paste (note 2)\n1 cup heavy cream\n1 cup chicken broth\na few sprigs of thyme\n1 14.5-ounce jar petite diced tomatoes, drained thoroughly (note 3)\nsalt to taste (note 4)\na batch of air fryer chicken (note 5)"
        ],
        "INSTRUCTIONS": [
            "Sauce Base:Heat a large skillet over medium low heat. Add the butter, garlic, and tomato paste; sauté for a few minutes until it’s all soft and fragrant.",
            "Add Cream, Broth, and Thyme:Add the cream; whisk to get the tomato paste smooth. Add the broth and thyme sprigs; simmer for 10-15 minutes to thicken the sauce until it reduces and clings to the back of a spoon. (If you’re using the air fryer chicken, now is a good time to start that.)",
            "Add Tomatoes and Chicken:Pop your drained diced tomatoes in the sauce and stir them in. Tuck the cooked chicken into the sauce and spoon a bit of sauce over the top.",
            "You’re Done! Yum.Sprinkle some thyme, parsley, or basil over the top to make it look pretty. Serve the pieces of chicken with spoonfuls of the sauce over rice, noodles, or mashed potatoes (personal fave) and a side salad for a beautiful, mega delicious meal."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Ridiculously Good Air Fryer Tofu",
        "LINK": "https://pinchofyum.com/ridiculously-good-air-fryer-tofu",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 block extra firm tofu (look for one that is vacuum-packed so you don't have to press it! see note 1)\n2 1/2 tablespoons cornstarch\n2 1/2 tablespoons nutritional yeast (see note 2)\n2 1/2 tablespoons soy sauce\n2 tablespoons avocado oil or olive oil\n2-3 teaspoons all-purpose spice blend (see note 3)\nyour favorite sauce for serving (see note 4)"
        ],
        "INSTRUCTIONS": [
            "Mix The Batter:In a medium sizemixing bowl, whisk the nutritional yeast, cornstarch, soy sauce, oil, and spices into a batter. It should be fairly loose and runny.",
            "Coat The Tofu:Tear the tofu into chunks and place them directly into the batter bowl. Using a wide spatula, gently toss the tofu in tbe batter until it’s entirely coated.",
            "Air Fry: Air fry at 400 degrees for 8-10 minutes (see Note 5). Stop and give it a shake. And now air fry at 400 again for another 5 minutes until you reach your desired level of golden crispiness!",
            "Sauce and Serve:To serve, toss the tofu your favorite sauce for a recipe (curries! stir fries! rice bowls!) or just pop these guys into some dipping sauce like a little nugget. Incredible."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Baked Tortellini with Sausage",
        "LINK": "https://pinchofyum.com/baked-tortellini-with-sausage",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1 tablespoon avocado or olive oil\n1 lb. ground Italian sausage (I use a mild one for my kids, but spicy would be delicious)\n2-3 carrots, chopped\n2-3 stalks of celery, chopped\n1 yellow onion, minced\n3 large cloves garlic, minced\n1 teaspoon fennel seeds, crushed\none 25-ounce jar of tomato sauce OR a can of San Marzano tomatoes\n10-15 ounces of refrigerated cheese tortellini\n1 1/2 - 2 cups chicken broth\n2 cups baby spinach, torn\n1/2 cup shredded mozzarella cheese\n1/4 cup grated Parmesan\nfinely chopped parsley\nthis garlic bread"
        ],
        "INSTRUCTIONS": [
            "Brown the sausage:Heat a very large oven-safe skillet over medium high heat. Add the oil and the sausage; break apart with a wooden spoon and brown until it’s got some nice color. Transfer to a bowl and drain out any of the oil that you don’t want (I usually drain off about a tablespoon, leaving a tablespoon in the pan).",
            "Sauté the veggies:If you’ve got some browning on the bottom of your pan – great. Add the veggies and they should start to pull up some of that yummy brown flavor. Add the fennel seeds. Cook until the veggies are fragrant and soft – you can add a bit of salt or oil if you’re feeling chefy. Then add the sausage back in.",
            "Add everything else:Add your tomato sauce, your tortellini, and 1 cup of broth. The pan will be full. Let it come to a low simmer and cook for 5 minutes or so to cook the tortellini. If you need more liquid to cook the tortellini, go ahead and add some or all of the remaining broth. Sometimes I just pop a lid on and leave it for a while on low heat.",
            "Spinach and cheese:Give it a taste – if you used canned tomatoes instead of a jar of sauce, it will probably need some salt. Add the spinach and stir it in until it wilts. Top the whole thing with the mozzarella cheese and pop it into the oven at 375 for 8-10 minutes, or until the cheese is nice and melty.",
            "Finish:Sprinkle some grated parm on top along with some chopped parsley, and dunk into that baby with some chunks ofgarlic bread. SO GOOD."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Butter Cauliflower and Chickpeas with Mint Cilantro Sauce",
        "LINK": "https://pinchofyum.com/butter-cauliflower-and-chickpeas-with-mint-cilantro-sauce",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1-2 tablespoons avocado oil\n1 head cauliflower, cut into florets (about 3 cups)\n1 teaspoon each cumin, garam masala, and curry powder\n1/2 teaspoon smoked paprika\n1/2 teaspoon kosher salt\n1 can chickpeas, drained and rinsed\n1 jar of butter chicken sauce (24.5 ounces) or homemade\n1/4 cup packed mint leaves\n1/4 cup packed cilantro\n1/2 cup mayo or plain Greek yogurt\n1 clove garlic\n1 small chunk of jalapeño, optional\n1/2 teaspoon salt\njuice of 1 lime"
        ],
        "INSTRUCTIONS": [
            "Roast the cauliflower:Toss the cauliflower with the avocado oil, cumin, garam masala, curry powder, smoked paprika, and salt. Roast at 425 / 20 minutes in the air fryer, or 425 / 30 minutes in the oven until nice and roasty and golden.",
            "Make the mint sauce:Blitz everything up until it’s nice and smooth. I like to really blend this one so it’s less chunky and more of a smooth green sauce.",
            "Butter sauce time:Add butter sauce and chickpeas to a large skillet. Smash the chickpeas lightly with a potato masher to give a more interesting texture if you want (I do want). Add cauliflower back in.",
            "Serve:Serve the butter cauliflower on rice and top with the mint sauce. Add pickled onions if you want. ENJOY!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Shortcut Sesame Butter Noodles",
        "LINK": "https://pinchofyum.com/shortcut-sesame-butter-noodles",
        "PREP_TIME": "12 minutes",
        "INGREDIENTS": [
            "1 (3.35 ounce) package saucy shortcut noodles - my favorite are the Momofuku spicy soy or soy scallion\n1 tablespoons butter\n1-2 teaspoons honey\n1/2 tablespoon toasted sesame oil (more to taste)\na splash of water\noptional toppings: green onion, sesame seeds, chili crisp, togarashi"
        ],
        "INSTRUCTIONS": [
            "Make the noodles:Cook the noodles according to package directions, including adding in the little sauce packet.",
            "Add the extras:Once prepared, toss hot noodles gently with the butter, honey, and sesame oil. Taste and adjust to however you like it. It should be silky when hot but it will get more sticky the longer you wait – if it’s too sticky, add a bit of warm water to loosen it which will emulsify and make it just a little creamy. It’s perfect.",
            "Finish and serve:Finish with chili crisp, scallions, or some kind of sesame or spicy sprinkle! Ideal little snack, or you can make it more of a rounded out meal by serving with a fried egg and/or a salad. Or ground chicken. Or shrimp. It’s the kind of thing that’s good with everything."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Banza Chicken Bowls with Calabrian Chili Sauce",
        "LINK": "https://pinchofyum.com/banza-chicken-bowls-with-calabrian-chili-sauce",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "1 English cucumber, cut into chunks (about 1 1/2 cups)\n1 pint cherry tomatoes, cut into halves (about 1 1/2 cups)\na small chunk of red onion, thinly sliced on a mandoline\na small bundle of parsley, chopped (about 1/4 cup)\n1 tablespoon white vinegar\n2 tablespoons olive oil\nsalt and freshly ground black pepper to taste\n1/4 cup mayo\n1/4 cup Greek yogurt\n2-3 individual Calabrian chiles, stems discarded, smashed / minced (I use a jarred variety)\n1 clove garlic, grated\na splash of castelvetrano olive brine (optional, see notes)\nsalt to taste\nFor protein, I use a batch of this ridiculously good Air Fryer Chicken(For a vegetarian alternative, this Air Fryer Tofu works beautifully too!)\nFor a carb, I love the Banza Rice Mix for this - it doesn't really make sense but I enjoyed the tomato chipotle variety!"
        ],
        "INSTRUCTIONS": [
            "Tomato Salad:Toss the tomato cucumber salad ingredients together. Taste and adjust! (If you wanted to prep ahead, save the chopped tomatoes, cucumbers, and red onion in separate containers in the fridge with no liquids added until just before serving.)",
            "Sauce:Stir up the sauce ingredients. Taste and adjust! This keeps super well in the fridge for several days.",
            "Chicken and Banza:Make the chicken and the banza (or whatever carb you like).",
            "You’re Done! Yum!Assemble and serve! Gah! So good."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Ridiculously Good Air Fryer Chicken Breast",
        "LINK": "https://pinchofyum.com/ridiculously-good-air-fryer-chicken-breast",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 teaspoon paprika\n1/4 teaspoon smoked paprika\n1/2 teaspoon garlic powder\n1/2 teaspoon onion powder\n3/4 teaspoon salt (I use Morton table salt for this because it's fine and better for coating)\n1 1/2 teaspoons brown sugar\n1 teaspoon cornstarch\n2 teaspoons avocado oil\n1 pound boneless skinless chicken breasts - if you have closer to 1.5 pounds in your package, increase the amount of spices above by 1.5x to make sure you have enough seasoning for your chicken"
        ],
        "INSTRUCTIONS": [
            "Cut the the chicken into thin pieces:Cut each chicken breast into thin, flat pieces (not bite-sized but something that looks like a thin chicken breast). For example: if a one-pound package gives me two chicken breasts, I’m often cutting it into 3-4 thin pieces per breast. Thin chicken is essential! And delicious! Pat the chicken breasts dry if they have a lot of moisture on them.",
            "Coat the chicken with spices:Toss the spices together so they’re mixed well; sprinkle mixture over the chicken pieces in a bowl. Add the oil and toss (I use my hands but tongs will work). You want to thoroughly coat the chicken. You can give it a short rest if you want, but I find that the flavor is excellent even if it just goes straight into the air fryer, and that’s how I usually make it.",
            "Air fry:Preheat the air fryer. Place the chicken on the air fryer basket / grate in an even layer, leaving a bit of space for air to circulate around. Air fry the chicken at 415 degrees for 10 minutes. If you have larger pieces of chicken, you’ll want to go closer to 13 minutes. You’re looking for an internal temperature of 165 degrees.",
            "You’re done! Yum!It should be a gorgeous sight for hungry eyes. Crisped on the outside, full of flavor, and juicy to the max. Let it rest for a moment; then slice into it and enjoy. We often eat at least half of it just hot out of the air fryer while standing over the cutting board. I am on a kick with dunking the chicken pieces in a house-made gochujang dipping sauce which is in the notes below!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Gnocchi with Creamy Mushroom Sauce",
        "LINK": "https://pinchofyum.com/gnocchi-with-creamy-mushroom-sauce",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "2 tablespoons butter\n16 ounces white button or baby bella mushrooms, cut into thin slices\n1/2 teaspoon salt\n3 cloves garlic, thinly sliced\n1 1/2 cups chicken broth (+ an additional 1/4 cup as needed)\n3/4 cup heavy cream\n3 sprigs fresh thyme\n1 tablespoon cornstarch dissolved in 1 tablespoon cold water\n1/4 cup Parmesan cheese\ntwo 16-ounce packages gnocchi, prepared according to package directions (I use DeLallo and I love their mini-size gnocchi for this!)"
        ],
        "INSTRUCTIONS": [
            "Cook the mushrooms and garlic:Melt the butter over medium heat. Add sliced mushrooms; sauté until golden. Once they’re golden, add salt – this will draw out some of the water. Cook the mushrooms down so some of the water can evaporate. Add garlic and sauté for 2-3 minutes, until fragrant.",
            "Make your sauce:Add broth, cream, and thyme. Bring to a simmer and let it cook for 5-10 minutes. Add cornstarch slurry to thicken. (This is a good time to boil your gnocchi if you haven’t already.)",
            "Add your gnocchi: Remove thyme sprigs from the sauce; add Parmesan and stir to melt it in. Add your cooked gnocchi and gently stir to combine. Season with salt and pepper; add additional broth if needed to keep the sauce nice and silky.",
            "You’re done! Yum.Scoop hot, steamy, saucy gnocchi into bowls, top with Parm, salt, and pepper, and enjoy your life."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Easy Instant Pot Applesauce",
        "LINK": "https://pinchofyum.com/easy-instant-pot-applesauce",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "7-8 apples (any kind works! I like Honeycrisp, of course)\n2 cinnamon sticks\n1/2 cup water"
        ],
        "INSTRUCTIONS": [
            "Cut your apples into chunks, discarding the cores. Place apples in the Instant Pot.",
            "Add cinnamon sticks and water; cook on high pressure for 5 minutes.",
            "Let it rest for 10 minutes before releasing the steam. Stick an immersion blender into the Instant Pot and give it a few whizzes, alternating with some gentle mashing, to get the texture that you want.",
            "You’re done! Enjoy your homemade applesauce!"
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Slow Cooker Texas Style Chili",
        "LINK": "https://pinchofyum.com/slow-cooker-texas-style-chili",
        "PREP_TIME": "8 hours 15 minutes",
        "INGREDIENTS": [
            "1-2 tablespoons avocado or vegetable oil\n3\n2 1/2 teaspoons salt (1 teaspoon per pound of meat, more to taste)\n1 yellow onion, finely diced\n5 cloves garlic, minced\n1 tablespoon brown sugar\n1 tablespoon cumin\n1/4 cup chili powder\ntwo 4.5-ounce cans green chiles\none 14-ounce can crushed fire roasted tomatoes\nGreen onions\nSour cream\nCheddar cheese\nChips or cornbread"
        ],
        "INSTRUCTIONS": [
            "Prep everything:Chop, measure, get everything all set up first.",
            "Brown the beef:Heat the oil in a large Dutch oven over high heat. Toss the cut beef chunks with salt. Add the beef to the pot and let it cook, undisturbed, for a few minutes on each side until it gets nice and browned. You may need to do this batches depending on the size of your pan. Remove beef chunks and transfer to the slow cooker.",
            "Saute onions and garlic:Add onions and garlic (and a bit more oil if needed); sauté until golden and softened. This process should lift a lot of yummy browned bits from the bottom of the pan.",
            "Add spices:Add the brown sugar and spices; sauté for 3-5 minutes until nice and fragrant.",
            "Add tomatoes and chiles:Add green chiles and crushed tomatoes; simmer for 3-5 minutes until bubbly and delicious.",
            "Cook low and slow:Pour tomato mixture into the slow cooker over the beef chunks; gently nudge them around so they are surrounded in the sauce. Cook on high for 4-ish hours or low for 8 hours.",
            "Serve:Shred the beef into big tender chunks (you should be able to do this directly in the slow cooker) and season with more salt to taste. Serve with sour cream, cheddar, green onions, and cornbread."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "5 Ingredient Tomato Soup",
        "LINK": "https://pinchofyum.com/5-ingredient-tomato-soup",
        "PREP_TIME": "50 minutes",
        "INGREDIENTS": [
            "two 28-ounce cans San Marzano tomatoes (whole or crushed will work - I usually use whole tomatoes, and we use the DeLallo brand!)\n1 stick (8 tablespoons) salted butter\n1 yellow onion, peel removed and cut into 4 chunks\n3-4 cloves smashed garlic (optional)\n1 1/2 teaspoons salt"
        ],
        "INSTRUCTIONS": [
            "Make the Tomato Soup:Put the tomatoes, butter, and onion in a large saucepan or Dutch oven. Bring it up to a low bubble, then turn the heat to medium low. Cover partially with a lid; let it simmer for 45 minutes. Stir every 15 minutes or so to prevent scorching on the bottom.",
            "Remove Onion Chunks:Remove the onion pieces using tongs. I leave the garlic in there, but that’s up to you!",
            "Blend the Tomato Soup:Using an immersion blender, blend up the soup until it’s a smooth as you want it. Taste and adjust; you can thin it out with milk, water, broth, cream, whatever you want; I just leave it as-is!",
            "Serve:Serve tomato soup with garlic bread, grilled cheese, croutons, crackers, pesto, whatever you like!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "House Favorite Garlic Bread",
        "LINK": "https://pinchofyum.com/house-favorite-garlic-bread",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "half a loaf of French bread or a full loaf of Italian bread\n1 stick (1/2 cup) salted butter, cut into chunks\n1 large clove garlic\n1/4 teaspoon garlic powder\n1/2 cup finely grated Parmesan cheese\n2 tablespoons minced fresh parsley"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 400 degrees. Soften the butter in the microwave in short increments.",
            "Garlic:Grate the garlic directly into the butter.",
            "Parm and Parsley:Add the garlic powder, Parmesan, and parsley; stir to combine. If it’s too runny, just pop it in the fridge for a minute.",
            "Spread the Butter:Cut the bread in half and spread with a thick layer of the butter mixture.",
            "Bake:Bake for 9-10 minutes in the middle of the oven. Add an extra 1-2 minutes if you want for more browning.",
            "Serve!Remove from the oven, cut into slices, and serve. Life is good."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Pumpkin Muffins with Maple Cream Cheese Filling",
        "LINK": "https://pinchofyum.com/pumpkin-muffins-with-maple-cream-cheese-filling",
        "PREP_TIME": "50 minutes",
        "INGREDIENTS": [
            "1/2 cup vegetable oil\n1/2 cup granulated sugar\n1/2 cup packed light brown sugar\n1 1/2 cups pumpkin puree\n1 teaspoon vanilla\n2 eggs\n1/4 cup milk\n1 3/4 cup all-purpose flour\n1 teaspoon baking soda\n1 1/2 teaspoons ground cinnamon\n1/4 teaspoon ground cloves\n3/4 teaspoon salt\n1/2 cup granulated sugar\n1 teaspoon cinnamon\n1 tablespoon unsalted butter, melted\n3/4 cup heavy cream\n8 ounces cream cheese, softened\n1/4 cup maple syrup (to taste)"
        ],
        "INSTRUCTIONS": [
            "Make Muffin Batter:Preheat the oven to 350 degrees. Whisk oil and sugars. Add pumpkin, vanilla, eggs, and milk; whisk until just combined. Add flour, baking soda, spices, and salt; mix until just combined. Pour muffin batter into an oiled or nonstick muffin tin, filling about 3/4ths of the way to the top of each up.",
            "Make Cinnamon Sugar:Mix up the cinnamon sugar topping in a small bowl.",
            "Assemble and Bake:Spoon the cinnamon sugar over each muffin. Bake for 20-24 minutes, or until the tops spring back when gently pressed.",
            "Make Maple Cream Cheese Filling:Add the cream to a small bowl and beat until light and fluffy and stiff peaks form. In a separate bowl, beat the softened cream cheese until smooth. Fold in the whipped cream, using the beaters again to smooth it out if needed. Add the maple syrup and mix until smooth.",
            "Fill The Muffins:Once the muffins have cooled, cut a cone out of the center of the muffins using a small paring knife. Using a piping bag, or a plastic bag with the corner snipped off, add the filling to the center hole in the muffins. Fill it all the way to the top (the filling will be exposed at the top – cute).",
            "Serve:These are ready to eat as-is! If making ahead, they should be stored in the fridge. They can be eaten at room temp or cold – both delicious!"
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Swedish Pancakes",
        "LINK": "https://pinchofyum.com/swedish-pancakes",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "3 eggs\n1 1/2 cups whole milk (+ 1/4 cup - see notes)\n1 cup flour\n3 tablespoons melted butter\n1 tablespoon granulated sugar\n1/2 teaspoon salt\nlingonberry or blueberry jam\nplain yogurt\nwhipped cream (or just straight heavy whipping cream - trust, it's delicious)"
        ],
        "INSTRUCTIONS": [
            "Make Pancake Batter:Blend the eggs and milk until doubled in size, about 30 seconds. Add flour, melted butter, sugar, and salt; blend for another 15-20 seconds until combined.",
            "Pour and Pan Tilt:Preheat a nonstick or well seasoned cast iron pan over medium heat. Pour about 1/4 cup of pancake batter into the pan with one hand, and immediately tilt the pan with the other hand to spread the batter even wider. This will give you a signature thin lacy edge on your pancake.",
            "Cook:Let it sit for about 1 minute or until the pancake is golden brown; use a spatula to pull the edges up and flip the pancake. Cook for another 15-30 seconds on the back side. You can cook to your desired level of doneness; I prefer golden brown on the front side and pale on the back side.",
            "Serve:Serve them flat, folded, or rolled, topped with whatever you like: maple syrup, whipped cream, fruit, jams, etc. I like to fold them and serve with lingonberry jam and yogurt!"
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Roasted Corn and Fried Egg Tacos",
        "LINK": "https://pinchofyum.com/roasted-corn-and-fried-egg-tacos",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "4 eggs\n1 cup melty quesadilla-style cheese\n1 cup frozen roasted corn (see notes)\n3-4 tortillas\n1/2 cup refried black beans\n1/4 cup pickled red onions\n1/4 cup chopped cilantro\n1/4 cup Cotjia cheese\naji verde, zhoug, or salsa verde"
        ],
        "INSTRUCTIONS": [
            "Heat a nonstick or cast iron skillet over medium heat. Add your cheese in a ring shape.",
            "Once it starts to melt a little bit, crack an egg directly into the center.",
            "Spoon a bit of roasted corn around the edge of the egg.",
            "Use a spatula to pull the edges in a bit once the cheese starts to get golden brown; you don’t have to do this, but I find that it helps to contain the egg a bit and expose those golden brown lacy edges.",
            "Cover and let it cook for a minute or two.",
            "When the egg is cooked to your liking (I prefer it with the whites set and the yolk still a bit runny), transfer the egg to tortilla with refried black beans.",
            "Finish with pickled onions, cilantro, Cotija, and your sauce of choice. The crispy cheese edge. The runny yolk. The creamy beans, spicy sauce, tangy onions. Oh my word. YUM."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Chimichurri Shrimp with Tomatoes",
        "LINK": "https://pinchofyum.com/chimichurri-shrimp-with-tomatoes",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1/2 cup olive oil\n2 tablespoons red wine vinegar\n1/2 cup parsley\n1 small chile (I use fresno chiles)\n3-4 cloves garlic\n1 teaspoon dried oregano\n1 teaspoon salt\n1 pound jumbo shrimp, raw\n1/2 cup tzatziki, for serving\n2 cups cherry tomatoes, halved, for serving\nbread or rice for serving"
        ],
        "INSTRUCTIONS": [
            "Chimichurri:Blitz up your sauce in a food processor. It will be somewhat emulsified and it will settle a bit as it rests. If you don’t have a food processor, finely chop everything and mix together in a bowl. Divide the sauce into three bowls: one bowl for tossing with the shrimp, one bowl for brushing while cooking, and one bowl for brushing at the table.",
            "Get That Flavor on Your Shrimp:Thaw shrimp (if frozen) and remove shells and tails (if necessary or desired). Pat dry with paper towels. Toss the shrimp with one third of the chimichurri.",
            "Grill the Skewers:Thread the saucy shrimp onto soaked wood skewers. Transfer to a grill pan, grill, or standard sauté pan over medium high heat. Add the shrimp and cook for 2-3 minutes per side, depending on the size of your shrimp. Brush with additional sauce as you cook. Cook until no longer translucent, or until 145 degrees.",
            "Serving:I like to toss some cherry tomatoes with a spoonful of my reserved chimichurri and then plate it all up: rice, tomatoes, shrimp, and a little side dish of tzatziki just for something extra to dip and dunk."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Creamy Baked Orzo with Meatballs",
        "LINK": "https://pinchofyum.com/creamy-baked-orzo-with-meatballs",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "16 ounces DeLallo orzo\n3 cups vegetable or chicken broth\n2 cups ready-to-serve tomato soup (like this one)\n2-3 cups premade chicken meatballs (store-bought frozen or homemade)\n1 pint cherry tomatoes, halved\n1/2 cup Parmesan cheese\n1 clove garlic\n2 tablespoons butter\nfresh basil for topping\nDeLallo Private Reserve Olive Oil for topping"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 425 degrees. Pour the orzo, vegetable broth, tomato soup, meatballs, and tomatoes into a 9×13 baking dish. Stir to get everything coated and combined.",
            "Bake for 25 minutes. Give it a little stir and check the texture. If needed, bake for another 10 minutes to let the orzo finish absorbing the liquid. Fluff up the orzo with a fork and stir in any remaining liquid that might be bubbling around the edges. This will gently break down the tomatoes and release some of their juices as well. (As the orzo sits, it will continue to absorb liquid so add more tomato soup or broth as desired.)",
            "Add the Parmesan, garlic, and butter; stir to melt it in. Top with fresh basil leaves, olive oil, salt, and pepper."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Kale Apple Salad with Crispy Shallots",
        "LINK": "https://pinchofyum.com/kale-apple-salad-crispy-shallots",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "4 cups kale, chopped finely through a food processor (optional)\n2 cups brussels sprouts, finely shredded with a mandoline\n4 shallots, thinly sliced\n1/4-1/3 cup vegetable oil\n1-2 large honeycrisp apples\n1 cup rosemary cashews, roughly chopped (I bought the Planter's Rosemary Sea Salt cashews from Target)\n1 block garlic bread cheese, cubed (I get mine at Trader Joe's, but halloumi would work as a substitute)\nSalad Girl Crisp Apple Maple dressing (or dressing of choice, or homemade)"
        ],
        "INSTRUCTIONS": [
            "Chop stuff:Shred up your kale and brussels. You can keep these in containers in the fridge to assemble salads throughout the week! Chop your nuts and apples and set aside. (Toss the apples with a few drops of lemon juice if you don’t want them to brown.)",
            "Make your shallots:Fry the shallots in a bit of oil in a skillet until golden and crispy, or fry them in the microwave using the method in the notes section.",
            "Fry the bread cheese:Cube and fry the cheese in a nonstick over medium heat until golden brown and delicious.",
            "Assemble:Toss kale, brussels, apples, cashews, shallots, cheese, and dressing together. Salad happiness! Enjoy!"
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Chicken Wontons in Spicy Chili Sauce",
        "LINK": "https://pinchofyum.com/chicken-wontons-in-spicy-chili-sauce",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3 tablespoons sesame oil, divided\n14 ounces shiitake mushrooms, sliced\n1 clove garlic, grated\none 12-ounce bag frozen wontons (I like the mini chicken cilantro ones from Trader Joe's or Costco)\n1-2 cups chicken broth (depending on how soupy you like it)\n1/2 cup teriyaki sauce\n1-2 tablespoons chili crisp\ngreen onions, sliced\nsesame seeds"
        ],
        "INSTRUCTIONS": [
            "Heat 1 tablespoon sesame oil in a large nonstick skillet over medium heat. Add mushrooms; sauté until softened and yummy. Add garlic for the last minute or two of sautéing.",
            "Add the frozen wontons, chicken broth, and teriyaki sauce. Simmer for 5 minutes, with a lid on, until the wontons are heated through.",
            "Finish with remaining 2 tablespoons sesame oil, chili crisp, and top with sesame seeds and scallions."
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Feel-Good Zucchini Muffins",
        "LINK": "https://pinchofyum.com/feel-good-zucchini-muffins",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "2 cups rolled oats\n8 medjool dates, pitted (about 3/4 cup)\n1/2 cup olive oil\n1/4 cup real maple syrup\n1-2 zucchini, grated (about 2 cups total)\n2 eggs\n1 teaspoon baking soda\npinch of sea salt and/or cinnamon (optional)\nchocolate chips (optional, for topping)"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 350 degrees.",
            "Mix all ingredients in a blender until a chunky batter comes together.",
            "Pour batter into a greased or lined muffin tin. Sprinkle with chocolate chips. Bake for 15-18 minutes, until the tops gently spring back when you press into them.",
            "Sprinkle warm muffins with sea salt if you’re into that kinda thing. Serve warm or cold ALL DAY LONG. ♡"
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Pumpkin Caramel Monkey Bread",
        "LINK": "https://pinchofyum.com/pumpkin-caramel-monkey-bread",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "6 tablespoons unsalted butter\n1 cup loosely packed brown sugar\n1/2 cup heavy cream\n1/2 cup canned pumpkin puree (unsweetened)\n1 teaspoon vanilla\na good pinch of kosher salt, to taste\none 16-ounce can refrigerated buttermilk biscuits\n1/2 teaspoon cinnamon\n1 tablespoon granulated sugar\n1/2 cup white chocolate chips\n1 tablespoon coconut oil"
        ],
        "INSTRUCTIONS": [
            "Make the Caramel:Melt butter in a small saucepan. Add brown sugar, heavy cream, pumpkin, vanilla, and salt. Whisk until smooth. Bring to a low simmer and let it bubble gently until it’s incorporated and slightly thickened, 3-5 minutes (you don’t want to overcook it or it will get too thick). Remove from heat.",
            "Prep the Dough:Preheat the oven to 350 degrees. Cut the biscuits into 6 even pieces (half, then into thirds). Toss the biscuit pieces with cinnamon and sugar. Transfer to a round 9-inch cake pan or baking dish.",
            "Assemble:Pour most of the pumpkin caramel over the biscuits until mostly covered. Set aside the remaining 1/4 to 1/2 cup caramel for topping.",
            "Bake:Bake for 20 minutes. Remove from the oven, let rest for just 2-3 minutes and then invert onto a serving plate.",
            "Optional Topping:Melt the white chocolate and coconut oil in the microwave in 15 second increments, stirring in between. Once melted, drizzle over the monkey bread. Drizzle with reserved pumpkin caramel (optional). Serve warm."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "English Muffin Baklava",
        "LINK": "https://pinchofyum.com/english-muffin-baklava",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1/3 cup walnuts\n1/3 cup pistachios\n1/4 cup (4 tablespoons) butter, softened or melted\n2 tablespoons brown sugar\nEnglish muffins\nHoney\nMascarpone cheese"
        ],
        "INSTRUCTIONS": [
            "Preheat the broiler – I use the “Low Broil” setting but every oven will be different for which setting works best.",
            "Pulse the nuts in a food processor until finely chopped. Set aside a few spoonfuls of the nuts for topping. Mix the remaining nuts, butter, and brown sugar together in a small bowl.",
            "Toast the English muffins on a baking sheet lined with foil until toasty – about 3 minutes.",
            "Spread English muffins with the nutty butter mixture. Return to the oven, a few inches away from the broiler, for 1 minute or until bubbly and slightly caramelized.",
            "Top with a little baby dollop of mascarpone cheese and give it a gentle swoop to melt it in. Finish with extra nuts and honey. Pour yourself a cup of coffee to go with it. OMG, it’s so good!"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Roasted Peanut Kale Crunch Salad",
        "LINK": "https://pinchofyum.com/roasted-peanut-kale-crunch-salad",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "4 large stalks kale, stems removed\nhalf a head of green cabbage\n2 small fresno peppers, sliced\n1 cup peanuts, chopped\n1/2 cup chopped cilantro\n1/2 cup chopped green onions\n1/2 cup roasted peanut oil\n2 tablespoons rice vinegar\n1 clove garlic\n2 1/2 tablespoons sugar\n1 teaspoon coarse kosher salt (more to taste)\nfreshly ground black pepper"
        ],
        "INSTRUCTIONS": [
            "Make the Roasted Peanut Vinaigrette:Blend all ingredients in a small blender or food processor until smooth. (This is mostly to incorporate the garlic, so if you’d rather, you can grate the garlic into the jar with the other ingredients and shake thoroughly to combine.)",
            "Prep the Salad:Chop your herbs, peanuts, and fresno peppers.",
            "Chop the Kale and Cabbage:Using a food processor, pulse the kale and cabbage in batches until it is very finely chopped, stopping before the greens get too mushy. If they release too much water, just give them a gentle squeeze with a paper towel. Transfer to a large bowl.",
            "Mix and Serve:Toss your kale and cabbage with some of the dressing; massage it together with your hands for a minute to make sure the kale is tender! Add peanuts, peppers, and the rest of the dressing. YUM!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Aji Verde",
        "LINK": "https://pinchofyum.com/aji-verde",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "2 tablespoons olive oil\n1/2 cup mayo\n3 ounces (a little chunk) queso fresco\n1 jalapeño pepper (for a mild sauce, remove the ribs and seeds - you can also use a serrano pepper)\n1 cup cilantro\n2 cloves of garlic\njuice of 1 lime\na pinch of salt, to taste"
        ],
        "INSTRUCTIONS": [
            "Blend all ingredients in a food processor or blender until smooth-ish. I like to go until it smoothly drips off a spoon – no more chunks but just a little bit of texture to it.",
            "You’re done! Serve with grilled meats and veggies, tacos, salads, bowls, or just dip into it with some chips. It’s incredible."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "My Go-To Pickled Red Onions",
        "LINK": "https://pinchofyum.com/my-go-to-pickled-red-onions",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "1 red onion, peeled and cut into several chunks (see photos above)\nRoughly 1/3 cup white vinegar\nRoughly 2/3 cup water\n1/2 teaspoon coarse kosher salt\n1/2 teaspoon sugar"
        ],
        "INSTRUCTIONS": [
            "Thinly slice your chunks of onion into C-shapes using a mandoline on the thinnest setting. (This is what I prefer – if you want the onions more chunky, adjust as needed.)",
            "Place the onions in a jar and add vinegar – I just eyeball it until the jar is about one third of the way full.",
            "Fill the rest of the jar with water. Add salt and sugar; shake a few times to combine.",
            "Let them rest in the fridge for 30 minutes to 1 hour – then they’re ready to use! They can stay in the fridge up to 5-7 days."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Gochujang Chicken Burgers with Kimchi Bacon Jam",
        "LINK": "https://pinchofyum.com/gochujang-chicken-burgers-with-kimchi-bacon-jam",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 lb. ground chicken\n1/2 cup panko breadcrumbs\n2 tablespoons gochujang sauce (I use this one)\n1/2 teaspoon garlic powder\n1 teaspoon coarse kosher salt\navocado oil or olive oil for frying\n6 slices bacon, cut into small pieces\n1 1/2 cups kimchi, cut into small shreddy pieces (my personal preference for texture!)\n2 tablespoons brown sugar\nBuns\nCheese (optional - I use gouda cheese)\nCilantro or greens\nMayo\nCucumber slices"
        ],
        "INSTRUCTIONS": [
            "Kimchi Bacon Jam:In a large skillet over medium heat, add the bacon pieces. Fry until golden and crispy and fat has rendered. Drain off some of the oil (optional) and add the kimchi and brown sugar to the pan. Sauté for 3-5 minutes until caramelized and bubbly.",
            "Chicken Burgers:Mix the chicken, panko, gochujang, garlic powder, and salt until well-combined. Form into 4-5 burger patties.",
            "Make the Burgers:Transfer burgers to a large skillet. Add a swish of avocado oil and pan-fry until golden on the exterior and 165 degrees on the interior.",
            "Assemble the Burgers:Toast your buns on the skillet; serve burgers on toasted buns with a layer of kimchi bacon jam, greens of choice, and mayo. So, s0 good."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Grilled Chicken with Pepperoncini Garlic Butter",
        "LINK": "https://pinchofyum.com/grilled-chicken-with-pepperoncini-garlic-butter",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "1 teaspoon garlic powder\n1 teaspoon onion powder\n1 teaspoon paprika\n1 teaspoon coarse kosher salt\n1 lb. chicken breasts\n1 tablespoon olive oil\n6 tablespoons butter\n1 clove garlic, minced\n1/4 cup pepperoncini brine\n1/4 to 1/2 cup pepperoncinis, chopped\n1 pint cherry or grape tomatoes, halved\nhalf a cucumber, chopped\na quarter of a red onion, minced or thinly sliced\nsalt and pepper, olive oil, vinegar\nChives\nFeta\nHummus\nPita Bread"
        ],
        "INSTRUCTIONS": [
            "Marinate the Chicken:Place the chicken, spices, and olive oil together in a large bowl or plastic bag. Mix until well-coated; set aside in the fridge while you prep the other elements (30 minutes up to several hours).",
            "Make the Cucumber Salad:Toss veggies with a small amount of salt, pepper, olive oil, and vinegar. (If you add too much it becomes watery, so use a light hand!)",
            "Make the Pepperoncini Butter Sauce:Melt the butter (I just do this in the microwave). Stir in the garlic, brine, and pepperoncini pieces. Set aside.",
            "Grill the Chicken:Using a grill, grill pan, or skillet, cook the chicken until cooked through and golden brown on both sides. If you have a meat thermometer, I highly recommend using it so you don’t overcook the chicken! We’re looking for 160 degrees. Let it rest for a moment, then cut into slices.",
            "Assemble:If you want to serve it as a family-style meal – layer the hummus on a large platter. Add the cucumber salad in 3-4 little mounds around the outside of the plate. Add the chicken right in the middle and drizzle with the pepperoncini butter sauce. Add feta, chives, and s&p to finish. Scoop onto plates or dip into the whole thing with pita bread. SO good!"
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Blueberry Matcha Latte",
        "LINK": "https://pinchofyum.com/blueberry-matcha-latte",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "1-2 tablespoons matcha of choice - I really like the Jade Leaf matcha latte mix (affiliate link) which is made with matcha and sugar, so it's already a bit sweet and tastes like a coffee shop matcha latte right from the get-go, but unsweetened matcha will also work great, especially if you'd like it less sweet\n1/4 cup hot water\n1/2 to 3/4 cup oat milk\n1 1/2 cups frozen blueberries\n1/3 cup sugar\n3 tablespoons warm water"
        ],
        "INSTRUCTIONS": [
            "For the blueberry syrup:A few hours ahead of time, place the blueberries in a large jar, and cover with the sugar and the water. Place the jar in the fridge and let it rest for 4-6 hours or overnight to let the sugar draw some of the juices out of the blueberries. When it’s done resting, give it a good stir and add a bit more water if you want it less sweet. (For a faster option, you can muddle the blueberries after they thaw to speed up this process, or just melt them down in the microwave and use the purple blueberry juices that run off the thawed blueberries.) We’re just looking for some rich purple blueberry “syrup” here – nothing too fancy!",
            "For the matcha:Heat the water in a small jar with a lid. Add the matcha powder, cover, and shake until smooth.",
            "Add the milk:Fill a large glass with ice. Pour the matcha over the ice, and then add the oat milk. If you want to preserve distinct color layers for Instagramability, pour the oat milk over the back of a spoon.",
            "Finish with blueberry syrup:Finally, pour a tablespoon or two of the blueberry syrup into the glass and watch it sink to the bottom (more or less to taste, but I find this is a good amount to get the blueberry flavor in there without making it too sweet). Those green and purple layers are so pretty! Stir it up just before serving to get the blueberry flavor in each sip!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Very Incredible Basil Sauce",
        "LINK": "https://pinchofyum.com/very-incredible-basil-sauce",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1/2 cup packed fresh basil\n1 small bunch of fresh chives (can sub green onions)\n1 teaspoon dried oregano (optional, but very good)\n1 clove garlic\n1/2 cup mayo (more as needed to keep it creamy)\n1/4 cup grated Parmesan cheese\n1-2 tablespoons lemon juice\npinch of salt, to taste (add this at the end, after you taste it so you can see if you actually want it or not - I always do, but I love salt!)"
        ],
        "INSTRUCTIONS": [
            "Place all your sauce ingredients in a blender or food processor. (I use this mini chopper for the vast majority of my sauces because it’s nice and compact!)",
            "Blend until you get your desired consistency – I usually go for an almost-completely-smooth texture that is flecked with small bits of herbs."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Trader Joe’s Sun-Dried Tomato Focaccia Turkey Sandwich",
        "LINK": "https://pinchofyum.com/trader-joes-sun-dried-tomato-focaccia-turkey-sandwich",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 loaf of Trader Joe's sun-dried tomato focaccia\none 7-ounce package deli turkey\n1 large tomato, thinly sliced\none handful of greens - sprouts, microgreens, spinach, etc.\na few pieces of thinly sliced red onion\n1/4 cup mayo\n1/4 cup pesto (I like the Costco brand pesto)"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 400 degrees. Toast the focaccia in the oven for 5-8 minutes.",
            "Mix the pesto and the mayo together in a small bowl to make a pesto mayo.",
            "Keeping the bread flat on a cutting board, turn your serrated knife sideways and slice horizontally through the center of the loaf. (You don’t want to flip the top and lose those yummy crumbles.) Keeping the top piece flat, set it aside.",
            "Layer the sandwich with pesto mayo, turkey, tomato, greens, red onion, and finish with dollops of pesto mayo. I dollop the top layer of pesto mayo directly on top of the greens and onions so that I don’t have to flip my top piece upside down to spread it on the bread.",
            "Gently press your top piece back on top of the sandwich. When it’s nice and secure, use a large knife to cut through the sandwich. I usually cut it down the middle and across 3 times for a total of 6 pieces. Serve and enjoy! This is sandwich goals."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Garlic Shrimp and Tomatoes with Parmesan Orzo",
        "LINK": "https://pinchofyum.com/garlic-shrimp-and-tomatoes-on-parmesan-orzo",
        "PREP_TIME": "50 minutes",
        "INGREDIENTS": [
            "1 lb. cherry tomatoes\n1-2 tablespoons olive oil\n1 lb. shrimp - I use jumbo shrimp, peeled and deveined, tails off\n2 tablespoons butter\n3 cloves garlic, sliced thinly\n1 teaspoon coarse kosher salt\n8 ounces uncooked orzo\n1/2 cup half and half\n1/4 cup grated Parmesan\n2 tablespoons butter\n1/2 teaspoon coarse kosher salt\nlemon juice (optional)"
        ],
        "INSTRUCTIONS": [
            "Cook the Orzo:Cook according to package directions. Drain, toss with a bit of oil, and set aside.",
            "Soften the Tomatoes:Add the tomatoes and olive oil to a pan over medium high heat so they can soften and get a bit blistered on the outside. I usually cover the pan to avoid extra splatters.",
            "Smash the Tomatoes:Once they’re soft (5 minutes or so), give them a gentle smash with the back of a spoon or applying even pressure with a plate or similar flat object. You want the tomatoes to be partially burst / smashed so they release some juices.",
            "Cook the Shrimp:Make a little clearing in the center of the tomatoes and add your shrimp right in; season them with 1/2 teaspoon salt and cook for 2 minutes on each side.",
            "Give it Some Flava-Flave:Add the garlic, butter, and 1/2 teaspoon salt to the pan and stir to mix it all together. Let it get saucy and bubbly; then remove from heat and cover with a lid.",
            "Make the orzo:Mix the orzo with butter, half and half, Parmesan, and lemon. Stir to combine; warm it up over the heat if necessary.",
            "Pile it up:Serve immediately so the orzo doesn’t get too starchy and sticky! Pile it on a plate with a big scoop of steamy shrimp and tomatoes. Top with thyme. So good!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Salmon with Basil Sauce and Tomato Salad",
        "LINK": "https://pinchofyum.com/salmon-with-basil-sauce-and-tomato-salad",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1 teaspoon paprika\n1/2 teaspoon garlic powder\n1/2 teaspoon onion powder\n1/2 teaspoon coarse kosher salt\n1 teaspoon granulated sugar\n1 tablespoon olive oil\n1 lb. salmon filet, cut into 2-3 pieces\n1/2 cup packed fresh basil\n1 small bunch of fresh chives\n1 teaspoon dried oregano, optional\n1 clove garlic\n1/2 cup mayo (more as needed to keep it creamy)\n1/4 cup grated Parmesan cheese\n1-2 tablespoons lemon juice\nsmall pinch of salt, to taste\n1 1/2 cup halved cherry tomatoes\n2 ear sweet corn, cut off the cob\n1-2 cups fresh spinach or spring greens\n1 tablespoon olive oil\n2 tablespoons minced chives or parsley\nsalt, pepper, and garlic powder to taste\n2 cups cooked rice or grains for serving (I use precooked to make it easy)"
        ],
        "INSTRUCTIONS": [
            "Prep:Prep the tomato salad.",
            "Make the basil sauce:Blend the basil sauce ingredients until almost completely smooth, with just a few flecks remaining.",
            "Prep the salmon:Preheat the oven to 425 degrees. Mix the spices in a small bowl and stir in the olive oil. Coat the salmon with the spice paste.",
            "Bake the salmon:Bake on a parchment-lined baking sheet for 9-12 minutes, or until 135 degrees in the thickest part. (It’s all personal preference, but this is the doneness that we like best – it’s a medium-well done salmon.)",
            "Assemble the meal:Plate the salmon over the rice, serve with salad, and spoon the sauce over the top. Season with salt and pepp. Mwah!"
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Chicken Teriyaki Burgers with Sesame Slaw",
        "LINK": "https://pinchofyum.com/chicken-teriyaki-burgers",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. ground chicken\n1/4 cup teriyaki sauce\n1/2 cup panko breadcrumbs\n1/2 teaspoon garlic powder\n1/2 teaspoon salt\n2 cups shredded cabbage\n1 tablespoon toasted sesame oil\n1 tablespoon rice vinegar\n1 teaspoon sugar\n1/2 teaspoon salt\n1/4 cup chopped green onions (optional)\n2 tablespoons avocado oil for frying\n4 brioche buns\n1/4 cup yum yum sauce (or mayo, sriracha, chili crisp, whatever sauce you like)"
        ],
        "INSTRUCTIONS": [
            "Make the Sesame Slaw:Toss the slaw ingredients together. Taste and adjust.",
            "Make the Burgers:Combine chicken, teriyaki sauce, panko, salt, and garlic powder in a large bowl. Mix with your (clean) hands until well-combined. Form into 4 large patties.",
            "Fry the Burgers:Heat a bit of avocado oil over medium heat. Add the burgers to the hot pan and cook for 3-5 minutes until golden and mostly cooked through; flip to finish for another 2-3 minutes. Cook until no longer pink in the middle, or a meat thermometer registers at least 165 degrees Farenheit.",
            "Toast Buns:Wipe out the skillet if there are burned bits left in the pan. Pop your buns into the skillet for just a second, cut side down over medium low heat, to get them lightly toasted.",
            "Assemble Burgers:Spread top and bottom buns with yum yum sauce, place a burger, and top with the sesame slaw. Press burgers together, slice into it, and enjoy your life. I love these so much."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Kimchi Tuna Salad Wrap",
        "LINK": "https://pinchofyum.com/kimchi-tuna-salad-wrap",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "one 5-ounce can tuna, drained and flaked\n1/2 cup Korean-style kimchi, liquid drained and cut up into smaller pieces (optional)\n1/4 cup kewpie mayo (regular mayo works, too)\n1/2 teaspoon sesame oil\n1/2 teaspoon brown sugar\n1/4 teaspoon salt\n1/4 teaspoon ginger paste\nsesame seeds or furikake for topping\n1 mashed avocado\n1 small cucumber, diced or sliced\n1-2 teaspoons chili crisp (I like the Momofoku brand - affiliate link)\n2 whole grain wraps (I like Joseph's brand or Angelic Bakery)"
        ],
        "INSTRUCTIONS": [
            "Make the Tuna Salad:Mix tuna, kimchi, and mayo. Add any of the extra mix-ins you like for flavor. DONESO!",
            "Make the Wrap:Serve room temp or chilled. Spread the wrap with the avocado, throw the cucumber on top, and drizzle with chili crisp. So good!"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Chili Crunch Tofu",
        "LINK": "https://pinchofyum.com/chili-crunch-tofu",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 block extra firm tofu\n2 tablespoons cornstarch\n1 tablespoon soy sauce\n1 tablespoon olive oil\na pinch of salt\n1/4 cup Yum Yum sauce (affiliate link)\n1 tablespoon chili crisp (affiliate link)\n1 tablespoon honey (optional)\n1 1/2 cups rice, uncooked (see notes for the cauli rice I like to make!)\n1/4 cup green onions for topping"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 425 degrees. Line a baking sheet with parchment paper.",
            "Prepping the Tofu:Cut tofu in half so you have two even, flat pieces. Press the moisture out of the tofu, using paper towels or a towel. (The more water you remove, the faster it will crisp up in the oven, but I usually don’t spend more than 5-10 minutes here.) Cut tofu into cubes and transfer to a bowl. Add cornstarch, soy sauce, and olive oil. Toss gently to coat. It doesn’t have to be perfectly smooth, but just try to generally get all the pieces semi-covered.",
            "Prepare Rice:Cook rice according to package instructions.",
            "Bake the Tofu:Transfer to the baking sheet and roast for 20-25 minutes, stirring once or twice, to get the tofu evenly browned and crispy.",
            "Make the Sauce:Mix Yum Yum sauce and chili crisp in a small bowl.",
            "Mix Tofu and Sauce:When the tofu is done, toss it with several tablespoons of sauce, reserving sauce for topping.",
            "Serve:Serve with rice, on a salad, noodles, whatever you like. Dollop with extra sauce if you want, and top with green onions. OOO-eee this is good!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "A Really Good Non-Alcoholic Margarita",
        "LINK": "https://pinchofyum.com/a-really-good-non-alcoholic-margarita",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1.5 ounces lime juice (about 3-4 limes)\n2 ounces jalapeño cilantro simple syrup\ntonic water to taste (see notes for subs, especially during pregnancy)\n2 cups water\n2 cups granulated sugar\n1 small bunch cilantro (leaves and/or stems)\n1 jalapeño, sliced into chunks\n1 teaspoon Tajin (affiliate link)\n1/2 teaspoon coarse salt\n1 teaspoon sugar"
        ],
        "INSTRUCTIONS": [
            "To make the simple syrup:Bring the sugar, water, cilantro, and jalapeño to a low simmer in a small saucepan for about 5 minutes. You want the sugar to dissolve and some of the flavor of the cilantro and jalapeño to steep into the liquid. Strain out the cilantro and jalapeño, and reserve the syrup in a jar or small pitcher in the fridge for several weeks. Ilovehaving this on hand to throw fast, fun, easy drinks together!",
            "For the Tajin rim:Mix the sugar, salt, and Tajin on a small plate. Brush a bit of lime juice or simple syrup on the side or rim of the glass and immediately dip it into the Tajin mixture so it sticks to the side or rim of the glass. Beautiful!",
            "To make the NA margaritas:Throw a few ice cubes in the glass. For each marg, I typically use 1.5 ounces lime juice, 2 ounces simple syrup, and tonic water to taste. You can also use a shaker here to mix, or just pour it all into the glass and give it a gentle swish to stir. ENJOY YOUR MOMENT."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Avocado Mojo Bowls with Sweet Potato and Chicken",
        "LINK": "https://pinchofyum.com/avocado-mojo-bowls-with-sweet-potato-and-chicken",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1/3 cup avocado oil\nhalf an avocado\n1/4 cup orange juice\n1 tablespoon white vinegar\n1 clove garlic\n1/4 cup packed cilantro, leaves and stems\n1/2 teaspoon coarse kosher salt\n1/4 cup mayo (optional - this will make it creamier)\n2 sweet potatoes\n1 red onion\n2 tablespoons avocado oil\n2 tablespoons taco seasoning + a pinch of smoked paprika if you want\nprotein of choice - I like the Amylu chicken meatballs or a hot, roasty rotisserie chicken"
        ],
        "INSTRUCTIONS": [
            "SweetPotatoes:Preheat the oven to 425 degrees. Peel and cut the sweet potatoes – I like to cut them into wedges because they feel like thick, happy fries and my family loves them, but any shape will work. Place on a large baking sheet and toss with the oil and taco seasoning until coated.",
            "Onions:Peel the onion and cut it into thin wedges. Tuck them onto the baking sheet in and around the sweet potatoes.",
            "Roast:Transfer the whole pan to the oven and bake for a total of 35 minutes. I usually take them out at 20 minutes to flip the pieces and add my meatballs.*If using store bought pre-cooked meatballs, you can just scoot everything over and add your meatballs so they get those last 15 minutes of bake time.",
            "Sauce:While the sweet potatoes are roasting, blend up the sauce ingredients – I use myNinja mini chopper(affiliate link). Taste, adjust, and set aside. (Or at least try. It’s so good.)",
            "Serve:Pour some sauce on a plate or bowl. Pile it up with meatballs, sweet potatoes, and onions. Total comfort food with saucy dipping built right in!"
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Pickled Strawberries",
        "LINK": "https://pinchofyum.com/pickled-strawberries",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 1/2 cups halved strawberries (enough to fill a jar)\n1/3 cup white balsamic vinegar\n1 tablespoon sugar\npinch of salt\n1 tablespoon peppercorns\nwater to fill the rest of the jar\n6-7 slices sourdough\none or two 4-ounce packages goat cheese\nsome thyme leaves\na honey drizzle\npinch of salt"
        ],
        "INSTRUCTIONS": [
            "Pickled Strawberries:Place the strawberries in a jar. Add the vinegar, sugar, peppercorns, and salt. Fill to the top with water. Secure the lid and shake gently to combine.",
            "Wait Time:Place in the refrigerator for 2 hours, or up to 2 days. (I prefer these within the first 12-24 hours so they don’t get too mushy.)",
            "For Serving:Fry or grill the bread. I fry a few slices at a time in olive oil on my griddle until nice and golden and crispy. Smear the goat cheese on the toast and top with a few strawberries. Smash them gently with a fork. Sprinkle with bits of thyme, a drizzle of honey, and a hit of salt. Mwah!"
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Salmon Tacos with Mango Corn Salsa",
        "LINK": "https://pinchofyum.com/salmon-tacos",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. salmon fillet (see notes)\n2-3 teaspoons taco seasoning\n2 teaspoons avocado oil\n1 large mango, diced\n1 cucumber, diced\n2 ears sweet corn, kernels cut off the cob\n1/4 cup finely chopped red onion\n1/2 cup finely chopped cilantro\n1 tablespoon honey\nzest and juice of 1 lime\n1/2 teaspoon salt\none 14-ounce can refried beans, or regular black beans, or 2 avocados\n8 corn tortillas\n1/4 cup avocado oil for softening"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 425 degrees. Line a baking sheet with parchment paper.",
            "Season the Salmon:Toss the salmon with the taco seasoning and avocado oil until well-coated – you can do this in a bowl or directly on the baking sheet. If your taco seasoning does not have salt, add some salt to the salmon.",
            "Bake the Salmon:Bake the salmon for 8 minutes, close to the top of the oven, or until it slips apart easily when pressed with a fork.",
            "Make the Salsa:While the salmon is baking, chop up your salsa ingredients and toss together in a bowl. Season to taste.",
            "Soften the Tortillas:To soften the corn tortillas, I usually heat up some oil in a large skillet and then give the tortilla a very quick one-sided dip into the hot oil and transfer to a paper-towel lined plate. I stack them up as I go so the heat and oil kind of distributes between all the tortillas. You can also wrap the tortillas in a few damp paper towels and microwave for 30 seconds to steam them so they become more pliable and yummy to eat.",
            "Assemble the Tacos:Mash avocado or spread refried beans on the bottom of the tortilla. Add a couple pieces of salmon; press to gently smash them. Top with a big scoop of the salsa. I often finish these with lime squeezes and a drizzle of honey!"
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Chili Garlic Pappardelle with Smashed Broccoli and Soft Eggs",
        "LINK": "https://pinchofyum.com/chili-garlic-pappardelle-with-smashed-broccoli-and-soft-eggs",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "8 ounces DeLallo Egg Pappardelle\n4 tablespoons butter\n1 clove garlic, minced\n3 tablespoons hoisin sauce\n1 tablespoon honey\n1 tablespoon chili crisp (more to taste)\n1 tablespoon white miso\n1/2 cup reserved cooking water\nfreshly ground black pepper\n1 tablespoon chili crisp (optional for topping)\n1 head of broccoli, cut into florets (about 4 cups)\n1 tablespoon DeLallo Private Reserve Extra Virgin Olive Oil\n1/2 teaspoon salt\n4 eggs"
        ],
        "INSTRUCTIONS": [
            "Broccoli:Preheat the oven to 425 degrees. Arrange the broccoli on a sheet pan; drizzle with olive oil and sprinkle with salt. Roast for 20-25 minutes until softened and roasty. Smash each piece of broccoli with the back of a wooden spoon to create flat little crispy bites – transfer back to the oven and roast for another 5-10 minutes. If you have an air fryer, you could makethis recipefor the broccoli.",
            "Eggs:I usethis egg cooker(affiliate link)and fill the water line to “medium.” I let the eggs rest in cold water for about 5 minutes when they’re done cooking. You can also just use a normal pot on the stove to make a 6-minute egg.Here’s more on that.",
            "Pasta:Cook pappardelle according to package directions.",
            "Sauce:Melt butter in a large skillet over medium heat. Add garlic; cook until soft and fragrant. Add hoisin, honey, chili oil, and miso; whisk until mostly incorporated (it’ll be a little chunky from the miso but it’ll smooth out). Add reserved pasta water and let it come to a gentle simmer; add pasta and continue to cook for 3-5 minutes until the sauce is coating all of the bits of pasta.",
            "EAT!Half the time I just end up eating these noodles over the stove in all their slippery, spicy goodness. But if you can manage, get the smashed broccoli and soft egg served up on top of a bowl of noodles, with an extra dollop of chili crisp over the eggs, and that is one beautiful meal."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Steph’s Chickpea Curry with Spinach and Rice",
        "LINK": "https://pinchofyum.com/chickpea-curry",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 tablespoon avocado oil\n2 cloves garlic, minced\n1 tablespoon brown sugar (more to taste)\n1 1/2 tablespoons red curry paste (currently loving Maesri or Thai Kitchen brand)\none 14-ounce can full fat coconut milk\n1 1/2 tablespoons soy sauce\none 14-ounce can chickpeas, drained and rinsed\n2-3 cups fresh spinach, chopped\n1/2 cup cilantro, chopped\n1 1/2 cups jasmine rice, uncooked"
        ],
        "INSTRUCTIONS": [
            "Cook rice according to package directions.",
            "Heat the avocado oil over medium heat. Add the garlic and curry paste; sauté until softened and fragrant, about 1-2 minutes.",
            "Add the brown sugar, coconut milk, and soy sauce. Bring to a low simmer until thickened slightly.",
            "Add chickpeas, spinach, and cilantro; cook until chickpeas are heated through and spinach is wilted. Mash the chickpeas ever so slightly with the back of a wooden spoon if you want to change up the texture and make it more creamy.",
            "Taste and adjust to your liking – we often add a squeeze of lime or some extra ginger or lemongrass, but it’s really not necessary. The flavor is totally there even with the most basic ingredient list. Serve over rice with a dollop ofchili crisp(affiliate link)and a side of pickled cucumber salad if you want (and I promise you do want this – see notes). Top with more cilantro, if you want!"
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Miso Crunch Salad",
        "LINK": "https://pinchofyum.com/miso-crunch-salad",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1/3 cup avocado oil\n1/3 cup lime juice (4-6 limes)\n1/4 cup white miso\n1/4 cup sugar\n2 cloves garlic, minced\n1/2 teaspoon salt\n1 lb. cooked shrimp, cut into bite-sized pieces\n5 cups shredded Tuscan kale\n5 cups shredded green cabbage\n1 cup chili-flavored peanuts (or something similar)\n2 avocados\n1/2 cup sliced green onions\n1/2 cup chopped cilantro"
        ],
        "INSTRUCTIONS": [
            "Shake all dressing ingredients in a jar, or blend together in asmall food processor(affiliate link)until smooth. If it’s on the thicker side, add a bit of water until it pours smoothly off the end of a spoon.",
            "Toss all salad ingredients with dressing! You can do this as a large batch (serves 4-6) or prep the elements and store them separately to make the salads one at a time for individual lunches and dinners throughout the week, which is what I usually do! Crunchy, sweet, delicate, and fresh!"
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Red Chile Tostadas with Eggs",
        "LINK": "https://pinchofyum.com/red-chile-tostadas-with-eggs",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "6 corn tortillas\n1/4 to 1/2 cup avocado oil or vegetable oil for frying\none 14-ounce can refried beans\n1 cup red enchilada sauce (I've been loving this Siete Foods Red Enchilada Sauce lately!)\n1/2 cup shredded cheddar cheese\n6 eggs\n2 tablespoons cilantro\n1 avocado\nPickled red onions"
        ],
        "INSTRUCTIONS": [
            "Make the Pickled Onions (optional):Slice a red onion very thinly (I use a mandoline for this). Transfer to a jar and add white vinegar. Fill the rest of the jar with water and add a pinch of both salt and sugar. Shake and place in the fridge – they’ll be ready to go within 30-60 minutes, and can stay in the fridge for 1-3 days.*",
            "Fry the tortillas:Heat the oil over medium heat (I use a cast iron for this). When the oil is hot, fry the tortillas for a minute or two on each side until golden and crispy. Transfer to a paper towel lined plate to absorb excess oil; sprinkle with salt.",
            "Fry the eggs:Wipe the pan clean. Return to medium heat. Add a few tablespoons of enchilada sauce to the pan, making a little pool of sauce for each egg. The sauce may sizzle, so wear an apron! Crack the eggs directly into the center of each pool of sauce;  2 eggs is the most I can fit in my pan at one time. Cook until the whites are completely set, 4-5 minutes. The sauce will caramelize a bit around the edges (so good). Sprinkle a bit of cheddar cheese around the edges of the eggs for the last few minutes to get a crisped, cheesy edge on your egg.",
            "Assemble tostadas:When the eggs are done, layer your tostadas: crispy tortilla, refried black beans, fried egg. Sprinkle with salt, cilantro, pickled onion, and/or chunks of avocado. SO so good!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Cilantro Orange Chicken with Rice and Beans",
        "LINK": "https://pinchofyum.com/cilantro-orange-chicken-with-rice-and-beans",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1/4 - 1/2 cup cilantro, finely chopped\n2 cloves garlic, grated\njuice of 2 oranges (about 4-5 tablespoons juice) + a bit of zest\n3 tablespoons brown sugar\n3 tablespoons avocado oil\n2 tablespoons white vinegar\n1 1/2 teaspoons salt\n1.25 pounds boneless skinless chicken thighs, cut into bite sized pieces\nwood or metal skewers (optional)\none 8.8-ounce pouch pre-made yellow rice (or make your own!)\none 14-ounce can refried or regular black beans\n1-2 cups diced pineapple, mango, and/or avocado (optional)"
        ],
        "INSTRUCTIONS": [
            "If you’re using wood skewers, start soaking them!",
            "Line a baking sheet with parchment paper or aluminum foil. Turn on the broiler, and make sure one of the oven racks is way up at the top, about 6 inches from the heating element.",
            "Place chicken in a largemixing bowl.",
            "Combine the sauce ingredients in a small bowl.",
            "Pouronly halfof the sauce over the chicken and toss to coat; reserve the other half of the sauce for later. Thread the chicken pieces onto skewers, or you can just let the excess sauce drip off and add the chicken directly to your sheet pan! If you want (I do!) season the chicken with a little pinch of extra salt.",
            "Broil for 12 minutes, or until chicken is cooked through and has a burnished and golden exterior.",
            "Optional – mix a little bit of the reserved sauce with the diced pineapple/mango/avocado to make a little “salsa.”",
            "Brush the golden brown chicken with reserved sauce. Serve chicken with rice, beans, and your fruit salsa! Fresh, juicy and savory, so good."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Butter Chicken Meatballs",
        "LINK": "https://pinchofyum.com/butter-chicken-meatballs",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 tablespoon avocado oil or olive oil\nhalf of an onion, roughly chopped\n3 cloves garlic, minced (or a garlic paste)\na small piece of fresh ginger, grated (or a ginger paste)\n1/4 teaspoon turmeric\n1/4 teaspoon smoked paprika\n1/2 teaspoon garam masala\n1/2 teaspoon cumin\none 14-ounce can crushed tomatoes or plain tomato sauce\n1/2 cup water (more as needed later)\n1/2 teaspoon to 1 teaspoon kosher salt (I use 1 teaspoon, just depends how salty you want it)\n1 teaspoon sugar\n20 ounces of cooked chicken or turkey meatballs (these are the ones I always use! this should be about 4 cups of meatballs)\n2 tablespoons butter\n1/3 cup heavy cream (more to taste)\n1 1/2 cups basmati rice, or precooked rice\n1/4 cup fresh cilantro"
        ],
        "INSTRUCTIONS": [
            "Make your rice according to package directions.",
            "Heat oil over medium heat in a large skillet or Dutch oven over medium heat. Add onion, garlic, ginger, and spices; sauté until softened.",
            "Add tomatoes, water, salt, and sugar. Simmer for 10-15 minutes.",
            "Transfer the sauce to a blender and puree until smooth, or use an immersion blender directly in the pot to blend.",
            "Add sauce back to the pan. Add the meatballs; simmer with the cover on or keep on low heat until warmed through.",
            "Add the butter and cream to make a luscious, heavenly sauce to coat your meatballs.",
            "Serve over rice with a sprig or sprinkle of cilantro. Add spiciness to taste with cayenne or chili oil! OH ME OH MY."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Carrot Cake Coffee Cake",
        "LINK": "https://pinchofyum.com/carrot-cake-coffee-cake",
        "PREP_TIME": "55 minutes",
        "INGREDIENTS": [
            "2 large carrots\n3/4 cup granulated sugar\n1/2 cup butter, melted\n2 eggs\n1 cup flour\n1 teaspoon baking soda\n1 teaspoon cinnamon\npinch of salt\n4 tablespoons butter, melted\n1/2 cup flour\n1/2 cup brown sugar\n1 teaspoon cinnamon\npinch of salt"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 350 degrees. Peel and grate the carrots (I use my food processor). You should have about 1 1/2 cups.",
            "Cake Batter:Whisk sugar, melted butter, and eggs. Stir in carrots. Add flour, baking soda, and cinnamon. Mix until just combined. The batter will be very thick.",
            "Streusel:Mix ingredients for the streusel until you get a texture that looks like pebbles (sometimes I use my hands to mix it all together).",
            "Bake:Spread batter into a greased 9-inch round baking pan (see FAQs). Sprinkle with streusel. Bake for 30 minutes until the center is just set. Top with honey butter if you’re extra (you are)."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Favorite Browned Butter Chocolate Chip Cookies",
        "LINK": "https://pinchofyum.com/browned-butter-chocolate-chip-cookies",
        "PREP_TIME": "1 hour 5 minutes",
        "INGREDIENTS": [
            "1 cup unsalted butter (2 sticks)\n1 cup white sugar\n1 cup brown sugar\n1 tablespoon vanilla\n2 eggs\n2 1/2 cups + 2 tablespoons flour (see the FAQs above for notes on spooning the flour and flour amounts)\n1 teaspoon baking soda\n1 teaspoon baking powder\n3/4 teaspoon salt\n1 1/2 cups chocolate chips or chocolate chunks"
        ],
        "INSTRUCTIONS": [
            "Brown the butter:Cut the butter into small pieces for even melting. Melt the butter in a wide stainless steel skillet over medium heat. Swirl the pan a few times as the butter melts. It will get bubbly and then foamy – use a heat-proof spatula to scrape the butter across the bottom of the pan to prevent burning. You’ll see the butter start to turn golden brown very quickly, and you’ll be able to smell it (yum). When it is a nice golden brown color, remove from heat and transfer to a cool bowl or glass measuring cup, being careful not to burn it. The whole process should take about 5 minutes. Let the butter cool for another 5-10 minutes while you measure and prep everything else.",
            "Add the butter, sugars, and vanilla to the bowl of an electric mixer. Beat on medium high speed for 2-3 minutes.",
            "Add the eggs and beat for 1-2 minutes until shiny and smooth.",
            "Add the flour, baking soda, baking powder, and salt. Mix until just combined into a dense, shiny dough. Let the dough cool for 15-20 minutes (if you add the chocolate chips now, they will melt).",
            "Mix in the chocolate chips or chunks (sometimes it helps to do this by hand). Let the dough rest for another 20-30 minutes. This helps hydrate the flour and carry the browned butter flavor farther in the cookies.",
            "Preheat the oven to 350 degrees. Roll or scoop your cookie dough into 3-tablespoon balls onto a baking sheet. Bake for 9 minutes, until the edges look cooked but the middles are still slightly soft and puffy.",
            "Remove from the oven and let the cookies rest for 15-20 minutes. I KNOW I KNOW I KNOW this is very hard. But as they rest, the middles are going to sink down and kind of densify the middle, so you get that crispy exterior with the barely-thick, underbaked center."
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Yummy Salmon Burgers with Slaw",
        "LINK": "https://pinchofyum.com/yummy-salmon-burgers-slaw",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "12-14 ounces cooked salmon (canned is great! - see notes)\n2 eggs\n1/2 cup breadcrumbs\n1 teaspoon salt\n1/2 teaspoon garlic powder\n1/4 cup chopped fresh herbs, like chives, parsley, or dill\na squeeze of lemon juice\nolive oil for pan-frying\n1 head green cabbage, finely shredded\n1 cup plain Greek yogurt\n2-3 tablespoons white distilled vinegar (more to taste)\n1 teaspoon salt\n1/2 teaspoon garlic powder\n1/2 cup chopped fresh herbs like chives, parsley, and dill\na drizzle of olive oil"
        ],
        "INSTRUCTIONS": [
            "For the salmon:Flake the salmon apart. Mix all burger ingredients together and form into 3 large or 4 medium patties. Heat olive oil over medium heat, ideally in a nonstick skillet. Fry the burgers for a few minutes on each side until golden brown and crispy. Place on a paper towel lined plate and sprinkle with salt.",
            "For the slaw:Mix all slaw ingredients together. Taste and adjust.",
            "Serve:Serve up those hot salmon burgers on a bed of creamy slaw. I top mine with a dollop of extra yogurt and a swizzle of oil and more herbs. Can’t stop me."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Sopa Tarasca (Pinto Bean Soup) with Jalapeño Corn Fritters",
        "LINK": "https://pinchofyum.com/sopa-tarasca-pinto-bean-soup-with-jalapeno-corn-fritters",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "2 tablespoons olive oil\n1 onion, chopped\n4 cloves garlic, smashed\n1/2 tablespoon ancho chili powder\n2 teaspoons cumin\none 28-ounce can whole tomatoes\ntwo 14-ounce cans pinto beans, drained\n2-3 cups water or vegetable broth\n2 teaspoons salt (more or less to taste)\n1 3/4 cups frozen corn\n1/4 cup flour\n1 tablespoon cornstarch\n1/4 to 1/2 cup cotija cheese\nminced jalapeño (to taste - one is usually more than enough)\n1/2 teaspoon salt, and/or salt for topping\n1 cup vegetable oil for frying"
        ],
        "INSTRUCTIONS": [
            "Heat olive oil over medium high heat. Add onion and garlic; sauté until soft and fragrant. Add ancho chili powder and cumin; sauté for 1-2 minutes. Add tomatoes; simmer for 15 minutes. Transfer mixture to a blender and blend until smooth. Return to pot.",
            "Add pinto beans to blender; puree with water or broth. Return to pot and stir it into the tomato mixture. Simmer over low heat until ready to serve.",
            "For the corn fritters, pulse 1 cup of the corn in a food processor until smooth-ish. Mix your pureed corn with the flour, cornstarch, Cotija, jalapeño, and salt. Add in remaining 3/4 cup corn. Pour several cups of oil into a skillet for frying. Heat over medium heat. When the oil is hot, add the corn batter in small rolled balls – about 1-2 tablespoons per fritter (a cookie dough scoop works well for this). Fry until golden on both sides. Remove from the oil and drain on paper towels.",
            "Serve soup topped with corn fritters, crema, Cotija cheese, cilantro, and anything else your heart is asking for. YUM."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Ginger Peanut Chicken with Coconut Rice",
        "LINK": "https://pinchofyum.com/ginger-peanut-chicken-with-coconut-rice",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 1/4 pounds chicken thighs, fat trimmed, cut into small bite-sized pieces\n1-inch piece of ginger, grated\n3 green onions, thinly sliced (white parts and green parts separated)\nzest and juice of 1-2 limes\n2 tablespoons brown sugar\n1 1/2 teaspoons salt\n1 tablespoon olive oil or avocado oil\n2-3 cloves garlic, minced\n1/2 cup chopped roasted peanuts\n1/2 cup chopped cilantro\n1 cup spinach, bok choy, etc.\n2 cups white or jasmine rice\n1 1/2 cups water\n1 can coconut milk\na pinch of salt"
        ],
        "INSTRUCTIONS": [
            "Marinate Chicken:In a stainless steel bowl, mix the chicken with the ginger, green onions (white parts), lime zest, brown sugar, salt, and oil. Marinate for 20 minutes-2 hours.",
            "Rice:Add the rice ingredients to an Instant Pot. Cook on high pressure for 3 minutes, followed by a natural pressure release for 10-15 minutes (it won’t be quite done yet after 3 minutes – it needs the rest time to finish cooking). Release the steam, fluff with a fork, and attempt not to eat the whole thing!(Don’t have an Instant Pot? Alternative methods are in the notes section!)",
            "Cook Chicken:Heat a large skillet (nonstick or cast iron work well) to medium-high heat. Add the marinated chicken to the pan, working in 1-2 batches depending on the size of your pan. Leave the chicken sitting undisturbed for several minutes to get a nice caramelization on the chicken.",
            "Adding Extras:When all the chicken is cooked, turn the heat down slightly and add the peanuts and garlic to the pan. Sauté for 3-5 minutes to get the peanuts roasty and the garlic nice and fragrant.",
            "Finish by adding in the cilantro, green onion, and spinach. Squeeze lime juice into the pan and season with more salt and pepper as needed.",
            "Serve over coconut rice! SO simple but so good."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Strawberry White Chocolate Cookies",
        "LINK": "https://pinchofyum.com/strawberry-white-chocolate-cookies",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1/2 cup butter (I usually use salted), softened\n1/2 cup packed light brown sugar\n1/4 cup granulated sugar\n1 egg\n1 teaspoon vanilla extract\n1 1/4 cups and 2 tablespoons flour (see notes section for weight in grams)\n3/4 teaspoon baking soda\n1/2 teaspoon salt\n1/2-3/4 cup freeze-dried strawberries\n1/2 cup white chocolate chips"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 350 degrees F.",
            "Using a stand mixer or an electric hand mixer, combine the butter with the sugars until creamy.",
            "Add the egg and vanilla; mix until just combined.",
            "Add the flour, baking soda, and salt; mix until just combined.",
            "Fold in the white chocolate chips. Crush the strawberry pieces gently by hand, not into powder but just into small chunks. Fold strawberry pieces into the dough.",
            "Roll into balls (9-12 total) and bake on a parchment-lined baking sheet for 9-11 minutes depending on the size of your cookies. I usually do this in two batches. At 9-10 minutes, the cookies will be puffed up slightly – they’re not going to stay like that! You’ll want to let them sit out for a few minutes so they can sink back down and firm up into soft, dense, buttery, delicious little miracle cookies."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Pearl Couscous Skillet with Tomatoes, Chickpeas, and Feta",
        "LINK": "https://pinchofyum.com/couscous-skillet-with-tomatoes-chickpeas-and-feta",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "2 tablespoons olive oil\n1 shallot, thinly sliced\n1/2 teaspoon cumin\none 14-ounce can chickpeas (drained and rinsed)\none 14-ounce can diced tomatoes (I like fire-roasted)\n3/4 cups water or vegetable broth\n1 teaspoon salt\n1/2 cup pearl couscous\n1/4 cup fresh chives, chopped\n3-4 tablespoons of mint leaves, chopped (optional, for topping)\n1/2 cup crumbled feta cheese (optional, for topping)\n4-5 stalks kale, stems removed, torn into small bite-sized pieces (can be curly kale or lacinato kale, I use both)\n3 tablespoons olive oil\n1 tablespoon red wine vinegar\n1 tablespoon maple syrup\nsalt and pepper to taste"
        ],
        "INSTRUCTIONS": [
            "Add the olive oil to a skillet over medium heat. Add shallots and cumin; sauté until softened, about 5 minutes. Add the chickpeas and mash gently a few times – this is optional but just creates a more interesting texture and helps it get a little bit creamy.",
            "Add the diced canned tomatoes; bring to a simmer.",
            "Add the broth, salt, and couscous; bring to a simmer, then cover and keep on low heat for 6-8 minutes or until the couscous is soft and has absorbed most of the liquid. It should be nice and soft / chewy, like an al dente pasta.",
            "Finish by stirring in chives. Massage the kale with the dressing ingredients in a small bowl for a minute or two, just until tender.",
            "Serve couscous with a little side of the massaged kale. Top individual servings with mint leaves and feta. Creamy, chewy, comforting – it’s so good!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Liz’s Bistro Salad",
        "LINK": "https://pinchofyum.com/bistro-salad",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "1 red onion, thinly sliced\n1/4 cup white or red wine vinegar\n1/2 cup water\na pinch of salt and sugar\n1 romaine heart, stem removed and chopped\nhalf a head of butter lettuce, stem removed, gently torn\n2 tablespoons fresh minced tarragon\n1/2 cup fresh dill, chopped or torn\n1/4 cup fresh chives, minced\n1/2 cup canola oil (see notes)\n3 tablespoons lemon juice (more to taste)\n3/4 teaspoon salt\n1 teaspoon sugar\n1 teaspoon dijon mustard or mayo - the purpose of this is to emulsify the dressing"
        ],
        "INSTRUCTIONS": [
            "Pickled Onions:Place the onions in a jar; fill the jar about a third of the way with vinegar, then fill to the top of the onions with water. Add salt and sugar, shake, and keep in the fridge for a few hours or a few days. (I’d suggest 30 minutes minimum if you’re short on time.)",
            "Vinaigrette: Shake all dressing ingredients in a jar. It should be pleasantly bright and mellow – remember we’ll be adding a bunch of onions and herbs to the salad, so it’s okay for this dressing to be pretty chill. Keep this in the fridge if making ahead.",
            "Salad:Prep all your salad greens – chop the romaine and the herbs, and gently tear the lettuce leaves into bite sized pieces.",
            "Toss:Just before serving, toss greens, herbs, pickled onions, and dressing together – starting with about half of the dressing that’s in the jar, and adding more as necessary.",
            "Serve:Taste and adjust; add salt and pepper to taste. It’s tender, bright, a little puckery, and so fresh. I love it."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "7-Layer Beet Salad",
        "LINK": "https://pinchofyum.com/7-layer-beet-salad",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "2-3 cups chopped kale\n1/4 cup of balsamic store-bought dressing, simple green salad dressing, or just olive oil and lemon\n2-3 oranges, cut into rounds\n8 small cooked beets (2 packages if you're buying Love Beets)\n1 minced shallot\n1/2 cup truffle ricotta or ricotta cheese\n1/2 cup pistachios, chopped\n2 tablespoons fresh mint OR other chopped herbs you like (basil, chives, or thyme would be good)"
        ],
        "INSTRUCTIONS": [
            "Massage kale with a bit of the dressing to soften it. Trust me – it will taste way better.",
            "Cut the beets, oranges, and shallots.",
            "Spread a little bit of your creamy element onto the serving platter. If this is a salad for one, I would use about 3 tablespoons. If it’s a salad for 4-6, I would use more like 1/2 cup.",
            "Layer the rest of the 6 ingredients: massaged kale, beets, oranges, shallots, pistachios, and herbs. Finish with olive oil, salt, and pepper if you want. I love this salad with a hunk of good focaccia."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "My 10 Favorite Recipes from 2022",
        "LINK": "https://pinchofyum.com/favorite-recipes-from-2022",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": "1",
        "TITLE": "12 Easy Recipes You Can Make in a Slow Cooker",
        "LINK": "https://pinchofyum.com/12-easy-recipes-you-can-make-in-a-slow-cooker",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": "2",
        "TITLE": "Cream Cheese Danishes with Sugared Cranberries and Butter Glaze",
        "LINK": "https://pinchofyum.com/cream-cheese-danishes-with-sugared-cranberries-and-butter-glaze",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 roll refrigerated crescent rolls\n2 ounces cream cheese\n1 tablespoon granulated sugar\n1 egg + 1 tablespoon milk (for egg wash)\n1/2 cup jam or fruit spread (I like a classic strawberry but this is also delicious with something more seasonal)\n1/2 cup powdered sugar\n1 tablespoon warm melted salted butter\n1 tablespoon warm water\n1/8 teaspoon vanilla extract\n3 cups fresh cranberries\n1/2 cup water\n1 1/4 cups granulated sugar"
        ],
        "INSTRUCTIONS": [
            "Make the sugared cranberries:Boil 1/2 cup water with 1/2 cup sugar for 3-4 minutes. Add washed and dried cranberries to the pot; stir to combine. Transfer to a parchment-lined tray and let cool for one hour (to make them sticky and not overly wet). Once cool and sticky, toss with the remaining 3/4 cup sugar to coat.",
            "Make the cream cheese danishes:Preheat the oven to 375 degrees. Unroll the dough out into one flat piece on a clean work surface. Use a rolling pin to roll it out and press the seams together. You want to make a solid rectangle that is just a bit bigger than the original shape.",
            "Mix the softened cream cheese with the sugar until well combined. Spread evenly over the dough.",
            "Cut the dough into 4 long strips. Fold each strip in half (so the cream cheese isn’t getting all over your hands) and then twist each strip into a long rope. Roll the rope into a spiral to make the shape of the danish. Transfer to a parchment-lined baking sheet.",
            "Mix the egg and milk to make an egg wash. Brush each danish with egg wash and dollop each danish with 1 tablespoon of the jam. Bake for 10 minutes; if you want, increase temperature to 400 and bake for 3-5 more minutes to achieve desired browning.",
            "Finish and glaze:Remove from oven and let cool. While cooling, whisk the glaze ingredients together.",
            "Top each danish with a few sugared cranberries (see notes below) and drizzle with glaze. I really (like, really) enjoy eating these warm. The cream cheese layer, the jammy goodness, the tart crunch from the cranberries… oof. So good!"
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Ginger Chicken Meatball Sandos",
        "LINK": "https://pinchofyum.com/ginger-chicken-meatball-sandos",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "2 cloves garlic\n1 serrano pepper, stem removed\none 1-inch piece of ginger, peeled\na bunch of fresh cilantro\n3 teaspoons fish sauce\n1 1/2 tablespoons brown sugar\n1 tablespoon cornstarch\n1 pound ground chicken\n2 tablespoons olive oil\npinch of salt\n4 pieces soft bread - either soft French bread or flatbread like pita or naan\n1/2 cup mayo or kewpie*\n1 cucumber, sliced\n1 sliced shallot or red onion\n2 tablespoons cilantro\n1/4 cup mint leaves\n2 tablespoons chili crisp* or sriracha"
        ],
        "INSTRUCTIONS": [
            "Blitz garlic, serrano pepper, a bunch of fresh cilantro, and a piece of ginger in a small chopper or food processor until minced.",
            "Add mixture to a large bowl. Mix with ground chicken, fish sauce, brown sugar, cornstarch, and salt. Form into 12 meatballs – they will be wet but that’s okay. The shape doesn’t need to be perfect!(See Note 1 below if your mixture is too wet to form into meatballs.)",
            "In a large skillet with a lid, heat oil over medium-high heat. Add the meatballs and let them begin to cook.",
            "Add 2 tablespoons water; it will sizzle, so wear an apron and have your lid ready! Put the lid on the pan and let the meatballs cook for a few minutes. Uncover, flip, and repeat. Within about 10 minutes, the meatballs should be cooked through, tender, and nicely golden brown.",
            "To serve, warm the bread so it’s nice and soft. Shmear with mayo, top with meatballs, sliced cucumber, sliced shallot, cilantro and mint, and a drizzle of chili crisp. Messy, saucy, and mind-blowingly delicious."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Instant Pot Short Rib Ragu",
        "LINK": "https://pinchofyum.com/instant-pot-short-rib-ragu",
        "PREP_TIME": "55 minutes",
        "INGREDIENTS": [
            "lbs bone-in short ribs (or 1 lb boneless)\n1 tablespoon vegetable oil\n1 small onion, finely diced\n2 cloves garlic, chopped\n1/4 cup dry red wine\none 25-oz jar store bought marinara/spaghetti sauce (I use DeLallo tomato basil sauce)\n1/2 cup water\n1/2 teaspoon salt\n1/4 teaspoon crushed red pepper\nsalt & pepper, to taste\n1 lb. pasta or gnocchi"
        ],
        "INSTRUCTIONS": [
            "Get ready:Turn instant pot on to the sauté setting. While it heats up, trim any excess fat from the short ribs, then pat dry with a paper towel. Generously season the meat with salt and pepper.",
            "Brown those short ribs:Add oil to the Instant Pot. Add the short ribs to the hot oil and sear on all sides until brown.(The meat does not need to be fully cooked. Just browned.)Remove from pot and set aside.",
            "Onions, garlic, and wine:Use tongs & paper towel to remove any excess oil from the pot. Add onion and garlic and sauté until tender, about 3 minutes, scraping the browned bits off the bottom of the pot. Pour wine in to deglaze(*sizzzles*)and cook for about 2 minutes.",
            "Go-time:Add short ribs, tomato sauce, salt and crushed red pepper to pot. Use 1/2 cup water to rinse out sauce jar and add to pot. Set Instant Pot to the stew/meat setting(35 mins). When it’s done, let it sit untouched for a natural steam release.",
            "Finish up:Remove meat to sheet pan. Shred into bite size pieces, removing bones and any large pieces of fat. Meanwhile, set the Instant Pot to sauté again to reduce/thicken the sauce. Skim any fat off top of sauce and add meat back in. Taste and add salt & pepper if needed.",
            "Serve:Serve over cooked pasta or gnocchi. Yummmo!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Vegetarian Shepherd’s Pie",
        "LINK": "https://pinchofyum.com/vegetarian-shepherds-pie",
        "PREP_TIME": "55 minutes",
        "INGREDIENTS": [
            "2 tablespoons olive oil\n3 shallots, minced (or some onions and garlic)\n16 ounces fresh mushrooms, sliced\n6 carrots, peeled and chopped (about 2 cups)\n1 sprig of fresh rosemary\n1 sprig of fresh thyme\n1 dried bay leaf\n2 tablespoons tomato paste\n2 tablespoons flour\n1/2 cup red wine\n1-2 cups veggie broth\n1 teaspoon salt (more or less to taste)\n2 cups frozen peas\n6 Yukon gold potatoes (about 2 pounds)\n1/2 cup full fat Greek yogurt\n1/4 cup butter or olive oil\nsalt to taste"
        ],
        "INSTRUCTIONS": [
            "Make the mashed potatoes: Peel the potatoes. Boil them until fork tender (you want them to mash easily). Drain, mash, and mix in yogurt and butter. Season to taste.(You can also use the Instant Pot method which is quick and easy! That’s what I do.)",
            "Make the veggies:In a large oven-safe pot, heat the oil over medium heat. Add shallots and sauté until fragrant. Add mushrooms, carrots, and whole herbs(you will pull the herbs out later). Sauté until carrots are softened.",
            "Make the gravy: Add tomato paste and flour to the pot and stir. Pour in the red wine (sizzzzle) and scrape all the browned bits off the bottom of the pan. Let the wine cook out for a minute or two. Slowly add the broth, stirring it in until a gravy starts to form. Season with salt. Simmer over low heat to get it thickened even further.",
            "Bake:Remove the herbs. Stir in the peas, spread the mashed potatoes on top (brush with butter to be extra awesome), and bake for 15 minutes at 350. I finished mine on the broil setting for a few minutes to get it nice and brown on top.",
            "Scoop up a hearty serving and live your best cozy life."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "House Favorite Roasted Brussels Sprouts",
        "LINK": "https://pinchofyum.com/house-favorite-brussels-sprouts",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "one 12 oz. package raw brussels sprouts, halved\n2 tablespoons olive oil\na pinch of salt and pepper\na handful of walnuts\na handful of dried cranberries\n1 teaspoon Dijon mustard\n2 tablespoons maple syrup\nextra olive oil, more salt and pepper, maybe some red pepper flakes if you want to spice things up"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 425 degrees. Place brussels sprouts cut-side down directly on a baking sheet. Drizzle with oil and sprinkle with salt and pepper.",
            "Roast brussels sprouts for 15-20 minutes, until cut sides are very brown and some of the leaves are crispy. Add walnuts, mustard, and maple; return to oven for 5-10 minutes to get the walnuts toasted.(You can choose to either add the sauce now, or when the pan comes out of the oven in step 3. If you add it now, it gets kind of baked into the brussels, but if you add it when they’re done baking, it’ll be a little more saucy. I like it both ways. Your choice!)",
            "Remove from oven. Toss with cranberries directly on the baking sheet. Season and serve immediately. Yumo!"
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Instant Pot Mac and Cheese",
        "LINK": "https://pinchofyum.com/instant-pot-mac-and-cheese",
        "PREP_TIME": "10 minutes (+ 10 minutes resting)",
        "INGREDIENTS": [
            "1 pound uncooked elbow pasta\n4 cups water\n1 teaspoon salt\n3 tablespoons butter, cut into small pieces\n2 1/2 cups shredded cheese\nup to 1/2 cup whole milk"
        ],
        "INSTRUCTIONS": [
            "Noodles:Put the pasta, water, and salt into the Instant Pot. Cook for 4 minutes using the manual function. Quick release the steam so your noodles don’t get overcooked.",
            "Cheese:Gently stir in the butter until melted. Add the cheese and milk (use 2-3 tablespoons of milk at a time, as needed, up to 1/2 cup). Add more seasoning or liquid if necessary. For best results, let it sit for 5-10 minutes to let it thicken up a bit. MWAH! Enjoy. It’s so, so good."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Everybody’s Favorite Corn Casserole",
        "LINK": "https://pinchofyum.com/corn-casserole",
        "PREP_TIME": "1 hour 10 minutes",
        "INGREDIENTS": [
            "1 pound bacon, cut into small pieces\n1/2 onion, finely chopped\n1 clove garlic, minced\n2/3 cup cornmeal\n2/3 cup flour\n1/4 cup sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1 cup sour cream\n1/2 cup butter, melted\n1 egg\none 15-ounce can corn, drained\none 15-ounce can cream-style corn\n1 1/2 cups sharp white cheddar\nChopped chives"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 350 degrees. In a pan over medium heat, fry the bacon pieces until crispy. Remove from the pan, but leave some of the bacon grease to sauté the onions. Add the onions and a sprinkle of salt to the pan and cook until softened. Add in the garlic and cook for another minute. Take the pan off the heat. Chop the bacon into bits.",
            "In a bowl, combine the cornmeal, flour, sugar, baking powder, and salt. In a separate bowl, whisk the sour cream, butter, and egg until smooth. Then, stir in the corn, cream corn, the onion mixture, half of the bacon. Add in the dry ingredients, and stir until just combined.",
            "Pour into a greased casserole dish. Bake for 35 minutes. Remove from the oven and top with the cheese and remaining bacon. Bake for another 5 minutes. Sprinkle chopped chives over the top."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Salted Caramel Rice Krispie Bars",
        "LINK": "https://pinchofyum.com/salted-caramel-rice-krispie-bars",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "1 cup unsalted butter\n1 cup lightly packed light brown sugar\n1/2 cup heavy whipping cream\n2 teaspoons flaky sea salt\n10-ounce package miniature marshmallows (16 ounces for extra gooey!)\n12-ounce box of Rice Krispies or crispy rice cereal (about 11-12 cups)"
        ],
        "INSTRUCTIONS": [
            "Melt butter in a large pot over medium heat.",
            "Add sugar and whipping cream; stir to incorporate. It will take a minute, but as it heats, you’ll start to see a smooth, creamy caramel mixture form. Heat over medium-low heat for 5-7 minutes, until you have a slightly thickened caramel sauce that coats the back of a spoon.",
            "Remove from heat and stir in the salt. Taste and adjust for more salt if you want.",
            "Add the marshmallows and stir until melted.",
            "Stir in the cereal. Press mixture into a 9×13 pan. You might have a little bit of extra that doesn’t fit in the pan – perfect for a little snack, if you ask me.",
            "Cool slightly, cut into squares, and enjoy! You can eat these at room temperature, but I also love them in the refrigerator! They stay excellently tight, compact, and yet still soft and chewy as they thaw. For some reason that cold, crispy, buttery texture is just really enjoyable."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Cashew Chicken",
        "LINK": "https://pinchofyum.com/cashew-chicken",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "3/4 cup flour\n3/4 cup cornstarch\n1 teaspoon salt\n1/2 teaspoon paprika\n3/4 cup cold water\nabout 1/2 cup vegetable oil for frying\n1 lb. boneless skinless chicken breasts, cut into small bite-sized pieces\n1 cup cashew halves\n1/2 cup hoisin sauce\n1/4 cup soy sauce\n2 tablespoons white vinegar\n1 tablespoon sriracha (optional)\n1/4 cup granulated sugar\n2 cloves fresh garlic, grated\na small piece of fresh ginger, grated"
        ],
        "INSTRUCTIONS": [
            "Make Batter:Mix the flour, cornstarch, salt, and paprika. Set aside half of the flour mixture in a small bowl. Mix the other half of the flour mixture with 3/4 cup cold water to form a loose batter.",
            "Make Sauce:Whisk all sauce ingredients together. Set aside.",
            "Fry Chicken:Heat oil over medium heat until a drop of water sizzles across the top. Dredge the chicken pieces in the dry flour mixture, then dip into the batter. Let excess batter drip off. Add battered chicken pieces to the oil. Fry for 2-3 minutes on each side. Remove from the pan and drain on paper towel lined plate. Drain out any excess oil from the pan.(SEE NOTES FOR AN EASY SHORTCUT ON THIS STEP.)",
            "Finish:Put chicken back in the pan. Add sauce and cashews. Stir for about 1 minute, until coated and you can start to smell the garlic. Done! Serve with rice and maybe some roasted or steamed broccoli. SO GOOD!"
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Chicken Orzo Tomato Soup",
        "LINK": "https://pinchofyum.com/chicken-orzo-tomato-soup",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "2 tablespoons DeLallo Private Reserve Extra Virgin Olive Oil\n4 cloves garlic, thinly sliced or minced\n1/4 cup DeLallo Tomato Paste\n1/2 teaspoon Italian seasoning\n4 cups chicken broth\nsalt to taste\n1 cup DeLallo Orzo Pasta\n2 cups chopped or shredded cooked chicken (I use the pulled meat from a rotisserie chicken)\n1/4 cup heavy cream\n1-2 cups water as desired\nparmesan, herbs, red pepper flakes, and lemon for serving\nbread for serving\npesto for serving (optional - recipe in notes)"
        ],
        "INSTRUCTIONS": [
            "Heat the olive oil in a soup pot over medium high heat. (See notes on types of pan to use!) Add the garlic; sauté for 1-2 minutes until soft and fragrant but not browned.",
            "Add the tomato paste and Italian seasoning; cook until it becomes caramelized and turns a deep red color, about 5 minutes.",
            "Add the broth gradually until the mixture incorporates into a smooth liquid. This is a good time to add salt; I recommend tasting the liquid to see how much salt it needs depending on how salty your broth was. Otherwise just add 1/2 teaspoon to start, and add from there.",
            "Add the orzo and bring the whole thing to a simmer for about 10 minutes until the orzo is soft. If needed, add a cup more of water and/or broth to get your desired consistency. Stir in heavy cream.",
            "Add the chicken and squeeze in a bunch of lemon juice to wake the whole thing up.",
            "Serve topped with Parmesan, herbs, red pepper flakes, and hot crusty bread. If you want, serve with a little side of pesto for dipping the bread in before dunking in the soup. YUM. So good!"
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "30 Comfort Meals to Bring to a Friend in Need",
        "LINK": "https://pinchofyum.com/comfort-meals-to-bring-to-a-friend-in-need",
        "PREP_TIME": "",
        "INGREDIENTS": [],
        "INSTRUCTIONS": []
    },
    {
        "NUMBER": "1",
        "TITLE": "Chipotle Orange Shrimp with Cilantro Rice",
        "LINK": "https://pinchofyum.com/chipotle-orange-shrimp-with-cilantro-rice",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 chipotle pepper (or half of one pepper, for a less spicy version)\n3/4 cup heavy cream\n2 cloves garlic\n1/2 teaspoon salt\nzest of one orange\na drizzle of olive oil\n1 pound uncooked shrimp, tails removed, patted dry\n1/2 teaspoon cumin\n1 1/2 cups white rice (I like jasmine rice or just plain long grain rice)\n1/2 cup chopped cilantro\n2 small cucumbers (or one large), thinly sliced\n1 tablespoon olive oil\n2 tablespoons white vinegar\n1 tablespoon sugar\n1/2 teaspoon salt"
        ],
        "INSTRUCTIONS": [
            "Cucumbers:Toss together all the cucumber ingredients. Set aside.",
            "Sauce:Blend sauce ingredients together until mostly smooth. But don’t overblend! See notes.",
            "Rice:Cook rice according to package directions. Stir in cilantro and salt to taste (+ add lime juice, or the juice of the zested orange, if you want some citrus goodness in there).",
            "Shrimp:Heat the oil over medium high heat. Add the shrimp and sauté for 2 minutes on each side, sprinkling with the cumin, plus some salt and pepper.",
            "Finish:Add the sauce and simmer for another 5 minutes or so. Serve shrimp over rice, with a salad or some fresh zippy cucumbers."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Harissa Meatballs with Whipped Feta",
        "LINK": "https://pinchofyum.com/harissa-meatballs-with-whipped-feta",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "one 22-ounce bag of store-bought frozen meatballs (or homemade, if you've got them / got the time)\n2 bell peppers (yellow and red), sliced\n1-2 zucchini, sliced into half moons\n2 tablespoons harissa paste\nolive oil, garlic powder, lemon juice, salt\none 6-ounce container feta cheese\n1-2 ounces cream cheese or sour cream or I've used plain yogurt in a pinch\n1 clove garlic\n1 cup hummus\n6 pitas\n1/4 cup kalamata olives\n1 lemon, cut into wedges"
        ],
        "INSTRUCTIONS": [
            "Sheet Pan, Part One:Preheat the oven to 425 degrees. Place the peppers on one side of a large sheet pan. Drizzle with oil and sprinkle with salt. Mix the harissa with a little bit of olive oil, lemon juice, and garlic powder until you have a nice spreadable red paste. Coat your meatballs with the sauce (you can do this by tossing the meatballs in a bowl with the sauce if they’re pre-cooked, or just brushing the meatballs directly on the sheet pan if your meatballs are raw). Add meatballs to the center of the sheet pan. Bake for 15-20 minutes.",
            "Sheet Pan, Part Two:Add the zucchini to the pan with some olive oil and salt. Roast for another 10 minutes. For extra browning on everything, broil for about 5 minutes.",
            "Whip That Feta:In a food processor, chopper, or blender, whip up the feta, cream cheese, and garlic until a thick and creamy sauce forms.",
            "Serve:Serve meatballs and veggies with a dollop of hummus, your whipped feta, pita wedges, and anything else you like (olives, lemon, etc.). And now DEVOUR. And repeat. And repeat. And repeat."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Sesame Apricot Tofu",
        "LINK": "https://pinchofyum.com/sesame-apricot-tofu",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1 block of extra firm tofu (high protein tofu works really well in this recipe, if you can find it!)\n2 tablespoons cornstarch\n1 tablespoon soy sauce\n2 tablespoons olive oil\n1/3 cup apricot preserves\n1 tablespoons soy sauce\n1-2 tablespoons rice vinegar\n1/2 teaspoon each cumin, paprika, and onion powder\n1-2 cloves garlic, grated (2 for more garlic flavor, obviously)\n1/4 teaspoon salt (more to taste)\n1 cup rice\n12 ounces steamed green beans\n1-2 tablespoons toasted sesame oil to taste\n1/4 cup chives and/or cilantro for topping"
        ],
        "INSTRUCTIONS": [
            "Cut the tofu block in half horizontally (like a hamburger). If using extra firm high protein tofu, it helps to cut it in half again horizontally. Press the water out of the tofu by wrapping it in paper towels and setting a few heavy books on top of it. Let it stay like that for a few minutes while you prep the sauce.",
            "Whisk the sauce ingredients together.",
            "Take each piece of tofu and gently pull it into small chunks with your hands (this just gives the tofu pieces a unique shape and texture that holds onto the sauce really well). Place the chunks in a bowl. Toss with soy sauce and a teaspoon or two of olive oil; then sprinkle with cornstarch and give it a few gentle tosses to coat.",
            "Before your start browning your tofu, cook your rice according to package directions and start your green beans! Steam, microwave, sautè – whatever your preferred green bean method is.",
            "In a nonstick skillet over medium high heat, heat the olive oil and then add the cornstarched tofu. Leave it undisturbed for a few minutes on each side, letting it get really nice and brown and crispy – this can take 10-15 minutes. Flip and repeat until the whole batch is browned and crispy.",
            "Finally, add the sauce to the tofu and remove from heat – the pan will still be hot, so it’ll be sizzly and smell really good from the garlic. The sauce will coat the tofu right away. *heart eyes*",
            "Top with the chives and/or cilantro and sesame oil. Serve with rice and green beans, and finish with more salt and lots of black pepper to taste. The tender crunch of the beans with the steamy rice and sticky tofu! SO good."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Instant Pot Wild Rice Soup",
        "LINK": "https://pinchofyum.com/instant-pot-wild-rice-soup",
        "PREP_TIME": "1 hour",
        "INGREDIENTS": [
            "2 tablespoons butter\nhalf of an onion, chopped\n8 ounces fresh mushrooms, thinly sliced\n1 cup uncooked wild rice (see notes)\n4 cups vegetable or chicken broth\n1 teaspoon salt\n1/2 teaspoon rubbed sage\n1/2 teaspoon dried thyme\n3 cloves garlic, minced\n5 medium carrots, chopped\n3 stalks celery, chopped (optional)\n6 tablespoons butter\n1/2 cup flour\n1 1/2 cups milk (I used 2%)\nOR replace all of the above with 1 1/2 cups heavy cream\n1 teaspoon umami mushroom seasoning\n1-2 tablespoons sherry (it seems forgettable but it adds a lot)"
        ],
        "INSTRUCTIONS": [
            "Instant Pot soup base:Using the sauté function, melt the butter and sauté the onions and mushrooms until softened. Add the wild rice, the broth, the salt, and the spices; cook on high pressure for 35 minutes. Release the steam, add carrots, garlic, and celery, and cook on high pressure for another 10 minutes. Release steam using the valve on top.",
            "Make it creamy:You have two choices for making it creamy – A) Add 1 1/2 cups heavy cream to the soup (plus more broth as needed) and you’re done! This is slightly thinner / more brothy, but so rich and flavorful thanks to the cream! B) To avoid using heavy cream (some people don’t like to use it), you can thicken the soup with a flour-butter-milk mixture, in which case you will start by melting the butter in a saucepan. Whisk in the flour. Let the mixture cook for a minute or two to remove the floury taste. Whisk the milk, a little bit at a time, until you have a smooth, thickened sauce. Throw a little salt in there for good measure.",
            "Together:Mix the creamy sauce with the soup in the instant pot. Voila! Mushroom Wild Rice Soup. This will be very thick (especially if you did the flour-butter-milk method), so use broth to thin it out to your desired consistency!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Miracle No Knead Bread",
        "LINK": "https://pinchofyum.com/no-knead-bread",
        "PREP_TIME": "18 hours 40 minutes",
        "INGREDIENTS": [
            "3 cups all-purpose flour\n1 1/2 teaspoons salt\n1/2 teaspoon instant yeast\n1 1/2 cups room temperature water"
        ],
        "INSTRUCTIONS": [
            "DOUGH PREP:In a largemixing bowl, whisk the flour, salt, and yeast together until mixed. Stir in the water until a chunky, thick dough forms. If it needs a little more water, add a few more tablespoons, just enough to get it barely wet throughout. It’s gonna look scrappy and weird and you’re going to question me on whether or not this will work, but it will. Cover themixing bowlwith plastic wrap and let it rest for12-18 hoursat room temperature. Overnight is ideal here, kids.",
            "PREP FOR BAKING:When you’re ready to bake, preheat the oven to 450. Stick a 6 quart enamel coated cast iron Lodge Dutch Oven (or similar) in the oven for about 30 minutes to heat. At this point, the dough should be big and puffy and pretty loose, with little bubbles in it. Gently scrape the dough out onto a well-floured surface. (Remember: NO KNEAD.) Gently shape it into a ball with flour on the outside, set on a piece of parchment, and cover with plastic while your pan heats up.",
            "BAKE:Remove the plastic from the dough. Lift the dough and parchment together into the pan so the parchment lines the bottom of the hot pan (be careful not to touch the pan since it’s very hot). Bake, covered, for 30 minutes. Remove the cover and bake another 10-15 minutes to get the exterior nice and golden brown and crispy. Voila! Done. Miracle no-knead bread, you boss you."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Instant Pot Pasta and Meatballs with Lemon Herb Ricotta",
        "LINK": "https://pinchofyum.com/instant-pot-pasta-and-meatballs-with-lemon-herb-ricotta",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1-2 tablespoons olive oil (2 especially if your sauce doesn't have much oil it in)\n1/2 to 1lb. frozen chicken meatballs (or other pre-made meatballs - I used ones that were already cooked) - about 2 cups if you're eyeballing\none 32-ounce jar of your favorite tomato pasta sauce\n1 cup chicken broth\n1 1/2 cups small pasta - I like to use ditalini\nsalt and pepper to taste\n1 pound fresh ricotta - mascarpone is a bit more creamy / melty and also delicious!\njuice of 1 lemon + a little bit of zest\n1 garlic clove, finely grated\n1/4 cup olive oil\n1 cup finely chopped mixed chives, parsley, basil\nsalt and pepper to taste"
        ],
        "INSTRUCTIONS": [
            "Place meatballs in the Instant Pot; drizzle with olive oil. Sauté for a couple minutes to get the meatballs a bit browned on the outside – they don’t need to be fully thawed.",
            "Add in this order: pasta, sauce, chicken broth.Do not stir.Cook on high pressure for 3 minutes.",
            "Release steam right away (so your pasta doesn’t overcook and get mushy). Stir to incorporate. A small amount of sticking is normal, but with a few gentle stirs it will lift up and come together perfectly. It will be saucy at first; if you let it rest a few minutes, the sauce will absorb into the pasta and it’ll get a little less saucy. It’s delicious to eat either way!",
            "Mix your herbed ricotta ingredients together while the pasta cooks.",
            "Serve the hot pasta in bowls with dollops of the ricotta over the top. Mwah!"
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Spicy Sofritas Tofu",
        "LINK": "https://pinchofyum.com/spicy-sofritas-veggie-bowls",
        "PREP_TIME": "1 hour 15 minutes",
        "INGREDIENTS": [
            "1 poblano pepper\n1-3 individual chipotle peppers canned in adobo sauce (1 for mild/medium, 3 for very spicy)\n2 tablespoons of the adobo sauce\n2-3 cloves garlic\n2 teaspoons cumin\n1 teaspoon chili powder or smoked paprika\n1/2 cup of your favorite salsa\n2 tablespoons canola oil\n1/2 teaspoon salt\n1 14-ounce package extra firm tofu"
        ],
        "INSTRUCTIONS": [
            "Roast your poblano:Hold the poblano over the flame on a gas range until it’s hot and blistery. Alternatively: turn your oven to the broil setting, coat the poblano with oil, place on a baking sheet, and roast for 15 minutes at a time until it’s soft and blistered.",
            "Make a sofritas sauce:Place poblano, chipotles, garlic, spices, and salsa in a small blender or food processor (EXCEPT tofu). Pulse until a mostly smooth paste forms.",
            "Make the sofritas tofu:Slice the tofu and press with a clean towel to remove as much excess moisture as you can (the drier the tofu, the better it soaks up the sauce). Heat a drizzle of oil over medium high heat. Scramble the tofu into small bits with a spatula or wooden spoon. You can do beans or no beans – this is a choose your own adventure here. Add the sofritas sauce with 1/2 cup water. Simmer for 15-20 minutes until the sauce is richly colored and thickened slightly. Add more water as necessary, and season to taste with the salt and lime juice.",
            "Serve:Serve in tacos, burritos, and mega rice bowls!"
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Tofu and Brown Rice Lettuce Wraps with Peanut Sauce",
        "LINK": "https://pinchofyum.com/tofu-and-brown-rice-lettuce-wraps",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "olive oil\nOne 14-ounce block extra firm tofu - minimally pressed to remove water\nabout 2 cups cooked brown rice and/or quinoa or other grains - I use the 8.5 ounce precooked packages so it's very, very easy\nbutter lettuce or leaf lettuce for wrapping\nspicy mayo (see notes)\nchopped peanuts or crispy onions for topping\n1/2 cup teriyaki sauce\njuice of 1 orange\n1/4 cup peanut butter\na squirt of Sriracha or other chile sauce if you want"
        ],
        "INSTRUCTIONS": [
            "Cook the tofu:Heat a few swishes of oil in a nonstick skillet over medium high heat. Add the tofu and crumble in the pan. Cook until slightly browned. While that’s cooking, whisk up all sauce ingredients in a bowl.",
            "Add rice and sauce:Add the rice and most of the sauce to the pan. Sauté for 5 minutes or so – just enough to get some browning / light caramelization and get everything nice and yummy. Season with salt to taste.",
            "Fill and serve:Spoon your tofu and brown rice filling into crispy little pieces of lettuce. Top with something crunchy (peanuts? crispy onions?) and something creamy (spicy mayo all the way) and drizzle with a little extra sauce, and now tell me this isn’t your favorite meal of the week."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Simple Homemade Tomato Soup",
        "LINK": "https://pinchofyum.com/simple-homemade-tomato-soup",
        "PREP_TIME": "1 hour",
        "INGREDIENTS": [
            "4 slices bacon, cut into small pieces\n2 carrots, chopped\nhalf of a yellow onion, chopped\n4 cloves garlic, minced\n1 1/2 tablespoons tomato paste\n1 tablespoon flour\n4 cups chicken broth (more to thin out the soup at the end as needed)\n1/2 teaspoon dried thyme\n1 bay leaf\none 28-ounce can whole San Marzano tomatoes\n2 tablespoons cream (optional - to add at the end as desired)\nkosher salt to taste (I like 1-2 teaspoons)"
        ],
        "INSTRUCTIONS": [
            "Fry the bacon in a large soup pot over medium low heat until bacon starts to get crispy and browned, about 5-8 minutes.",
            "Add the carrots, onion, and garlic to the bacon in the pan; sauté for 5-10 minutes until the vegetables are very aromatic and tender.",
            "Add the tomato paste – stir for a few minutes until you can see/smell the tomato paste starting to brown and caramelize. Add the flour and stir for a minute or so.",
            "Pour the tomatoes and their juice into a bowl and crush them with your hands. Add the crushed tomatoes, broth, thyme, and bay leaf to the soup pot. Simmer for 30 minutes. Puree in batches and return to the pot. Add cream if you want. Season with salt. Look at that homemade tomato soup, you champ."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Crispy Black Bean Tacos with Cilantro Lime Sauce",
        "LINK": "https://pinchofyum.com/crispy-black-bean-tacos-with-cilantro-lime-sauce",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 (14-ounce) can of black beans, rinsed and drained\n1/4 cup of your favorite salsa\n1 tablespoon taco seasoning\n6-8 small flour tortillas\n1/4 - 1/2 cup olive oil or butter for frying\n1/4 cup avocado oil\n1/4 cup water\n1/2 cup chopped green onions\n1/2 cup cilantro leaves\n2 cloves garlic\n1/2 teaspoon salt\njuice of 2 limes\n1/2 cup sour cream (sub avocado to keep it dairy free / vegan)"
        ],
        "INSTRUCTIONS": [
            "Blend all ingredients in the cilantro lime sauce until smooth-ish. Set aside.",
            "In a food processor or chopper, blend the beans, salsa, and taco seasoning. Transfer to a skillet with a drizzle of oil and cook it up long enough to soften the flavors of the garlic and / or onions in the salsa. About 5 minutes is fine.",
            "Spread a few tablespoons of black bean filling into a flour tortilla. Fold in half. Repeat until the filling is used up (about 6-8 tacos).",
            "Heat some oil or butter in a skillet over medium heat. Fry in a skillet over medium heat, until crispy and golden brown. Dip in cilantro lime sauce. Serve with chips and salsa and a mid-week margarita. You’re welcome."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Cauliflower Orange Gnocchi",
        "LINK": "https://pinchofyum.com/cauliflower-orange-gnocchi",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 package gnocchi (I use DeLallo)\n2-3 tablespoons unsalted butter\na medium-large head of cauliflower, cored and thinly sliced into bite-sized pieces on a mandoline (about 3 cups)\n2 shallots, minced (about 1/3 cup)\n1/4 - 1/2 cup heavy cream (see notes)\n1/2 - 1 teaspoons red pepper flakes\n1 1/2 teaspoons salt (more to taste)\njuice and zest of 1 orange (about 2 tablespoons of juice, zest to taste)\nchives for topping"
        ],
        "INSTRUCTIONS": [
            "Cook the gnocchi according to package directions. Set aside.",
            "Heat the butter over high heat in a large nonstick skillet. Add cauliflower, shallot, and cooked gnocchi; let it sit for a few minutes and then stir and repeat. You want the cauliflower and gnocchi to get browned, and the shallots to get soft.",
            "Add in the cream, orange juice, red pepper flakes, and salt. Simmer for just a minute or two until desired consistency is reached – everything should be coated in a silky light sauce.",
            "Serve immediately topped with fresh chives and orange zest. OH MY GOODNESS."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Life Changing Instant Pot Beef Stew",
        "LINK": "https://pinchofyum.com/instant-pot-beef-stew",
        "PREP_TIME": "50 minutes",
        "INGREDIENTS": [
            "lbs. beef, chuck roast, fat trimmed, cut into 1-2-inch chunks\n1 medium onion, sliced thinly\n2 stalks celery, sliced diagonally in thick pieces\n6 carrots, sliced diagonally in thick pieces\n2 tablespoons small tapioca (affiliate link)- see notes\n1/2 cup tomato juice\n2 teaspoons salt\n1 tablespoon sugar"
        ],
        "INSTRUCTIONS": [
            "Just leave em out. Your gravy may be a little less thick, but it will still be delicious.",
            "Toss the beef in 1/3 cup flour, shake off excess and add to the Instant Pot as normal. If you do this and you have a newer Instant Pot, you will likely need additional liquid (I’ll often do a second can of tomato juice) to avoid the burn warning on the Instant Pot.",
            "Make a slurry of 2 tablespoons corn starch and 1/4 cup water. Add the slurry to everything in the Instant Pot after it’s cooked."
        ]
    }
]