[
    {
        "NUMBER": "1",
        "TITLE": "Yummy Air Fryer Chicken Tenders",
        "LINK": "https://pinchofyum.com/air-fryer-chicken-tenders",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1.5 - 2 lbs. chicken tenderloins (about 12-16 pieces)\n3/4 cup all-purpose flour\n1/2 teaspoon kosher salt\none 1-ounce packet ranch seasoning (optional, see notes)\n1 egg\n1-2 teaspoons hot sauce (optional)\n3/4 cup milk + 1 1/2 teaspoons vinegar\n2 1/2 cups plain breadcrumbs\n2 1/2 tablespoons seasoning mix (I use the McCormick rotisserie chicken seasoning)\navocado oil spray"
        ],
        "INSTRUCTIONS": [
            "Prep your dipping stations!1:Combine the flour, salt, and ranch seasoning.2:Let the milk and vinegar sit together for 5 minutes (you’re making a “buttermilk”). Add it to the eggs and hot sauce; whisk to combine.3:Stir the breadcrumbs with the seasoning mix.",
            "Flatten Chicken Tenderloins.Smash each of the chicken tenderloins a few times on a cutting board using the flat side of a knife (see video). You want them to be slightly flattened or fanned out.",
            "Batter Up!Dip each chicken tenderloin in flour; shake off excess. Dip in the buttermilk mixture; let excess drip off. Then coat in the breadcrumbs, flipping and gently pressing a few times until the whole surface is covered. Set aside and repeat with all the chicken tenderloins.",
            "Place in Air Fryer.Place as many as you can fit into the air fryer, keeping them in one flat layer (mine can usually get 6 in at a time). Spray generously with avocado oil spray until the surface is lightly and evenly moistened with oil – this helps them get that evenly golden brown, fried look.",
            "Cook and Serve:Air fry at 400 degrees for 7-9 minutes. You want them to be golden brown on the outside, and 165-175 degrees on the inside. Serve with your favorite sauce! SO yummy!"
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Brandon’s Egg Roll Tacos",
        "LINK": "https://pinchofyum.com/egg-roll-tacos",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 lb. ground chicken, turkey, or pork\n3 tablespoons soy sauce\n1 tablespoon chili crisp\n1 tablespoon garlic paste (or 2 cloves garlic, grated)\n1 tablespoon ginger paste (or a 1/2-inch piece ginger, grated)\n1 cup shredded cabbage and carrots mix (great time to use a store-bought coleslaw or salad mix, where the base is cabbage)\n6-8 small flour tortillas (I like the Mission Street Taco ones for this)\n2-3 tablespoons avocado oil or toasted sesame oil\nMore fresh cabbage / carrot mix (can use the same bag from before!)\nFresh cilantro or green onion\nChili crisp\nGochujang sauce"
        ],
        "INSTRUCTIONS": [
            "Make Filling:Mix the ground meat, soy sauce, chili crisp, garlic, ginger, and veggies together. I just mix it all up with my hands.",
            "Spread Filling:Press the mixture onto one side of the tortillas. I find it easiest to do all of them at once, before you start cooking them.",
            "Cook Tacos:Heat a skillet over medium high heat. Add the oil. Working in batches, add the tacos, meat-side down, and cook for 3-4 minutes until they are browned. Flip to the back side for 1 minute to get the tortillas a bit golden, and then finish with one more flip to being meat-side down to ensure it’s cooked through. (165 degrees for chicken and turkey, 160 for ground pork.)",
            "Top and Eat:Top with more fresh cabbage, cilantro or green onions, and your sauces of choice. Fold in half – it eats kind of like a hybrid between a taco and sandwich, but tastes like an eggroll. I *love* these with the gochujang sauce!"
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Boursin Appetizer with Pistachios and Honey",
        "LINK": "https://pinchofyum.com/boursin-appetizer-with-pistachios-and-honey",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "one 5.4 ounce wheel of Boursin cheese (I like the garlic herb flavor)\n1/2 cup roasted salted shelled pistachios, chopped or crushed (about 1/4 cup crushed)\n3-4 tablespoons hot honey (affiliate link)\ncrackers or apple slices for dipping"
        ],
        "INSTRUCTIONS": [
            "Prep (Optional):Let the Boursin come to room temperature for 15 minutes.(Optional – this just makes it easier to spread, dip, and eat.)",
            "Spread Cheese:Grab a pretty plate or platter – even just a nice dinner plate will work. Use the back of a spoon to press the Boursin onto the plate in an even layer.",
            "Add Toppings:Top with the pistachios. Drizzle with hot honey.",
            "Serve:Serve with crackers or apple slices. I like to throw a small spoon on the plate to make it easier to spread the dip on the crackers. It’s so good!"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Thai Shrimp Curry with Yummy Shallot Crispies",
        "LINK": "https://pinchofyum.com/thai-shrimp-curry-with-yummy-shallot-crispies",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 tablespoon avocado oil\n2 tablespoons red curry paste\n2 cloves garlic, minced (or 2 teaspoons garlic paste)\n1/2 inch piece ginger, grated (or 1 teaspoon ginger paste)\n2 cups veggies of choice (I use red pepper and green beans - see notes)\none 14-ounce can coconut milk\n1 lb. frozen shrimp, thawed (I like to use jumbo shrimp that are peeled with tails removed)\n1 tablespoon fish sauce\n1 tablespoon brown sugar\n3-4 tablespoons avocado oil\n2 shallots, thinly sliced into rings or strips\n1/2 cup panko breadcrumbs\n1/2 cup chopped cilantro and/or torn Thai basil"
        ],
        "INSTRUCTIONS": [
            "Make shallot crispies (optional): Heat the oil over medium heat in a large wide skillet. Add the shallots; sauté until golden, 5-10 minutes. Add panko and mix with the shallots in the pan; sauté another couple of minutes until the whole mixture is golden. Transfer to a small bowl. Toss with the herbs and a pinch of salt.",
            "Start the curry:Wipe the pan out. Turn the heat back on to medium. Add the oil, curry paste, garlic, ginger, and veggies; let it cook for a few minutes. Add coconut milk; simmer until the sauce has thickened slightly and veggies are starting to get tender, about 5 minutes.",
            "Add shrimp:Place the shrimp on top of the gently bubbling curry. The shrimp will basically just steam / poach in the liquid! Easy. After 2-3 minutes, flip the shrimp so they can finish cooking on the other side. When they’re done they’ll start to curl and be fully opaque – in this picture they’re about half done.",
            "Season:Stir in the fish sauce and brown sugar. Taste and adjust – make it more spicy with chili crisp, more salty with fish sauce, etc.",
            "You’re Done! Yum.Scoop the curry over some rice, and top with a little sprinkle of the shallot crispies (OMG)."
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Crispy Buffalo Tofu with Caesar Salad",
        "LINK": "https://pinchofyum.com/crispy-buffalo-tofu",
        "PREP_TIME": "17 minutes",
        "INGREDIENTS": [
            "16 ounce package of tofu (firm or extra firm)\n2 tablespoons cornstarch\n1 tablespoon soy sauce\n1 tablespoon avocado oil\n1 teaspoon paprika\n1/2 teaspoon garlic powder\n3 tablespoons butter\n1/4 cup hot sauce (like Frank's red hot)\nSalad with Caesar, ranch, or bleu cheese dressing (I especially love to throw this tofu on top of an avocado kale Caesar salad!)"
        ],
        "INSTRUCTIONS": [
            "Take the tofu out of the packaging and drain the water. Wrap it with a clean dish towel, or a few paper towels, and gently squeeze out some of the excess moisture. I spend less than a minute on this.",
            "Pull the tofu into bite-sized chunks. Toss with the cornstarch, soy sauce, oil, paprika, and garlic powder.",
            "When everything is well-coated, air fry at 400 degrees for 8 minutes. Shake or toss, then air fry for another 5-6 minutes until golden and crispy. (See notes for baking instructions.)",
            "Melt the butter and whisk with the hot sauce. Toss the crispy tofu in the sauce to coat.",
            "Dip in your favorite sauce or throw in a wrap, bowl, or salad! So yum!"
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Burger Bowls with House Sauce and Ranch Fries",
        "LINK": "https://pinchofyum.com/burger-bowls-with-house-sauce-and-ranch-fries",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 lb. ground beef (85/15 for the juiciest)\n2 teaspoons burger seasoning (one teaspoon per side)\nShredded lettuce\nDiced tomatoes\nDiced burger pickles\n1 22-ounce bag frozen waffle fries\n3 tablespoons butter\n1 1-ounce packet ranch seasoning mix (or 3 tablespoons)\n1/2 cup mayo\n2 tablespoons ketchup\n1 teaspoon horseradish\n1 teaspoon Worcestershire\n1/2 teaspoon paprika\n1 clove grated garlic"
        ],
        "INSTRUCTIONS": [
            "For the ranch fries:Bake the fries according to package directions. Add butter to the sheet pan and toss to get the fries kinda juicy. Then toss those juicy fries with ranch seasoning, adding more or less depending on how many fries you make, and your level of ranch obsession. Yummy.",
            "For the sauce:Whisk your sauce. Taste and season with salt. Or, use a store-bought burger sauce!",
            "For the beef:Heat a cast iron over high heat with no oil (use a well-seasoned pan). You want that pan to be very hot so it’ll sear the beef. Season one side of the ground beef with 1 teaspoon burger seasoning. Add the ground beef to the hot pan, seasoning side down (see video for how I did this straight from package). Resist the urge to break it up immediately –leave it undisturbedfor several minutes to get a nice browned crust. The fat will start to render and it should start to develop some browning.",
            "To finish the beef:Sprinkle the exposed side with the other teaspoon of seasoning. After a few minutes, flip the beef in large chunks – you want to break it up into fork-sized bits, but not too small – this just keeps it juicy and makes it more pleasant to eat with a fork. Once it’s well-browned, remove from heat.",
            "Assemble:Put it all together! The juicy burger crumbles, the ranch fries, the toppings, the house sauce. It’s SO yum."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Roasted Red Pepper Pasta",
        "LINK": "https://pinchofyum.com/roasted-red-pepper-pasta",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1/2 cup roasted red peppers (jarred, drained - 3-5 pieces)\n3/4 cup water\n1/2 teaspoon Better than Bouillon chicken or vegetable broth base\n2 tablespoons butter\n1 large shallot, sliced thinly on a mandoline\n3/4 cup heavy cream\n8 ounces pasta - my favorite is pennoni\n1/2 cup reserved pasta water (optional, as needed)\n1/4 cup Parmesan\nbasil leaves and/or red pepper flakes"
        ],
        "INSTRUCTIONS": [
            "Red Pepper Puree:Blend the red peppers, water, and broth base until smooth.",
            "Saute the Shallots:Heat a large skillet over medium heat. Add the butter and shallots; sauté until the shallots are lightly golden brown and caramelized, about 10-15 minutes.",
            "Cook Pasta:During this time, cook the pasta according to package directions, to al dente so the noodles can finish in the sauce.",
            "Combine Sauce:Turn the heat down to avoid splatters; add the red pepper puree and let it sizzle out for a moment. Then add the cream. Stir to combine; let it gently bubble for a few moments until it has thickened into a nice creamy sauce.",
            "Add Pasta:Add pasta into the sauce; let it simmer for a few moments to thicken and coat the noodles. If needed, add reserved pasta water to reach desired consistency.",
            "Yum.Serve immediately, topped with Parmesan, basil, and/or red pepper flakes. It’s so gooood."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Apricot Chicken with Charred Scallions",
        "LINK": "https://pinchofyum.com/apricot-chicken-with-charred-scallions",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "1 lb. boneless, skinless chicken breasts\n1 teaspoon kosher salt + 10 cracks of freshly ground pepper\n1/4 cup toasted sesame oil\n1/4 cup reduced-sodium soy sauce\n10 scallions, sliced in half lengthwise\n1/4 cup apricot preserves\na few tablespoons of chili crisp\nRice\nAny other vegetables - I like cucumbers"
        ],
        "INSTRUCTIONS": [
            "Preheat:Preheat the oven to 450 degrees. Place an oven rack in top 1/3 of oven.",
            "Prep Scallions:Cut the scallions in half lengthwise.",
            "Prep Chicken:Cut the chicken into thinner pieces horizontally. Place chicken on a sheet pan; season with salt and pepper. Drizzle sesame oil and soy sauce directly over the chicken.",
            "Add Scallions:Toss the scallions in some of the oil.",
            "Bake:Place the scallions on top of the chicken. Bake for 6 minutes on the rack that is in the top 1/3 of the oven.",
            "Broil:Turn the broiler on; broil for 1-2 minutes – the goal is to get the chicken cooked through (165 degrees) a small amount of charring on the scallions. There is tons of yummy flavor in those charred bits! Immediately spoon apricot jam and chili crisp over the top of each piece so it kind of melts in.",
            "Serve:Serve chicken and a tangle of the charred scallions with rice, spooning extra pan juices over the top (or just drizzling with extra sesame oil and soy sauce). Humble method, max flavor!"
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Chipotle Chicken with Chunky Pistachio Sauce",
        "LINK": "https://pinchofyum.com/chipotle-chicken-with-chunky-pistachio-sauce",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken thighs\n2 1/2 - 3 tablespoons taco seasoning (I use Siete Mild Taco Seasoning, a little more than half the packet)\n1/8 teaspoon chipotle powder (spicy! sub 1/4 tsp smoked paprika if you don't want it spicy)\n1 tablespoon olive oil\n1 large avocado, diced (more firm)\n1/2 cup roasted, salted pistachios\n1/2 cup packed cilantro\na small bundle of chives (.5 oz, a full package)\njuice and zest of one lemon\n1 tablespoon olive oil\n1/2 teaspoon kosher salt (more to taste)"
        ],
        "INSTRUCTIONS": [
            "Prep the Chicken:Trim the fat from the chicken thighs, if you want. Then toss the chicken with the spices and olive oil. You want them to be nicely coated with the spices.",
            "Cook Chicken:Heat the olive oil in a skillet orgrill pan(affiliate link)over medium high heat. Grill or saute the chicken, flipping once, until nice and browned on both sides with an internal temperature of 165 degrees.(See notes for alternate cooking methods.)",
            "Make the Sauce:While the chicken is cooking, use amini-chopper(affiliate link)or food processor to pulse the pistachios, cilantro, and chives until finely chopped.",
            "Finish Sauce:Add to a bowl with the avocado chunks, lemon juice and zest, olive oil, and salt. Stir it up – it’ll be thick, chunky, and a little bit irresistible.",
            "Serve:Cut the chicken into bite-sized pieces (makes it easier to build a bowl and eat)! Season with salt. Top with spoonfuls of the chunky pistachio sauce. I love this with rice and a salad. The flavors!! So good."
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Sheet Pan Salmon with Dill Potatoes",
        "LINK": "https://pinchofyum.com/sheet-pan-salmon-with-dill-potatoes",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "24 ounces yukon baby gold potatoes\n1 1/2 tablespoons olive oil\n1 1/2 teaspoon kosher salt\n1/2 cup water\n3 tablespoons butter, melted\n1 clove garlic, grated\n1 tablespoon freeze dried dill, or 3 tablespoons fresh dill\n1.5 pounds salmon filet (I use skin-on)\n3 tablespoons Dijon\n2 tablespoons mayo\nred pepper flakes, more dill, lemon wedge for serving"
        ],
        "INSTRUCTIONS": [
            "Prep the Potatoes:Preheat the oven to 450 degrees. Toss potatoes, oil, and salt on a sheet pan. Add water directly to the pan.",
            "Roast the Potatoes:Roast potatoes for 30 minutes. I recommend stirring every 10-15 minutes to prevent sticking. During this time the water will evaporate / steam the potatoes, and they will get beautifully golden at the same time.(Some sticking is normal and okay – just use a good spatula to firmly get under the potatoes and lift them to keep them all moving around and roasty toasty.)",
            "Prep the Salmon:Move potatoes to the side. Add the salmon filet in one piece to the center of the sheet pan, skin side down. Season with 1/2 teaspoon salt. Mix the mayo and Dijon in a small dish; spread over the top to cover. Bake for 6 minutes. Then broil close to the top of the oven for 2-3 more minutes to get browning on the salmon. You want to bake it until it flakes apart easily – see notes.",
            "Garlic Butter:Mix the melted butter, grated garlic, and dill; spoon over the hot potatoes. Sprinkle the salmon with dill and red pepper flakes.",
            "You’re Done!Squeeze lemon over the whole thing. Flake big chunks of salmon off to serve with the potatoes. Unreal."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "The Best Carrot Cake Cupcakes with Cream Cheese Frosting",
        "LINK": "https://pinchofyum.com/best-carrot-cake-cupcakes-with-cream-cheese-frosting",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "3/4 cup canola oil (see notes)\n1 cup packed brown sugar (190 grams)\n1 1/2 teaspoons vanilla\n2 eggs\n2 medium carrots, peeled, grated, and chopped (180 grams - about 1 1/2 cups)\n1 cup + 2 tablespoons flour (160 grams)\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1 1/4 teaspoon ground cinnamon\n1/4 teaspoon ground ginger (optional)\n3/4 teaspoon salt (I use table salt)\n5 ounces cream cheese, softened\n5 tablespoons butter (I prefer salted butter), softened\n2 1/2 cups powdered sugar\n1 teaspoon vanilla extract"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 350 degrees. Grease a muffin tin with nonstick spray.(I like these without paper liners – they get a perfect ridged edge and nice little domed top, plus a chewier edge!)",
            "Carrots:Grate the carrots, and then roughly chop them into smaller, papery bits. You can also do this in the food processor, but when compared side by side I liked the grated and chopped version better.",
            "Cupcake Batter: Whisk the oil, brown sugar, eggs, and vanilla together until combined. Fold in the carrots. Mix in the dry ingredients until just combined.",
            "Bake:Fill each muffin tin about two thirds of the way full with batter. Bake for 16-17 minutes. Gently press on the centers – if they spring back, they’re done. If not, give them another 2-3 minutes. (Using paper liners will require closer to 19 minutes.)",
            "Cream Cheese Frosting:Using an electric mixer, beat the softened butter and cream cheese together until smooth. Add the powdered sugar and vanilla; mix until smooth. It should be structured enough for piping, but if it’s not, just pop it in the fridge for a moment to solidify.",
            "Frost and Enjoy:Pipe the frosting on top of the cooled cupcakes; serve immediately or store in the fridge. (They’re also great a day later!)"
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Crispy Gochujang Chicken",
        "LINK": "https://pinchofyum.com/crispy-gochujang-chicken",
        "PREP_TIME": "35 minutes",
        "INGREDIENTS": [
            "1 lb. chicken breasts\n1 teaspoon kosher salt and freshly ground pepper to taste\n1/2 cup flour\n2 eggs + 1/2 tablespoon gochujang sauce\n2 cups panko\navocado oil spray\n4 tablespoons butter\n1 clove grated garlic\n1 1/2 tablespoons gochujang sauce (I use Bibigo brand)\nsalt to taste\nYum Yum sauce for dipping (I will never complain about double sauce)"
        ],
        "INSTRUCTIONS": [
            "Chicken:Cut each chicken breast into thinner pieces. Start by cutting the tenderloin piece off the back. Then slice the breast in half horizontally, or into thirds if it’s a very thick piece. Season the chicken with salt and pepper.",
            "Bowls:Prep three bowls for your breading. 1: the flour. 2: the eggs and gochujang. 3: the panko. Season the panko and flour bowls with an extra 1/2 teaspoon salt.",
            "Breading:Dip the chicken in the flour; shake off excess. Dip into the egg mixture; let excess drip off. Press into the panko on both sides until coated.",
            "Cook:Spray each chicken piece with avocado oil to coat the top surface. Air fry at 375 degrees for 5 minutes, and then at 400 degrees for another 2-3 minutes to get it golden. (Alternate cooking methods in the notes.)",
            "Sauce:Whisk the melted butter, gochujang, and grated garlic in a small bowl. Use a brush to coat each piece of crispy chicken with sauce.",
            "Finish:Slice the chicken up and bring it out to the table on a platter or just directly on the cutting board. Serve it with whatever veggies you have in the fridge. I LOVE this dipped in yum yum sauce!"
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Crispy Chicken Cutlets",
        "LINK": "https://pinchofyum.com/crispy-chicken-cutlets",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken breasts\n1 teaspoon salt + freshly ground pepper to taste\n1/2 cup flour\n2 eggs, beaten\n1 tablespoon hot sauce like Frank's red hot (a few shakes, optional)\n2 cups panko breadcrumbs\navocado oil spray\nmore salt :)"
        ],
        "INSTRUCTIONS": [
            "Prep:Slice each chicken breast into 3 thin pieces – start by cutting the tenderloin piece off the back, then cut the remaining chicken breast in half horizontally. Season the chicken with salt and pepper.",
            "Three Bowls:Use a wide, shallow bowl for each of the following: 1) flour. 2) eggs + hot sauce. 3) panko. Season the flour and panko bowls with 1/2 teaspoon salt.",
            "Dip and Coat:Dip the chicken into the flour; shake off excess. Dip into the egg mixture; let the excess drip off. Press into the panko, turn it a few times, pressing gently, until fully coated. Transfer to a plate. Repeat for all pieces. Spray each piece with avocado oil spray so it’ll get nice and evenly golden for ya.",
            "Cook It Up:Air fry in a single layer at 375 for 6 minutes, then 400 degrees for 2-3 minutes for extra browning. You want an internal temp of at least 165 degrees. I do it in two batches.(Alternate methods listed in the notes.)",
            "You’re done!Hot, crunchy, salty, juicy, thin and delicious. Perfect dipped or brushed with just about any sauce. We love it."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Ridiculously Good Air Fryer Broccoli",
        "LINK": "https://pinchofyum.com/air-fryer-broccoli",
        "PREP_TIME": "9 minutes",
        "INGREDIENTS": [
            "one 12-ounce bag broccoli florets (or, one head of broccoli cut into about 3 cups of florets)\n2 tablespoons water\n1-2 tablespoons avocado oil or olive oil\n1 teaspoon coarse kosher salt"
        ],
        "INSTRUCTIONS": [
            "Prep The Broccoli:Place florets in a bowl. Add water, oil, and salt. Break into bite-sized pieces and massage gently for 30-60 seconds, until the broccoli turns a slightly brighter green. You want to get it to drink up some of that water and oil mixture a bit!",
            "Cook:Add broccoli to your air fryer. (There will still be a bit of water left over in the bowl; that’s fine.) Air fry at 350 for 5 minutes; give it a quick shake. It should look bright green, like steamed broccoli.",
            "Crisp It Up:Air fry at 375 for another 2 minutes. Now it should start to look browned, crisped, and roasty toasty.(You can adjust the time and temp toget your desired level of crispness).",
            "Finish:You’re done! Yum! It’s fluffy and tender, but crisped and browned at the same time. I love this with a dipping sauce or just sprinkled with a bit of Parmesan."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Whipped Feta Spread",
        "LINK": "https://pinchofyum.com/whipped-feta-spread",
        "PREP_TIME": "5 minutes",
        "INGREDIENTS": [
            "6 ounces feta cheese\n4 ounces cream cheese\n1/4 cup Greek yogurt\n2 tablespoons olive oil + 2 tablespoons water as needed\na clove of fresh garlic\na pinch of fresh or freeze-dried dill (yummy)\na squeeze of lemon juice"
        ],
        "INSTRUCTIONS": [
            "Blend:Place everything in a small blender or food processor. Pulse until smooth and spreadable, with some flecks of feta remaining.",
            "You’re Done!Serve on sandwiches, wraps, salads, bowls, burgers, or as a dip! This stuff is delicious."
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "My New Favorite Pizza Has a Cottage Cheese Crust",
        "LINK": "https://pinchofyum.com/my-new-favorite-pizza-has-a-cottage-cheese-crust",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "1 cup cottage cheese\n1 cup flour + a few tablespoons for dusting\n1 teaspoons baking powder\n1 teaspoons coarse kosher salt\n1-2 tablespoons olive oil\n1/4 to 1/3 cup sauce (I've been using Rao's marinara)\n1/3 to 1/2 cup shredded mozzarella cheese\n1/4 to 1/2 cup grated Parmesan cheese"
        ],
        "INSTRUCTIONS": [
            "Preheat:Preheat the oven to 450 degrees andplace a rack at the highest position, near the top.",
            "Prep Cottage Cheese:Blend the cottage cheese until smooth.",
            "Make Dough for Crust:Place blended cottage cheese in a bowl; mix with the flour, baking powder and salt until a dough starts to come together. It will start to get kind of shaggy, crumbly, and sticky – use your hands to really bring it together. I usually turn it out on the counter and give it a few squishes, coating with a bit of extra flour, to make it into a cohesive ball.",
            "Form The Crust:Place a sheet of parchment on a pizza pan or baking sheet. Place the dough on the parchment and press into a circle that is about 10-12 inches in diameter. It is a pretty bready crust, so you want to really press it out into a thinner, wider surface area.",
            "Prep The Crust:Rub the top of the crust with olive oil.",
            "Pre-Bake The Crust:Place in the oven; bake (no toppings) for 8-10 minutes.",
            "Add Sauce and Cheese:Remove from oven. Spread with sauce and top with the two cheeses. Bake on that same top rack for another 5 minutes to melt the cheeses.",
            "Broil and Finish:Finally, broil for 2-3 minutes until the cheese and crust edges are deeply golden, like the picture. I like to sprinkle the slices with red pepper flakes, drizzle with olive oil or hot honey, and dip into more sauce! It’s too good!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Mixed Berry Muffins with Sugary Tops",
        "LINK": "https://pinchofyum.com/mixed-berry-muffins-with-sugary-tops",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "3/4 cup coconut oil, melted (see notes)\n1/2 cup brown sugar\n1/4 cup maple syrup\n1/4 cup plain Greek yogurt\n2 eggs\n1 1/2 teaspoons vanilla\n2 cups flour (280 grams)\n2 1/2 teaspoons baking powder\n1/2 teaspoon baking soda\n1 teaspoon fine kosher salt (such as Diamond Crystal)\n2 cups frozen mixed berries (I use the triple berry blend from Costco)\n1/4 cup turbinado sugar for topping (brown sugar also works)\n4 tablespoons softened salted butter\n1/4 cup honey"
        ],
        "INSTRUCTIONS": [
            "Make the Muffin Batter:Preheat the oven to 400 degreses. Whisk the coconut oil, brown sugar, maple syrup, yogurt, eggs, and vanilla together until smooth. Add the flour, baking powder, baking soda, and salt. Stir to form a soft dough.",
            "Thaw the Berries:Microwave 2 cups frozen berries for one minute. Transfer thawed berries to a fine mesh strainer; gently rinse the berries with warm water for 15-30 seconds to wash off the excess colored juices. I like to tap the side of the strainer to get even more water out. The berries will reduce in volume and you’ll be left with about 1 cup of thawed berries.",
            "Add Berries to Muffin Batter:Gently fold the berries into the muffin batter. (There shouldn’t be much excess juice going into the bowl with the thawed berries.) Give it just a few stirs so you incorporate the berries – they’ll get a little mashed, but you want to keep about half of the berries intact.",
            "Top with Sugar:Grease a muffin tin with butter or nonstick baking spray (I prefer this over paper liners). Divide the batter between 9-10 muffin cups, and top with a spoonful of turbinado sugar.",
            "Bake:Bake the muffins for 14-16 minutes, in the middle to top of the oven. Remove from oven and let cool slightly before using a knife to gently release and pull each one out of the muffin tin.",
            "You’re Done! Yum!If you want to serve these with honey butter, which I think you do – just stir the softened butter with the honey until incorporated. Spread it on a warm muffin and live your best life!"
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Sweet Potato Soup with Roasted Cauliflower Crumbles",
        "LINK": "https://pinchofyum.com/sweet-potato-soup-with-roasted-cauliflower-crumbles",
        "PREP_TIME": "1 hour 5 minutes",
        "INGREDIENTS": [
            "1 red onion, cut into large chunks or slices\n3 sweet potatoes, cut into chunks (about 6 cups)\n2 tablespoons avocado oil or olive oil\n1 teaspoon coarse kosher salt\n6 cups vegetable broth (see notes)\n1/2 inch knob of fresh ginger\n1/2 cup macadamia nuts or cashews\n4-6 cups cauliflower florets\na small bundle of chives, chopped\nlemon wedges\na drizzle of infused oil (I like a spicy chili oil)"
        ],
        "INSTRUCTIONS": [
            "Preheat Oven:Preheat the oven to 425 degrees.",
            "Roast Soup Vegetables:Place sweet potatoes and onions on a sheet pan; drizzle with oil, sprinkle with salt. Roast in the oven for 30-45 minutes, until golden brown and softened.",
            "Roast Cauliflower:At the same time, place the cauliflower florets on a second sheet pan, toss with 1 tablespoon oil and 1 teaspoon salt. Roast in the oven for 30 minutes (I just tuck it underneath the sweet potatoes and onions).",
            "Crumble Cauliflower:Break up the cauliflower into smaller bits using the back of a wooden spoon or spatula. Return to the oven for 10-15 minutes to get extra browned.",
            "Blend Soup:Allow the sweet potatoes and onions to cool slightly. Working in two batches, transfer the sweet potatoes and onions to a blender. Add broth, ginger, and macadamia nuts; puree until very smooth.",
            "Serve:Taste and adjust for salt. Serve the soup topped with the roasted cauliflower bits, a sprinkle of chives, a drizzle of oil, and a squeeze of lemon juice. It’s sensory and beautiful! I love this soup!"
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "French Toast Crepes",
        "LINK": "https://pinchofyum.com/french-toast-crepes",
        "PREP_TIME": "15 minutes",
        "INGREDIENTS": [
            "3 eggs\n1 tablespoon maple syrup\n1-2 tablespoons of heavy cream\ndash of cinnamon\n7-10 almond flour tortillas (I love the Siete ones!)"
        ],
        "INSTRUCTIONS": [
            "Make Batter:Whisk together the eggs, maple syrup, cinnamon, and cream if using.",
            "Fry The Crepes:Dip a tortilla in the batter so it’s covered on both sides, and fry in a pan over medium heat until cooked. Repeat for each tortilla.",
            "Serve:Fold and eat with maple syrup, or roll up with yogurt and jam in the middle."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Buffalo Chicken Burgers with Whipped Feta Spread",
        "LINK": "https://pinchofyum.com/buffalo-chicken-burgers-with-whipped-feta-spread",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. ground chicken\n1/2 cup panko breadcrumbs\n1/3 cup hot sauce (I used Frank's Red Hot)\n1/2 teaspoon garlic powder\n1/2 teaspoon salt\n6 ounces feta cheese (block or crumbles)\n4 ounces cream cheese\n1/4 cup Greek yogurt\n2 tablespoons olive oil\n2 tablespoons water\n2 tablespoons melted butter + 2 tablespoons hot sauce for brushing\nBuns\nLettuce"
        ],
        "INSTRUCTIONS": [
            "Make the Whipped Feta:Blend all the ingredients together in a small food processor until it incorporates into a thick and spreadable texture with flecks of feta.",
            "Mix the Burgers:In a medium bowl, mix the burger ingredients together. Form into 4-5 patties.",
            "Cook the Burgers:Heat a small bit of oil in a large nonstick skillet over medium high heat. Add burgers and cook for 3-4 minutes per side, until golden brown and the inside of the burgers is fully cooked (165 degrees).",
            "Brush with Butter:As the burgers are finishing cooking, brush the outside with the melted butter and hot sauce mixture.",
            "Finish:Arrange your burgers on buns with lettuce and a shmear of the whipped feta. SO GOOD."
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Crockpot Chicken Bowls with Yellow Rice and Cilantro Pesto",
        "LINK": "https://pinchofyum.com/crockpot-chicken-bowls-with-yellow-rice-and-cilantro-pesto",
        "PREP_TIME": "3 hours 20 minutes",
        "INGREDIENTS": [
            "1 lb. chicken breasts\n8 ounces of a simmer sauce or enchilada sauce that you like (see notes for my recs)\n1 tablespoon cornstarch whisked into 1-2 tablespoons water\nextra seasoning to taste - I often add a few shakes of chipotle powder, salt, and pepper\n1 cup white rice\n1 1/2 cups water\n1 tablespoon butter\n1/2 teaspoon salt\n1/2 teaspoon chili powder\n1/8 teaspoon turmeric\n1 1/2 cups cilantro leaves\n1/2 jalapeño, ribs and seeds removed\n1 clove garlic\njuice and zest of 1 lime\n1/4 cup olive oil or avocado oil\n1/2 cup roasted salted pistachios\nPickled onions (a must for me, every time)\nSour cream and/or your favorite salsa (see notes)\nA salad mix"
        ],
        "INSTRUCTIONS": [
            "For the Crockpot Chicken:Put the chicken in a slow cooker and cover with sauce; cook for 2 1/2 – 3 hours on high. Shred chicken directly in the slow cooker. Add the cornstarch slurry to thicken the sauce. Season to taste.",
            "For the Rice:Rinse the rice in a fine mesh colander. Add the rice, water, butter, salt, chili powder, and turmeric to a small saucepan. Bring to a boil. Cover, reduce heat, and cook for 15 minutes. Remove the cover, fluff it up, and season to taste.",
            "For the Cilantro Pesto:Blend everything up in a small chopper or food processor until smooth-ish (I leave some texture in mine)! It’ll be a very thick sauce, which I love – you can add water as desired to thin it out.",
            "Build Your Bowls:I love the combination of the yellow rice with a scoop of chicken, some salad greens, pickled onions, and a dollop of that cilantro pesto on top!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Cilantro Pesto",
        "LINK": "https://pinchofyum.com/cilantro-pesto",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 bunch cilantro (1.5 - 2 cups - I just cut the top off of the bunch that I buy from the store)\n1/2 jalapeño, ribs and seeds removed\n1 clove garlic\njuice and zest of 1 lime\n1/4 cup olive oil or avocado oil\n1/2 cup roasted salted pistachios\nsalt to taste"
        ],
        "INSTRUCTIONS": [
            "Blend all ingredients in a small food processor, chopper, or blender until it reaches your desired consistency! I like to leave it a little bit textured / chunky.",
            "Enjoy! I like this on top of bowls, soups, pizza, eggs, sandwiches, and wraps… it’s good on just about everything. Store it in the fridge in an airtight container for 3-4 days."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Thai Peanut Chicken Bowls",
        "LINK": "https://pinchofyum.com/thai-peanut-chicken-bowls",
        "PREP_TIME": "45 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken breasts or thighs, cut into thin slices\n8-ounce jar Thai peanut satay sauce (from Trader Joe's)\n1 clove grated garlic\n2 cups thinly sliced cucumber (1 large English cucumber)\n1/2 cup thinly sliced red onion (about 1/4 an onion)\n2 tablespoons avocado oil\n1 tablespoon vinegar\nsalt and sugar to taste\n4 ounces vermicelli noodles\na few tablespoons of crushed peanuts\na few sprigs of herbs - I like mint, cilantro, and basil because I'm an herb hog!"
        ],
        "INSTRUCTIONS": [
            "Marinate the Chicken:Marinate the chicken with half the jar of sauce and the garlic for about 30 minutes to an hour.",
            "Cucumber Salad:Meanwhile, toss the cucumbers, onions, oil, vinegar, salt and sugar together.",
            "Cook the Chicken:Heat a small amount of oil in a nonstick pan over medium heat; add chicken, let it sit undisturbed for a few minutes to caramelize, then flip and repeat until the chicken is cooked through and golden brown. To caramelize it further, you can add a pinch of sugar towards the end.",
            "Make a Bowl:Serve the chicken over rice noodles, with some of the cucumber salad, fresh herbs, and peanuts.",
            "Sauce:Using your remaining sauce, add a bit of water, soy sauce, or chili oil to the jar to thin it out into more of a dressing. Drizzle over the bowls and dive into that."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Gingery Cranberry Salsa",
        "LINK": "https://pinchofyum.com/gingery-cranberry-salsa",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 12-ounce bag of fresh cranberries\n1/3 cup sugar\nhalf of a jalapeño, ribs and seeds removed (see notes)\none 1-inch knob of fresh ginger root, peeled\n1 clove garlic\n1/2 cup fresh cilantro leaves\n1/2 cup fresh parsley leaves\njuice and zest of 1-2 limes (to taste)\n1/2 teaspoon salt (more to taste)\n1/2 cup salted roasted pistachios (optional)"
        ],
        "INSTRUCTIONS": [
            "Chop Cranberries:Blitz cranberries in a food processor until broken down into a very finely chopped texture, being careful not to overly-chop or puree them. Transfer to a bowl.",
            "Combine with Sugar:Toss cranberries with sugar.",
            "Chop Aromatics and Mix:Add jalapeño, ginger, garlic, and cilantro to the food processor; pulse until finely chopped. Mix into the cranberry bowl; add lime juice, zest, and salt.",
            "Let It Rest (Optional):Let the salsa rest for 12-24 hours, if you can! This helps the cranberries tenderize and get super juicy, and the flavors will all come together so well!",
            "Also Optional:add pistachios to the same food processor, pulse until finely chopped, and add to the cranberry salsa just before serving."
        ]
    },
    {
        "NUMBER": "1",
        "TITLE": "Deb’s Ranch Crackers",
        "LINK": "https://pinchofyum.com/debs-ranch-crackers",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 bag of oyster crackers (9-10 ounces)\n1 packet of ranch seasoning (I use the 1-ounce packet of Hidden Valley ranch)\n1/2 cup vegetable oil, or 1/2 cup butter, melted and cooled (see notes)\n1 teaspoon dried dill (2 teaspoons if you love dill like I do)"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 250 degrees.",
            "Whisk the ranch seasoning, oil, and dried dill together.",
            "Pour mixture over the oyster crackers in a large bowl. Stir gently to combine. (Taste and adjust at this point and make them your own! Add some red pepper flakes, extra garlic or onion powder, etc.)",
            "Transfer to a sheet pan; bake for 15-20 minutes until dried. You’re done! They’re SO GOOD."
        ]
    },
    {
        "NUMBER": "2",
        "TITLE": "Dulce De Leche Tiramisu",
        "LINK": "https://pinchofyum.com/dulce-de-leche-tiramisu",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "6 egg yolks\n3/4 cup granulated sugar\n1 1/2 cups mascarpone (see notes)\n1 1/2 cups heavy cream\n1/4 cup + 2 tablespoons dulce de leche (I use this canned dulce de leche, which I buy at Target or Cub Foods)\npinch of salt to taste\ntwo 4.4-ounce boxes of soft ladyfingers (I am very loyal to St. Michel soft ladyfingers - absolutely perfect with a little sugar crunch on top)\n2 cups strong coffee or espresso (can be decaf but highly recommend that it is rich, dark, and strong)\n1/2 cup cocoa powder\nchocolate bar for shaving / topping"
        ],
        "INSTRUCTIONS": [
            "Mix Bowl 1:Mix egg yolks and sugar with electric mixer until smooth. The mixture should “ribbon” off the end of the beaters in a silky, steady stream. Make it look smooth and creamy, basically. Add the mascarpone cheese and beat again until combined.",
            "Mix Bowl 2:Beat the heavy whipping cream on high for 1-2 minutes until you get whipped cream. Add dulce de leche, mix again, and add a pinch of salt to taste.",
            "Combine Bowls:Fold whipped cream into the egg and mascarpone mixture. WARNING: IT WILL BE DIVINE.",
            "Pan Prep:Grab an 11×7 pan (a 9×13 will work, as will honestly any shape or size of pan, but 11×7 is my favorite). Use a fine mesh strainer to dust the bottom of your pan with cocoa powder. This helps absorb excess moisture from the espresso so it doesn’t get too wet.",
            "Layer:Dip ladyfingers very briefly in the espresso; turn to coat (I give a slow count of 3 while flipping each one – back side, front side, back side again and remove). You don’t want these in the espresso for a very long time or the whole thing will fall apart. Ladyfingers should cover the bottom of the pan. Layer half the creamy mixture on top of the ladyfingers; repeat ladyfingers layer, then finish with the rest of the creamy layer. Finish with a dusting of cocoa powder again, and/or shaved chocolate.",
            "Fridge:Cover with plastic and transfer to the fride. Let it set for 4 hours minimum, but ideally 12-24 hours.",
            "You’re Done!Yum! Cut and serve straight out of the fridge. Finish slices with more cocoa powder or chocolate shavings on top if you want. Absolutely incredible."
        ]
    },
    {
        "NUMBER": "3",
        "TITLE": "Lemon Rosemary Chicken Soup",
        "LINK": "https://pinchofyum.com/lemon-rosemary-chicken-soup",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1/4 cup olive oil, divided\nhalf an onion, finely chopped\n3 carrots, finely chopped\n3 ribs celery, finely chopped\n3 cloves garlic, minced\n1/2 teaspoon Italian seasoning\n2 sprigs fresh rosemary and/or 2 sprigs fresh thyme\n1 teaspoon coarse kosher salt\n1 can cannellini or navy beans, rinsed and drained\n3 cups shredded kale\n2-3 cups cooked shredded chicken or turkey (see notes)\n5 cups chicken broth (I like the Better Than Bouillon broth base, or bone broth)\njuice of two lemons\nsalt and pepper to taste\ngrated Parmesan, bread, and butter for serving"
        ],
        "INSTRUCTIONS": [
            "Saute Veggies:In a large soup pot, heat 1 tablespoon oil over medium high heat. Add onion, carrots, and celery. Saute for 5-8 minutes or until very soft.",
            "Add Aromatics:Add the garlic, Italian seasoning, rosemary sprigs, thyme sprigs, and salt. Let it get nice and delicious for a minute, stirring to avoid burning or browning the garlic.",
            "Simmer:Add the beans, kale, chicken, broth, and remaining olive oil (optional). Bring to a low simmer for 10-20 minutes, until the kale is wilted. If you have time to cook it for a while longer over low heat, great. Delicious.",
            "Finish:Pull out the herb stems. Add lemon juice, more salt, fresh black pepper to taste (all optional and to taste)! Top with parm and serve with a thick slice of bread, a thick shmear of butter, and a pinch of rosemary salt. Fresh, bright, yummy!"
        ]
    },
    {
        "NUMBER": "4",
        "TITLE": "Brussels Sprouts with Gochujang Butter",
        "LINK": "https://pinchofyum.com/brussels-sprouts-with-gochujang-butter",
        "PREP_TIME": "30 minutes",
        "INGREDIENTS": [
            "12 ounces shaved brussels sprouts\n1 tablespoon avocado or olive oil\n1/4 teaspoon salt\n3/4 cup walnuts, roughly chopped\n1/4 cup dried cranberries\n4 tablespoons salted butter, softened\n1 1/2 tablespoons gochujang sauce, like this one (Bibigo)\n2 teaspoons toasted sesame oil\n2 teaspoons brown sugar (optional)\n1 small clove garlic, grated\n1/2 teaspoon soy sauce"
        ],
        "INSTRUCTIONS": [
            "Preheat the oven to 425 degrees.",
            "Mix up the butter ingredients – this can be done in advance and the mixture just wait for you in the fridge.",
            "Arrange the brussels on a sheet pan. Drizzle with the oil and salt and toss to coat. Roast for 15-20 minutes, until golden, crispy, and tender.",
            "Add the walnuts; return to the oven for 3-5 minutes to get the walnuts toasted. Remove from the oven.",
            "Add the cranberries and butter while the pan is still warm; toss to combine.",
            "You’re done! Yum! The butter will melt and coat every nook and cranny. It’ll smell amazing and it’s such a delight to eat!"
        ]
    },
    {
        "NUMBER": "5",
        "TITLE": "Incredible Arancini",
        "LINK": "https://pinchofyum.com/incredible-arancini",
        "PREP_TIME": "1 hour 45 minutes",
        "INGREDIENTS": [
            "4 tablespoons butter, divided\nhalf of a yellow onion, finely diced\n4 garlic cloves, thinly sliced or minced\n1 cup arborio rice (DeLallo is the best!)\n1 teaspoon kosher salt\n1/2 cup dry white wine\n3 1/2 cups chicken broth, warmed (see notes)\n1 cup grated Parmesan cheese\na bit of lemon zest (1-2 teaspoons)\n1/4 cup heavy cream\npepper to taste\na block of low moisture Mozzarella cheese, cut into small cubes\n2 cups panko, crushed in a food processor (optional on the crushing but it makes for a finer crisp)\n1/2 cup flour\n2 eggs, whisked\nvegetable oil or canola oil for frying\nYour favorite store-bought tomato sauce, or arrabbiata sauce for something spicy."
        ],
        "INSTRUCTIONS": [
            "Start The Risotto:Melt 2 tablespoons butter in a large skillet. Sauté the onion and garlic until translucent. Add the arborio rice and salt; let it toast a bit to turn lightly golden brown.",
            "Simmer The Risotto:Add the wine; let it sizzle out. Add the broth, about one cup at a time, stirring gradually as you let it simmer. We want the liquid to be absorbed slowly after each addition. This process will take about 15-20 minutes and you’ll be left with something that looks like slightly creamy rice.",
            "Make It Creamy and Cheesy:Add the remaining 2 tablespoons butter, Parmesan, lemon zest, cream, and pepper to taste. IT’S DELICIOUS ALREADY. Try not to eat the whole thing.",
            "Chill:Spread the risotto onto a baking sheet lined with parchment paper. Chill for about an hour.",
            "Form Into Balls:Take a small piece of the chilled risotto and press it into your palm. Tuck a cube or two of mozzarella cheese in there, and wrap the risotto around it into a ball.",
            "Dredge Risotto Balls:Dip the balls into the flour (shaking off excess), then the eggs, then the panko.",
            "Fry The Arancini:Heat the oil (3-5 cups depending on pan size) over medium high heat. When the oil is hot (350 degrees is ideal if you have a thermometer), add the arancini. It should bubble a bit and start to turn golden brown. Flip and brown on the other side.",
            "Finish and Serve:Place on paper towel lined plates to drain excess oil. Sprinkle with salt. Dip in your sauce of choice and OH MY GOODNESS they are so so so good. Your efforts paid off."
        ]
    },
    {
        "NUMBER": "6",
        "TITLE": "Bang Bang Salmon with Avocado Cucumber Salsa",
        "LINK": "https://pinchofyum.com/bang-bang-salmon-with-avocado-cucumber-salsa",
        "PREP_TIME": "22 minutes",
        "INGREDIENTS": [
            "1 1/2 pounds salmon filet\n1-2 tablespoons all-purpose seasoning mix (this is the one I use - see notes for homemade)\n1/4 cup mayo\n2 tablespoons sweet chili sauce\n1 clove garlic, grated\n1 teaspoon soy sauce\nchili crisp for topping\nCooked rice\nSome kind of vegetable - I like a little avocado cucumber salsa which you can find in the notes below!"
        ],
        "INSTRUCTIONS": [
            "Prep the Salmon:Preheat oven to 400 degrees. Cut the salmon into individual portions if you want. Pat the salmon dry. Coat the salmon with the spice mix. Place salmon on a parchment-lined baking sheet.",
            "Make the Bang Bang Sauce:Mix mayo, sweet chili sauce, garlic, and soy sauce in a small bowl. Set half of it aside for after baking.",
            "Bake the Salmon:Spread a small spoonful of sauce over the seasoned salmon pieces. Bake for 10 minutes towards the top of the oven. Then turn the broiler on for another 2-3 minutes, until your salmon looks golden brown and a bit caramelized on top.",
            "Serve:Serve the salmon over rice, with a vegetable of choice, and the reserved bang bang sauce + chili crisp drizzled over top! So easy and so good."
        ]
    },
    {
        "NUMBER": "7",
        "TITLE": "Scallion Pancake with Eggs",
        "LINK": "https://pinchofyum.com/scallion-pancake-with-eggs",
        "PREP_TIME": "10 minutes",
        "INGREDIENTS": [
            "1 scallion pancake\na spritz of avocado oil, or a small pat of butter\n1 handful of spinach\n1-2 eggs\nsalt and pepper\nhalf an avocado\nchili crisp to taste"
        ],
        "INSTRUCTIONS": [
            "Fry your scallion pancake in the oil until golden on both sides. Remove from the pan and set aside. (I use a nonstick pan for this.)",
            "In the same pan, add a handful of spinach to wilt it down. When it’s softened, scoot it towards the center of the pan so the scallion pancake will catch all of it when you put it back down.",
            "Add the eggs; fry until the whites have started to set. Use a spatula to break the yolks and spread gently. Before the eggs are fully cooked, squish the scallion pancake on top of the eggs so it sticks to them as they finish cooking.",
            "Remove from heat, fill with toppings of choice (cheese, avocado, sauces, chili crisp is a good move). Roll it up and slice it in half and GO TO TOWN! These are amazing."
        ]
    },
    {
        "NUMBER": "8",
        "TITLE": "Homemade Alfredo Sauce",
        "LINK": "https://pinchofyum.com/homemade-alfredo-sauce",
        "PREP_TIME": "12 minutes",
        "INGREDIENTS": [
            "1/2 cup butter\n3 cloves garlic\n1/2 cup chicken or vegetable broth\n1 cup heavy cream\n1 cup finely grated Parmesan cheese\nsalt and pepper to taste\nPasta of choice! I love this with DeLallo fettuccine or egg pappardelle - this amount of sauce works well with about 8 ounces of pasta"
        ],
        "INSTRUCTIONS": [
            "Melt butter in a large saucepan. Keep the heat very low, and add garlic cloves to butter. Cook until fragrant – about 5 minutes. (If you’re serving this with pasta, start that now! Don’t forget to add a generous pinch of salt to the water!)",
            "Remove garlic cloves from the butter. Add heavy cream and broth, and bring to a very gentle simmer. Whisk to incorporate. Simmer over low heat for 3-5 minutes, or until slightly thickened.",
            "Add Parmesan to the sauce. Whisk in until fully melted and thickened. Taste and add salt and pepper as needed.",
            "Toss with the pasta and keep over low heat until the sauce is clinging to the pasta the way you want! Or spoon the sauce over a protein and/or veg of choice. SO LUSCIOUS!"
        ]
    },
    {
        "NUMBER": "9",
        "TITLE": "Sticky Gochujang Tofu with Herbs and Peanuts",
        "LINK": "https://pinchofyum.com/sticky-gochujang-tofu-with-herbs-and-peanuts",
        "PREP_TIME": "40 minutes",
        "INGREDIENTS": [
            "1 16-ounce block extra firm tofu - ideally the kind that comes vacuum-packed\n1 tablespoon avocado oil\n2 teaspoons cornstarch\n1/2 teaspoon kosher salt, and pepper to taste\n3 tablespoons gochujang sauce (see note 1)\n2 tablespoons sesame oil\n2 tablespoons soy sauce\n2 tablespoons peanut butter\n1 teaspoon garlic powder\n1-2 tablespoons water as needed\nRice\nCilantro, green onion, and/or peanuts as a garnish\nCucumber, or other veggies for the bowl"
        ],
        "INSTRUCTIONS": [
            "Prep:Preheat the oven to 400 degrees. Press the tofu a few times with paper towels (if you use the vacuum-packed kind, this is hardly necessary at all – yay!). Tear the tofu into rough chunks.",
            "Tofu:Put the tofu chunks in a nonstick square baking dish, or a sheet pan lined with parchment. Add the oil, cornstarch, salt, and pepper directly to the pan; shake or toss to coat.",
            "Bake:Bake tofu for 15 minutes. Give it a shake or stir to rotate the pieces. Then bake for another 10 minutes. (Total bake time: 25 minutes.)",
            "Make Sauce:While baking is happening, shake up the sauce ingredients in a jar until smooth.",
            "Sauce on Tofu:Pour just enough sauce over the tofu to coat; toss to combine. Return to the oven for another 5-10 minutes, checking every so often to prevent burning, until golden brown.",
            "Done!Remove the pan from the oven and toss with a fresh drizzle of sauce. Serve with rice and a vegetable, and top with chopped peanuts, cilantro, green onion, and any remaining sauce. SO GOOD!"
        ]
    },
    {
        "NUMBER": "10",
        "TITLE": "Ridiculously Good Chicken Tacos with Green Sauce",
        "LINK": "https://pinchofyum.com/chicken-tacos",
        "PREP_TIME": "22 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken thighs\n1/2 tablespoon soy sauce\n1/2 tablespoon avocado oil\n1 clove garlic, grated (or 1 tsp of garlic paste, or 1/2 teaspoon garlic powder)\n2-3 tablespoons taco seasoning (I use Siete brand)\n1/2 avocado\n1/2 cup mayo\n3-ounce chunk of cotjia cheese\n1 big handful of cilantro stems and leaves (roughly 1/2 cup)\n1 clove garlic\njuice of 1-2 limes (2 tablespoons)\n2 tablespoons water (more as needed)\nTortillas\nLimes, cilantro, and onion for topping"
        ],
        "INSTRUCTIONS": [
            "Season the Chicken:Trim the fat off the chicken thighs if you want (I do). Toss the chicken thighs with soy sauce, oil, and garlic. Sprinkle with taco seasoning and give it a quick mix.",
            "Cook the Chicken:Place the chicken in the basket of an air fryer (alternate cooking instructions in the notes). Air fry at 400 degrees for 10-12 minutes – at this point it should be very crusty, golden, juicy, and delicious.",
            "Make the Sauce:While the chicken is cooking, blitz up the sauce in a small food processor or blender. If it’s too thick, add more water. If it’s too thin, add a bit more avocado or mayo.",
            "Chop the Chicken:When the chicken is done, let it stand for a few minutes and then roughly chop or pull it into bite-sized pieces. Squeeze some lime juice over it. *chef’s kiss*",
            "You’re Done! Yum!A dollop of sauce into a tortilla, a big pile of that juicy chicken, and finish with cilantro and diced onion (and probably more sauce)! It is a dream come true."
        ]
    },
    {
        "NUMBER": "11",
        "TITLE": "Garlic and Black Pepper Beef Skewers",
        "LINK": "https://pinchofyum.com/garlic-and-black-pepper-beef-skewers",
        "PREP_TIME": "20 minutes",
        "INGREDIENTS": [
            "lbs. skirt steak, cut against the grain into very thin strips (see photos and video)\n1 tablespoon soy sauce\n1 tablespoon garlic paste\n1 tablespoon ginger paste\n1 teaspoon coarse kosher salt\n1 teaspoons granulated sugar\n1 teaspoon curry powder\nfreshly cracked black pepper\nfish sauce, lime juice, chili crisp, and cilantro for topping\nrice\nbroccoli, bagged salad, or a quick cucumber salad, see notes!"
        ],
        "INSTRUCTIONS": [
            "Prep:Soak your skewers – 15 minutes minimum for wood skewers and cut your beef into strips.",
            "Beef:Mix the beef strips with the other beef ingredients. If you have time to marinate, go for it. A 30-45 minute marinating session is delicious! But I promise that if all you have is 5-10 minutes, they’ll still be great.",
            "Skewer:Thread the beef onto skewers – just scrunch it on there (see video). Place skewers on a parchment-lined baking sheet. Top with freshly cracked black pepper.",
            "Broil:Arrange an oven rack 4-6 inches below the heating element. Preheat the broiler on high heat for a few minutes. Broil the beef for 6 minutes – we’re going for caramelization on that top surface.(Alternative cooking methods in notes below)",
            "Serve:Let the beef stand for a few minutes; brush the golden tops with the pan juices, and drizzle with a bit of lime juice and fish sauce. MAGIC WILL HAPPEN. Top with cilantro or chili crisp and serve with a cucumber salad (recipe in notes). Holy smokes! You can eat them plain, drizzled, or in a rice bowl. They are finger licking good. I have been known to eat them standing right over the stove."
        ]
    },
    {
        "NUMBER": "12",
        "TITLE": "Chicken with Coconut Kale",
        "LINK": "https://pinchofyum.com/chicken-with-coconut-kale",
        "PREP_TIME": "25 minutes",
        "INGREDIENTS": [
            "1 lb. boneless skinless chicken breasts, cut or pounded into thin pieces\n2-3 tablespoons all-purpose chicken seasoning (I use the McCormick Rotisserie Chicken Seasoning)\n1 1/2 tablespoons avocado oil (divided)\n1 shallot, thinly sliced\n2-3 cups finely shredded curly kale, stems removed (about 3-4 stalks)\n1 tablespoon yellow curry paste (see notes for subs)\n1 can full-fat coconut milk\n1 tablespoon soy sauce\n1 tablespoon brown sugar\nrice\nchili crisp or cilantro for garnish"
        ],
        "INSTRUCTIONS": [
            "Cook the Chicken:Coat the chicken with the spices. In a large nonstick pan, heat 1 tablespoon of avocado oil over medium high heat. Add chicken and cook until golden brown and cooked through, about 2-3 minutes per side. Set chicken aside.",
            "Start the Coconut Kale:If needed, wipe your pan out (see notes). In the same pan, add 1/2 tablespoon avocado oil if needed. Saute the shallots, kale, and yellow curry paste for 5 minutes until everything is aromatic and tender.",
            "Simmer the Coconut Kale:Add all other sauce ingredients; simmer for 5-10 minutes to thicken. When the sauce has thickened, tuck the chicken back in the sauce. Let it get gently bubbly and spoon the sauce over top.",
            "You’re Done! Yum!Sprinkle the whole thing with cilantro. Serve chicken with scoops of the sauce over rice! Finish with whatever toppings you like – for me it’s chili crisp!"
        ]
    }
]